------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/ahmadlp/Dropbox/LL2020/Replication_Aug_2023/Stata/logs/10-table_Q1.log
  log type:  text
 opened on:   8 Aug 2023, 18:04:00

. 
. ********************* Clean & Build the Data File for FE Estimation ********************
. if "$access_to_datamyne" == "yes" {
. 
. use "data/exchange_rate_report_boc/exchange_rate_report.dta", clear
. collapse (mean) xrate_usd xrate_col,by( month year country )
. 
. 
. gen CountryofOrigin=strupper(country)
. sort CountryofOrigin
. collapse (mean) xrate_usd xrate_col , by(month year CountryofOrigin)
. 
. egen id=group(CountryofOrigin)
. gen date=ym(year, month)
. tsset id date

Panel variable: id (strongly balanced)
 Time variable: date, 564 to 660
         Delta: 1 unit
. 
. 
. local n_lag=6
. 
. forvalues y=1/`n_lag'  {
  2. local x = 12*`y'
  3. gen exc_col_F`y' = log(F`x'.xrate_col)
  4. gen exc_usd_F`y' = log(F`x2'.xrate_usd) 
  5. }
(912 missing values generated)
(83 missing values generated)
(1,824 missing values generated)
(83 missing values generated)
(2,736 missing values generated)
(83 missing values generated)
(3,648 missing values generated)
(83 missing values generated)
(4,560 missing values generated)
(83 missing values generated)
(5,472 missing values generated)
(83 missing values generated)
. 
. drop id
. 
. merge 1:m CountryofOrigin year month using "data/temp/colombia_imports_updated_hs.dta"
(variable CountryofOrigin was str24, now str50 to accommodate using data's values)
(variable year was int, now float to accommodate using data's values)
(variable month was byte, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                       272,394
        from master                     1,580  (_merge==1)
        from using                    270,814  (_merge==2)

    Matched                        17,003,919  (_merge==3)
    -----------------------------------------
. 
. destring  VATPercent TariffPercent ExchangeRate, replace
VATPercent: all characters numeric; replaced as double
(1580 missing values generated)
TariffPercent: all characters numeric; replaced as double
(1580 missing values generated)
ExchangeRate: all characters numeric; replaced as double
(1580 missing values generated)
. drop if CustomsValueTariffBase<0
(1 observation deleted)
. 
. 
. collapse (sum) CustomsValueTariffBase Valuetobepay Quantity (mean) VATPercent TariffPercent exc_col_F* exc_usd_F* [fw=CustomsValueTariffBase], by(ye
> ar ProductHS CountryofOrigin Provider)
. ***************************************
. 
. egen id = group(ProductHS CountryofOrigin Provider)
(13 missing values generated)
. drop if missing(id)
(13 observations deleted)
. tsset id year

Panel variable: id (unbalanced)
 Time variable: year, 2007 to 2013, but with gaps
         Delta: 1 unit
. 
. gen exc_usd= 0
. gen exc_col= 0 
. gen AUX1=0
. gen AUX2=0
. 
. forvalues y=1/`n_lag'  {
  2. 
. replace exc_col = exc_col + L`y'.exc_col_F`y' if !missing( L`y'.exc_col_F`y')
  3. replace AUX1 = AUX1 + 1 if !missing( L`y'.exc_col_F`y')
  4. replace exc_usd = exc_usd + L`y'.exc_usd_F`y' if !missing( L`y'.exc_usd_F`y')
  5. replace AUX2 = AUX2 + 1 if !missing( L`y'.exc_usd_F`y')
  6. }
(1,329,813 real changes made)
(1,331,452 real changes made)
(992,955 real changes made)
(1,331,450 real changes made)
(865,566 real changes made)
(866,484 real changes made)
(637,941 real changes made)
(866,480 real changes made)
(576,848 real changes made)
(577,381 real changes made)
(420,338 real changes made)
(577,378 real changes made)
(372,514 real changes made)
(372,852 real changes made)
(269,445 real changes made)
(372,849 real changes made)
(216,683 real changes made)
(216,852 real changes made)
(155,378 real changes made)
(216,851 real changes made)
(95,492 real changes made)
(95,561 real changes made)
(68,085 real changes made)
(95,561 real changes made)
. replace exc_col=exc_col/AUX1
(3,093,614 real changes made, 2,210,180 to missing)
. replace exc_usd=exc_usd/AUX2
(2,860,021 real changes made, 2,210,185 to missing)
. drop AUX1 AUX2
. 
. ****************************************
. ** Save Data -- Firm Level
. ****************************************
. gen x_whi = CustomsValueTariffBase + Valuetobepay
. 
. ****************************************
. ** Construct Within-National Shares
. ****************************************
. bysort year ProductHS CountryofOrigin : egen x_hi=total(x_whi)
. 
. gen ln_cond_lambda = log(x_whi/x_hi)
. *****************************************
. 
. gen price=x_whi/Quantity
(14 missing values generated)
. gen lprice=log(price)
(14 missing values generated)
. gen lvat=log(1+0.01*VATPercent)
. gen ltariff=log(1+0.01*TariffPercent)
. gen ltax = lvat + ltariff
. 
. gen ln_x_wih = log(x_whi)
. gen ln_q_wih = log(Quantity)
(14 missing values generated)
. 
. 
. gen hs8=substr(ProductHS,1,8)
. destring hs8, replace
hs8: all characters numeric; replaced as long
. 
. egen panelvar = group(ProductHS CountryofOrigin Provider)
. drop if missing(panelvar)
(0 observations deleted)
. 
. *******************************************************
. ** Contructing Khandelwal IVs for Within-National Share
. ********************************************************
. 
. * number of firms exporting from country i in product h
. bysort year CountryofOrigin ProductHS: gen ln_nfirms=log(_N)
. 
. * number of products firm w exports in
. bysort year CountryofOrigin Provider: gen ln_nproducts=log(_N)
. 
. tsset id year

Panel variable: id (unbalanced)
 Time variable: year, 2007 to 2013, but with gaps
         Delta: 1 unit
. gen ltariff_lag = L.ltariff
(2,460,852 missing values generated)
. gen ltax_lag = L.ltax
(2,460,852 missing values generated)
. 
. ********************************************************
. xtset panelvar year

Panel variable: panelvar (unbalanced)
 Time variable: year, 2007 to 2013, but with gaps
         Delta: 1 unit
. foreach var in lprice ln_x_wih ltax ltariff lvat ln_cond_lambda ln_nfirms ln_nproducts {
  2.         gen D`var'=100*D.`var'
  3.         }
(2,460,854 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
.         
.         *keep if Dln_x_wih!=.
. ********************************************************        
. 
. egen fe1=group(ProductHS year)
. gen fe2=panelvar
. 
. *drop if Quantity<=1
. *drop if FOBValueUS<500
. 
. keep exc_col exc_usd  fe1 fe2 ProductHS ln_x_wih ln_cond_lambda lprice ltariff lvat ltax ln_nfirms ln_nproducts ltariff_lag ltax_lag year D*
. 
. save data/temp/colombia_imports_appendix_Q, replace
(file data/temp/colombia_imports_appendix_Q.dta not found)
file data/temp/colombia_imports_appendix_Q.dta saved
. *******************************************************************************************
. use "data/temp/colombia_imports_appendix_Q.dta", clear
. 
. *----- define new variables for saving estimation results ----
. gen theta = .
(3,807,088 missing values generated)
. gen theta_se = .
(3,807,088 missing values generated)
. label var theta "estimated trade elasticity ~ (sigma - 1)"
. label var theta_se "std error of estimated trade elasticity "
. 
. gen a = .
(3,807,088 missing values generated)
. gen a_se = .
(3,807,088 missing values generated)
. label var a "estimated coefficient on nest share ~ alpha"
. label var a_se "std error of estimated coefficient on nest share"
. 
. gen psi = .
(3,807,088 missing values generated)
. gen psi_se = .
(3,807,088 missing values generated)
. label var psi "estimated scale elasticity"
. label var psi_se "std error of estimated scale elasticity"
. 
. gen fstat = .
(3,807,088 missing values generated)
. gen obsv = .
(3,807,088 missing values generated)
. gen id = .
(3,807,088 missing values generated)
. label var fstat "first-stage Fstat"
. label var obsv "number of observations"
. label var id "industry number: 1-16"
. 
. 
. gen hs2=substr(ProductHS,1,2)
. destring hs2, replace
hs2: all characters numeric; replaced as byte
. gen mnf=(hs2>=30 & hs2<=38) | (hs2>=42 & hs2<=97)
. drop hs2
. 
. gen hs6=substr(ProductHS,1,6)
. destring hs6, replace
hs6: all characters numeric; replaced as long
. 
. merge m:1 hs6 using "./data/concordance/isic_hs6.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                        31,415
        from master                    31,225  (_merge==1)
        from using                        190  (_merge==2)

    Matched                         3,775,863  (_merge==3)
    -----------------------------------------
. replace isic=3600 if _merge == 1
(31,225 real changes made)
. drop _merge
. 
. bysort fe1: egen ub=pctile(lprice), p(99)
(190 missing values generated)
. bysort fe1: egen lb=pctile(lprice), p(1)
(190 missing values generated)
. drop if lprice>ub | lprice<lb
(52,554 observations deleted)
. 
. set more off
.         #delimit;
delimiter now ;
. ivreghdfe ln_x_wih  (lprice ln_cond_lambda =  exc_col exc_usd ltax ln_nfirms ln_nproducts) 
>         if isic>=100 & isic<1500, a(fe1 fe2) cluster(fe2);
(dropped 2820 singleton observations)
(MWFE estimator converged in 19 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on fe2

Number of clusters (fe2) =        3067                Number of obs =    10762
                                                      F(  2,  3066) =     4.38
                                                      Prob > F      =   0.0126
Total (centered) SS     =  16185.31955                Centered R2   =  -1.7619
Total (uncentered) SS   =  16185.31955                Uncentered R2 =  -1.7619
Residual SS             =  44702.07834                Root MSE      =    2.153

--------------------------------------------------------------------------------
               |               Robust
      ln_x_wih | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
        lprice |  -4.562636   1.738919    -2.62   0.009    -7.972201   -1.153071
ln_cond_lambda |   .3016814    .132399     2.28   0.023     .0420817    .5612811
--------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             11.540
                                                   Chi-sq(4) P-val =    0.0211
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                3.840
                         (Kleibergen-Paap rk Wald F statistic):          3.070
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    13.97
                                         10% maximal IV relative bias     8.78
                                         20% maximal IV relative bias     5.91
                                         30% maximal IV relative bias     4.79
                                         10% maximal IV size             19.45
                                         15% maximal IV size             11.22
                                         20% maximal IV size              8.38
                                         25% maximal IV size              6.89
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         9.058
                                                   Chi-sq(3) P-val =    0.0285
------------------------------------------------------------------------------
Instrumented:         lprice ln_cond_lambda
Excluded instruments: exc_col exc_usd ltax ln_nfirms ln_nproducts
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      1120           0        1120     |
         fe2 |      3067        3067           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
. outreg using output/temp/Table_Q1_outeg.tex, varlabels tex fragment replace  
>         ctitle("" "A&M") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g );

                                                           --------------------------------
                                                                                  A&M     
                                                           --------------------------------
                                                            lprice               -4.563   
                                                                               (1.739)*** 
                                                            ln_cond_lambda       0.302    
                                                                               (0.132)**  
                                                            N Obs.               10,762   
                                                            Weak Ident Test       3.07    
                                                            UnderIdent P-val      0.02    
                                                            N Prod-Year grs.       .      
                                                           --------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01

.         replace theta = -_b[lprice]  if isic>=100 & isic<1500;
(29,061 real changes made)
.         replace theta_se = _se[lprice]  if isic>=100 & isic<1500;
(29,061 real changes made)
.         replace psi = -(1 - _b[ln_cond_lambda])/_b[lprice]  if isic>=100 & isic<1500;
(29,061 real changes made)
.         replace psi_se = psi * ( (_se[lprice]/_b[lprice])^2 
>         + (_se[ln_cond_lambda]/_b[ln_cond_lambda])^2 )^0.5 if isic>=100 & isic<1500;
(29,061 real changes made)
.         replace a = 1- _b[ln_cond_lambda]  if isic>=100 & isic<1500;
(29,061 real changes made)
.                         replace a_se = _se[ln_cond_lambda]  if isic>=100 & isic<1500;
(29,061 real changes made)
.         replace fstat = e(widstat) if isic>=100 & isic<1500;
(29,061 real changes made)
.         replace obsv =  e(N) if isic>=100 & isic<1500;
(29,061 real changes made)
.         replace id=1 if isic>=100 & isic<1500;
(29,061 real changes made)
. ivreghdfe ln_x_wih  (lprice ln_cond_lambda = exc_col exc_usd ln_nfirms ln_nproducts ltax) 
>         if isic>=1500 & isic<1700, a(fe1 fe2) cluster(fe2);
(dropped 4346 singleton observations)
(MWFE estimator converged in 22 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on fe2

Number of clusters (fe2) =        5071                Number of obs =    17594
                                                      F(  2,  5070) =     5.54
                                                      Prob > F      =   0.0039
Total (centered) SS     =  19877.00802                Centered R2   =  -0.3341
Total (uncentered) SS   =  19877.00802                Uncentered R2 =  -0.3341
Residual SS             =  26518.19059                Root MSE      =    1.292

--------------------------------------------------------------------------------
               |               Robust
      ln_x_wih | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
        lprice |  -2.475719   .8180531    -3.03   0.002    -4.079457   -.8719818
ln_cond_lambda |   .0733935   .0500713     1.47   0.143    -.0247679    .1715549
--------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             24.493
                                                   Chi-sq(4) P-val =    0.0001
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               17.672
                         (Kleibergen-Paap rk Wald F statistic):          5.009
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    13.97
                                         10% maximal IV relative bias     8.78
                                         20% maximal IV relative bias     5.91
                                         30% maximal IV relative bias     4.79
                                         10% maximal IV size             19.45
                                         15% maximal IV size             11.22
                                         20% maximal IV size              8.38
                                         25% maximal IV size              6.89
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):        59.567
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         lprice ln_cond_lambda
Excluded instruments: exc_col exc_usd ln_nfirms ln_nproducts ltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      1698           0        1698     |
         fe2 |      5071        5071           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
.  outreg using output/temp/Table_Q1_outeg.tex, varlabels tex fragment merge  
>         ctitle( "" "Food") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g );

                                                     --------------------------------------------
                                                                            A&M         Food    
                                                     --------------------------------------------
                                                      lprice               -4.563      -2.476   
                                                                         (1.739)***  (0.818)*** 
                                                      ln_cond_lambda       0.302       0.073    
                                                                         (0.132)**    (0.050)   
                                                      N Obs.               10,762      17,594   
                                                      Weak Ident Test       3.07        5.01    
                                                      UnderIdent P-val      0.02        0.00    
                                                      N Prod-Year grs.       .           .      
                                                     --------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01

.         replace theta = -_b[lprice]  if isic>=1500 & isic<1700;
(43,694 real changes made)
.         replace theta_se = _se[lprice]  if isic>=1500 & isic<1700;
(43,694 real changes made)
.         replace psi = -(1 - _b[ln_cond_lambda])/_b[lprice]  if isic>=1500 & isic<1700;
(43,694 real changes made)
.         replace psi_se = psi * ( (_se[lprice]/_b[lprice])^2 
>                 + (_se[ln_cond_lambda]/_b[ln_cond_lambda])^2 )^0.5 if isic>=1500 & isic<1700;
(43,694 real changes made)
.         replace a = 1- _b[ln_cond_lambda]  if isic>=1500 & isic<1700;
(43,694 real changes made)
.                         replace a_se = _se[ln_cond_lambda]  if isic>=1500 & isic<1700;
(43,694 real changes made)
.         replace fstat = e(widstat) if isic>=1500 & isic<1700;
(43,694 real changes made)
.         replace obsv =  e(N) if isic>=1500 & isic<1700;
(43,694 real changes made)
.         replace id=2 if isic>=1500 & isic<1700;
(43,694 real changes made)
.         ivreghdfe ln_x_wih  (lprice ln_cond_lambda = exc_col exc_usd ln_nfirms ln_nproducts ltax) 
>         if isic>=1700 & isic<2000, a(fe1 fe2) cluster(fe2);
(dropped 39500 singleton observations)
(MWFE estimator converged in 22 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on fe2

Number of clusters (fe2) =       35447                Number of obs =   110925
                                                      F(  2, 35446) =   173.89
                                                      Prob > F      =   0.0000
Total (centered) SS     =  340849.9943                Centered R2   =  -0.1216
Total (uncentered) SS   =  340849.9943                Uncentered R2 =  -0.1216
Residual SS             =  382309.6963                Root MSE      =    1.888

--------------------------------------------------------------------------------
               |               Robust
      ln_x_wih | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
        lprice |  -3.255786   .2966882   -10.97   0.000    -3.837304   -2.674268
ln_cond_lambda |   .3152199   .0226827    13.90   0.000     .2707612    .3596787
--------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):            274.733
                                                   Chi-sq(4) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              129.572
                         (Kleibergen-Paap rk Wald F statistic):         59.944
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    13.97
                                         10% maximal IV relative bias     8.78
                                         20% maximal IV relative bias     5.91
                                         30% maximal IV relative bias     4.79
                                         10% maximal IV size             19.45
                                         15% maximal IV size             11.22
                                         20% maximal IV size              8.38
                                         25% maximal IV size              6.89
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):       819.418
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         lprice ln_cond_lambda
Excluded instruments: exc_col exc_usd ln_nfirms ln_nproducts ltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      3671           0        3671     |
         fe2 |     35447       35447           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
. outreg using output/temp/Table_Q1_outeg.tex, varlabels tex fragment merge  
>         ctitle( "" "Text&L&F") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g );

                                               --------------------------------------------------------
                                                                      A&M         Food      Text&L&F  
                                               --------------------------------------------------------
                                                lprice               -4.563      -2.476      -3.256   
                                                                   (1.739)***  (0.818)***  (0.297)*** 
                                                ln_cond_lambda       0.302       0.073       0.315    
                                                                   (0.132)**    (0.050)    (0.023)*** 
                                                N Obs.               10,762      17,594     110,925   
                                                Weak Ident Test       3.07        5.01       59.94    
                                                UnderIdent P-val      0.02        0.00        0.00    
                                                N Prod-Year grs.       .           .           .      
                                               --------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01

.         replace theta = -_b[lprice]  if isic>=1700 & isic<2000;
(411,653 real changes made)
.         replace theta_se = _se[lprice]  if isic>=1700 & isic<2000;
(411,653 real changes made)
.         replace psi = -(1 - _b[ln_cond_lambda])/_b[lprice]  if isic>=1700 & isic<2000;
(411,653 real changes made)
.         replace psi_se = psi * ( (_se[lprice]/_b[lprice])^2 
>                 + (_se[ln_cond_lambda]/_b[ln_cond_lambda])^2 )^0.5 if isic>=1700 & isic<2000;
(411,653 real changes made)
.         replace a = 1- _b[ln_cond_lambda]  if isic>=1700 & isic<2000;
(411,653 real changes made)
.                         replace a_se = _se[ln_cond_lambda]  if isic>=1700 & isic<2000;
(411,653 real changes made)
.         replace fstat = e(widstat) if isic>=1700 & isic<2000;
(411,653 real changes made)
.         replace obsv =  e(N) if isic>=1700 & isic<2000;
(411,653 real changes made)
.         replace id=3 if isic>=1700 & isic<2000;
(411,653 real changes made)
. ivreghdfe ln_x_wih  (lprice ln_cond_lambda = exc_col exc_usd ln_nfirms ln_nproducts ltax) 
>         if isic>=2000 & isic<2100, a(fe1 fe2) cluster(fe2);
(dropped 2071 singleton observations)
(MWFE estimator converged in 16 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on fe2

Number of clusters (fe2) =        1698                Number of obs =     5282
                                                      F(  2,  1697) =     1.92
                                                      Prob > F      =   0.1473
Total (centered) SS     =  14612.41641                Centered R2   =  -1.2503
Total (uncentered) SS   =  14612.41641                Uncentered R2 =  -1.2503
Residual SS             =   32881.7802                Root MSE      =    2.578

--------------------------------------------------------------------------------
               |               Robust
      ln_x_wih | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
        lprice |  -2.092878   1.195506    -1.75   0.080    -4.437699     .251943
ln_cond_lambda |   .1069298   .1911572     0.56   0.576    -.2679989    .4818584
--------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):              5.863
                                                   Chi-sq(4) P-val =    0.2096
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                1.792
                         (Kleibergen-Paap rk Wald F statistic):          2.124
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    13.97
                                         10% maximal IV relative bias     8.78
                                         20% maximal IV relative bias     5.91
                                         30% maximal IV relative bias     4.79
                                         10% maximal IV size             19.45
                                         15% maximal IV size             11.22
                                         20% maximal IV size              8.38
                                         25% maximal IV size              6.89
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         6.445
                                                   Chi-sq(3) P-val =    0.0918
------------------------------------------------------------------------------
Instrumented:         lprice ln_cond_lambda
Excluded instruments: exc_col exc_usd ln_nfirms ln_nproducts ltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |       334           0         334     |
         fe2 |      1698        1698           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
. outreg using output/temp/Table_Q1_outeg.tex, varlabels tex fragment merge  
>         ctitle("" "Wood") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

                                          ------------------------------------------------------------------
                                                                 A&M         Food      Text&L&F     Wood   
                                          ------------------------------------------------------------------
                                           lprice               -4.563      -2.476      -3.256     -2.093  
                                                              (1.739)***  (0.818)***  (0.297)***  (1.196)* 
                                           ln_cond_lambda       0.302       0.073       0.315      0.107   
                                                              (0.132)**    (0.050)    (0.023)***  (0.191)  
                                           N Obs.               10,762      17,594     110,925     5,282   
                                           Weak Ident Test       3.07        5.01       59.94       2.12   
                                           UnderIdent P-val      0.02        0.00        0.00       0.21   
                                           N Prod-Year grs.       .           .           .          .     
                                          ------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01

.         replace theta = -_b[lprice]  if isic>=2000 & isic<2100;
(20,998 real changes made)
.         replace theta_se = _se[lprice]  if isic>=2000 & isic<2100;
(20,998 real changes made)
.         replace psi = -(1 - _b[ln_cond_lambda])/_b[lprice]  if isic>=2000 & isic<2100;
(20,998 real changes made)
.         replace psi_se = psi * ( (_se[lprice]/_b[lprice])^2 
>                 + (_se[ln_cond_lambda]/_b[ln_cond_lambda])^2 )^0.5 if isic>=2000 & isic<2100;
(20,998 real changes made)
.         replace a = 1- _b[ln_cond_lambda]  if isic>=2000 & isic<2100;
(20,998 real changes made)
.                         replace a_se = _se[ln_cond_lambda]  if isic>=2000 & isic<2100;
(20,998 real changes made)
.         replace fstat = e(widstat) if isic>=2000 & isic<2100;
(20,998 real changes made)
.         replace obsv =  e(N) if isic>=2000 & isic<2100;
(20,998 real changes made)
.         replace id=4 if isic>=2000 & isic<2100;
(20,998 real changes made)
.         ivreghdfe ln_x_wih  (lprice ln_cond_lambda = exc_col exc_usd ln_nfirms ln_nproducts ltax) 
>         if isic>=2100 & isic<2300, a(fe1 fe2) cluster(fe2);
(dropped 11269 singleton observations)
(MWFE estimator converged in 17 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on fe2

Number of clusters (fe2) =       10743                Number of obs =    35058
                                                      F(  2, 10742) =     2.39
                                                      Prob > F      =   0.0920
Total (centered) SS     =  127068.4766                Centered R2   =  -9.6724
Total (uncentered) SS   =  127068.4766                Uncentered R2 =  -9.6724
Residual SS             =  1356125.911                Root MSE      =    6.304

--------------------------------------------------------------------------------
               |               Robust
      ln_x_wih | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
        lprice |   -7.85754   3.953187    -1.99   0.047    -15.60652   -.1085623
ln_cond_lambda |   .1051635   .1544888     0.68   0.496    -.1976631    .4079901
--------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):              5.142
                                                   Chi-sq(4) P-val =    0.2730
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                1.726
                         (Kleibergen-Paap rk Wald F statistic):          2.005
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    13.97
                                         10% maximal IV relative bias     8.78
                                         20% maximal IV relative bias     5.91
                                         30% maximal IV relative bias     4.79
                                         10% maximal IV size             19.45
                                         15% maximal IV size             11.22
                                         20% maximal IV size              8.38
                                         25% maximal IV size              6.89
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         4.486
                                                   Chi-sq(3) P-val =    0.2136
------------------------------------------------------------------------------
Instrumented:         lprice ln_cond_lambda
Excluded instruments: exc_col exc_usd ln_nfirms ln_nproducts ltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |       926           0         926     |
         fe2 |     10743       10743           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
.   outreg using output/temp/Table_Q1_outeg.tex, varlabels tex fragment merge  
>         ctitle("" "Paper") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

                                    -----------------------------------------------------------------------------
                                                           A&M         Food      Text&L&F     Wood      Paper   
                                    -----------------------------------------------------------------------------
                                     lprice               -4.563      -2.476      -3.256     -2.093    -7.858   
                                                        (1.739)***  (0.818)***  (0.297)***  (1.196)*  (3.953)** 
                                     ln_cond_lambda       0.302       0.073       0.315      0.107      0.105   
                                                        (0.132)**    (0.050)    (0.023)***  (0.191)    (0.154)  
                                     N Obs.               10,762      17,594     110,925     5,282     35,058   
                                     Weak Ident Test       3.07        5.01       59.94       2.12      2.00    
                                     UnderIdent P-val      0.02        0.00        0.00       0.21      0.27    
                                     N Prod-Year grs.       .           .           .          .          .     
                                    -----------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01

.         replace theta = -_b[lprice]  if isic>=2100 & isic<2300;
(123,995 real changes made)
.         replace theta_se = _se[lprice]  if isic>=2100 & isic<2300;
(123,995 real changes made)
.         replace psi = -(1 - _b[ln_cond_lambda])/_b[lprice]  if isic>=2100 & isic<2300;
(123,995 real changes made)
.         replace psi_se = psi * ( (_se[lprice]/_b[lprice])^2 
>                 + (_se[ln_cond_lambda]/_b[ln_cond_lambda])^2 )^0.5 if isic>=2100 & isic<2300;
(123,995 real changes made)
.         replace a = 1- _b[ln_cond_lambda]  if isic>=2100 & isic<2300;
(123,995 real changes made)
.                 replace a_se = _se[ln_cond_lambda]  if isic>=2100 & isic<2300;
(123,995 real changes made)
.     replace fstat = e(widstat) if isic>=2100 & isic<2300;
(123,995 real changes made)
.         replace obsv =  e(N) if isic>=2100 & isic<2300;
(123,995 real changes made)
.         replace id=5 if isic>=2100 & isic<2300;
(123,995 real changes made)
. ivreghdfe ln_x_wih  (lprice ln_cond_lambda = exc_col exc_usd ln_nfirms ln_nproducts ltariff) 
>  if isic>=2300 & isic<2400, a(fe1 fe2) cluster(fe2);
(dropped 938 singleton observations)
(MWFE estimator converged in 14 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on fe2

Number of clusters (fe2) =        1040                Number of obs =     3675
                                                      F(  2,  1039) =     0.93
                                                      Prob > F      =   0.3952
Total (centered) SS     =  8565.488002                Centered R2   =  -2.9817
Total (uncentered) SS   =  8565.488002                Uncentered R2 =  -2.9817
Residual SS             =  34105.34465                Root MSE      =    3.117

--------------------------------------------------------------------------------
               |               Robust
      ln_x_wih | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
        lprice |  -2.080172   1.811907    -1.15   0.251    -5.635587    1.475243
ln_cond_lambda |  -.0280658   .1996152    -0.14   0.888    -.4197606    .3636291
--------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):              2.752
                                                   Chi-sq(4) P-val =    0.6001
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                0.882
                         (Kleibergen-Paap rk Wald F statistic):          1.527
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    13.97
                                         10% maximal IV relative bias     8.78
                                         20% maximal IV relative bias     5.91
                                         30% maximal IV relative bias     4.79
                                         10% maximal IV size             19.45
                                         15% maximal IV size             11.22
                                         20% maximal IV size              8.38
                                         25% maximal IV size              6.89
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         3.160
                                                   Chi-sq(3) P-val =    0.3676
------------------------------------------------------------------------------
Instrumented:         lprice ln_cond_lambda
Excluded instruments: exc_col exc_usd ln_nfirms ln_nproducts ltariff
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |       162           0         162     |
         fe2 |      1040        1040           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
.    //fuller(15)
> outreg using output/temp/Table_Q1_outeg.tex, varlabels tex fragment merge  
>         ctitle("" "Petr") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

                                --------------------------------------------------------------------------------------
                                                       A&M         Food      Text&L&F     Wood      Paper     Petr   
                                --------------------------------------------------------------------------------------
                                 lprice               -4.563      -2.476      -3.256     -2.093    -7.858    -2.080  
                                                    (1.739)***  (0.818)***  (0.297)***  (1.196)*  (3.953)**  (1.812) 
                                 ln_cond_lambda       0.302       0.073       0.315      0.107      0.105    -0.028  
                                                    (0.132)**    (0.050)    (0.023)***  (0.191)    (0.154)   (0.200) 
                                 N Obs.               10,762      17,594     110,925     5,282     35,058     3,675  
                                 Weak Ident Test       3.07        5.01       59.94       2.12      2.00      1.53   
                                 UnderIdent P-val      0.02        0.00        0.00       0.21      0.27      0.60   
                                 N Prod-Year grs.       .           .           .          .          .         .    
                                --------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01

.         replace theta = -_b[lprice]   if isic>=2300 & isic<2400;
(9,723 real changes made)
.         replace theta_se = _se[lprice]  if isic>=2300 & isic<2400;
(9,723 real changes made)
.         replace psi = -(1 - _b[ln_cond_lambda])/_b[lprice]  if isic>=2300 & isic<2400;
(9,723 real changes made)
.         replace psi_se = psi * ( (_se[lprice]/_b[lprice])^2
>                 + (_se[ln_cond_lambda]/_b[ln_cond_lambda])^2 )^0.5 if isic>=2300 & isic<2400;
(9,723 real changes made)
.         replace a = 1 - _b[ln_cond_lambda]  if isic>=2300 & isic<2400;
(9,723 real changes made)
.                         replace a_se = _se[ln_cond_lambda]  if isic>=2300 & isic<2400;
(9,723 real changes made)
.         replace fstat = e(widstat) if isic>=2300 & isic<2400;
(9,723 real changes made)
.         replace obsv =  e(N) if isic>=2300 & isic<2400;
(9,723 real changes made)
.         replace id=6 if isic>=2300 & isic<2400;
(9,723 real changes made)
.         ivreghdfe ln_x_wih  (lprice ln_cond_lambda = exc_col exc_usd ln_nfirms ln_nproducts ltax) 
>         if isic>=2400 & isic<2500, a(fe1 fe2) cluster(fe2);
(dropped 24864 singleton observations)
(MWFE estimator converged in 22 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on fe2

Number of clusters (fe2) =       35638                Number of obs =   127946
                                                      F(  2, 35637) =    51.79
                                                      Prob > F      =   0.0000
Total (centered) SS     =  276947.2029                Centered R2   =  -2.4657
Total (uncentered) SS   =  276947.2029                Uncentered R2 =  -2.4657
Residual SS             =  959829.4784                Root MSE      =    2.813

--------------------------------------------------------------------------------
               |               Robust
      ln_x_wih | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
        lprice |  -4.737527   .4962361    -9.55   0.000    -5.710165   -3.764889
ln_cond_lambda |   .0872475   .0309957     2.81   0.005      .026495    .1479999
--------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):            148.529
                                                   Chi-sq(4) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               64.830
                         (Kleibergen-Paap rk Wald F statistic):         29.714
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    13.97
                                         10% maximal IV relative bias     8.78
                                         20% maximal IV relative bias     5.91
                                         30% maximal IV relative bias     4.79
                                         10% maximal IV size             19.45
                                         15% maximal IV size             11.22
                                         20% maximal IV size              8.38
                                         25% maximal IV size              6.89
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):        29.833
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         lprice ln_cond_lambda
Excluded instruments: exc_col exc_usd ln_nfirms ln_nproducts ltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      6618           0        6618     |
         fe2 |     35638       35638           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
. outreg using output/temp/Table_Q1_outeg.tex, varlabels tex fragment merge  
>         ctitle("" "Chem") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

                          --------------------------------------------------------------------------------------------------
                                                 A&M         Food      Text&L&F     Wood      Paper     Petr       Chem    
                          --------------------------------------------------------------------------------------------------
                           lprice               -4.563      -2.476      -3.256     -2.093    -7.858    -2.080     -4.738   
                                              (1.739)***  (0.818)***  (0.297)***  (1.196)*  (3.953)**  (1.812)  (0.496)*** 
                           ln_cond_lambda       0.302       0.073       0.315      0.107      0.105    -0.028     0.087    
                                              (0.132)**    (0.050)    (0.023)***  (0.191)    (0.154)   (0.200)  (0.031)*** 
                           N Obs.               10,762      17,594     110,925     5,282     35,058     3,675    127,946   
                           Weak Ident Test       3.07        5.01       59.94       2.12      2.00      1.53      29.71    
                           UnderIdent P-val      0.02        0.00        0.00       0.21      0.27      0.60       0.00    
                           N Prod-Year grs.       .           .           .          .          .         .         .      
                          --------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01

.         replace theta = -_b[lprice]  if isic>=2400 & isic<2500;
(297,972 real changes made)
.         replace theta_se = _se[lprice]  if isic>=2400 & isic<2500;
(297,972 real changes made)
.         replace psi = -(1 - _b[ln_cond_lambda])/_b[lprice]  if isic>=2400 & isic<2500;
(297,972 real changes made)
.         replace psi_se = psi * ( (_se[lprice]/_b[lprice])^2 
>                 + (_se[ln_cond_lambda]/_b[ln_cond_lambda])^2 )^0.5 if isic>=2400 & isic<2500;
(297,972 real changes made)
.         replace a = 1 - _b[ln_cond_lambda]  if isic>=2400 & isic<2500;
(297,972 real changes made)
.                         replace a_se = _se[ln_cond_lambda]  if isic>=2400 & isic<2500;
(297,972 real changes made)
.         replace fstat = e(widstat)+1 if isic>=2400 & isic<2500;
(297,972 real changes made)
.         replace obsv =  e(N) if isic>=2400 & isic<2500;
(297,972 real changes made)
.         replace id=7 if isic>=2400 & isic<2500;
(297,972 real changes made)
.         ivreghdfe ln_x_wih  (lprice ln_cond_lambda = exc_col ln_nfirms ln_nproducts ltax) 
>         if isic>=2500 & isic<2600, a(fe1 fe2) cluster(fe2);
(dropped 27117 singleton observations)
(MWFE estimator converged in 16 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on fe2

Number of clusters (fe2) =       30353                Number of obs =   101730
                                                      F(  2, 30352) =    62.95
                                                      Prob > F      =   0.0000
Total (centered) SS     =  367889.0094                Centered R2   =  -2.6917
Total (uncentered) SS   =  367889.0094                Uncentered R2 =  -2.6917
Residual SS             =  1358137.218                Root MSE      =    3.674

--------------------------------------------------------------------------------
               |               Robust
      ln_x_wih | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
        lprice |   -4.02531   .7908075    -5.09   0.000    -5.575327   -2.475294
ln_cond_lambda |   .3356805   .0624187     5.38   0.000     .2133372    .4580239
--------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             35.999
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               18.356
                         (Kleibergen-Paap rk Wald F statistic):          9.948
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):       102.986
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         lprice ln_cond_lambda
Excluded instruments: exc_col ln_nfirms ln_nproducts ltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      1097           0        1097     |
         fe2 |     30353       30353           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
.   outreg using output/temp/Table_Q1_outeg.tex, varlabels tex fragment merge  
>         ctitle("" "Rub&Plas") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

                    --------------------------------------------------------------------------------------------------------------
                                           A&M         Food      Text&L&F     Wood      Paper     Petr       Chem      Rub&Plas  
                    --------------------------------------------------------------------------------------------------------------
                     lprice               -4.563      -2.476      -3.256     -2.093    -7.858    -2.080     -4.738      -4.025   
                                        (1.739)***  (0.818)***  (0.297)***  (1.196)*  (3.953)**  (1.812)  (0.496)***  (0.791)*** 
                     ln_cond_lambda       0.302       0.073       0.315      0.107      0.105    -0.028     0.087       0.336    
                                        (0.132)**    (0.050)    (0.023)***  (0.191)    (0.154)   (0.200)  (0.031)***  (0.062)*** 
                     N Obs.               10,762      17,594     110,925     5,282     35,058     3,675    127,946     101,730   
                     Weak Ident Test       3.07        5.01       59.94       2.12      2.00      1.53      29.71        9.95    
                     UnderIdent P-val      0.02        0.00        0.00       0.21      0.27      0.60       0.00        0.00    
                     N Prod-Year grs.       .           .           .          .          .         .         .           .      
                    --------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01

.         replace theta = -_b[lprice]  if isic>=2500 & isic<2600;
(298,485 real changes made)
.         replace theta_se = _se[lprice]  if isic>=2500 & isic<2600;
(298,485 real changes made)
.         replace psi = -(1 - _b[ln_cond_lambda])/_b[lprice]  if isic>=2500 & isic<2600;
(298,485 real changes made)
.         replace psi_se = psi * ( (_se[lprice]/_b[lprice])^2 
>                 + (_se[ln_cond_lambda]/_b[ln_cond_lambda])^2 )^0.5 if isic>=2500 & isic<2600;
(298,485 real changes made)
.         replace a = 1- _b[ln_cond_lambda]  if isic>=2500 & isic<2600;
(298,485 real changes made)
.                                 replace a_se = _se[ln_cond_lambda]  if isic>=2500 & isic<2600;
(298,485 real changes made)
.         replace fstat = e(widstat) if isic>=2500 & isic<2600;
(298,485 real changes made)
.         replace obsv =  e(N) if isic>=2500 & isic<2600;
(298,485 real changes made)
.         replace id=8 if isic>=2500 & isic<2600;
(298,485 real changes made)
.         ivreghdfe ln_x_wih  (lprice ln_cond_lambda = exc_col exc_usd ln_nfirms ln_nproducts ltax) 
>         if isic>=2600 & isic<2900, a(fe1 fe2) cluster(fe2);
(dropped 47723 singleton observations)
(MWFE estimator converged in 21 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on fe2

Number of clusters (fe2) =       52212                Number of obs =   173432
                                                      F(  2, 52211) =   156.71
                                                      Prob > F      =   0.0000
Total (centered) SS     =  624525.7281                Centered R2   =  -1.2904
Total (uncentered) SS   =  624525.7281                Uncentered R2 =  -1.2904
Residual SS             =  1430401.515                Root MSE      =    2.905

--------------------------------------------------------------------------------
               |               Robust
      ln_x_wih | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
        lprice |  -3.390056   .4525259    -7.49   0.000    -4.277011   -2.503101
ln_cond_lambda |   .3186503   .0355182     8.97   0.000     .2490343    .3882664
--------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             96.145
                                                   Chi-sq(4) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               34.976
                         (Kleibergen-Paap rk Wald F statistic):         20.026
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    13.97
                                         10% maximal IV relative bias     8.78
                                         20% maximal IV relative bias     5.91
                                         30% maximal IV relative bias     4.79
                                         10% maximal IV size             19.45
                                         15% maximal IV size             11.22
                                         20% maximal IV size              8.38
                                         25% maximal IV size              6.89
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):       377.654
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         lprice ln_cond_lambda
Excluded instruments: exc_col exc_usd ln_nfirms ln_nproducts ltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      3921           0        3921     |
         fe2 |     52212       52212           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
.  outreg using output/temp/Table_Q1_outeg.tex, varlabels tex fragment merge  
>         ctitle("" "Miner & BasFaM") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

            ------------------------------------------------------------------------------------------------------------------------------
                                   A&M         Food      Text&L&F     Wood      Paper     Petr       Chem      Rub&Plas   Miner & BasFaM 
            ------------------------------------------------------------------------------------------------------------------------------
             lprice               -4.563      -2.476      -3.256     -2.093    -7.858    -2.080     -4.738      -4.025        -3.390     
                                (1.739)***  (0.818)***  (0.297)***  (1.196)*  (3.953)**  (1.812)  (0.496)***  (0.791)***    (0.453)***   
             ln_cond_lambda       0.302       0.073       0.315      0.107      0.105    -0.028     0.087       0.336         0.319      
                                (0.132)**    (0.050)    (0.023)***  (0.191)    (0.154)   (0.200)  (0.031)***  (0.062)***    (0.036)***   
             N Obs.               10,762      17,594     110,925     5,282     35,058     3,675    127,946     101,730       173,432     
             Weak Ident Test       3.07        5.01       59.94       2.12      2.00      1.53      29.71        9.95         20.03      
             UnderIdent P-val      0.02        0.00        0.00       0.21      0.27      0.60       0.00        0.00          0.00      
             N Prod-Year grs.       .           .           .          .          .         .         .           .             .        
            ------------------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01

.         replace theta = -_b[lprice]  if isic>=2600 & isic<2900;
(520,047 real changes made)
.         replace theta_se = _se[lprice]  if isic>=2600 & isic<2900;
(520,047 real changes made)
.         replace psi = -(1 - _b[ln_cond_lambda])/_b[lprice]  if isic>=2600 & isic<2900;
(520,047 real changes made)
.         replace psi_se = psi * ( (_se[lprice]/_b[lprice])^2 
>         + (_se[ln_cond_lambda]/_b[ln_cond_lambda])^2 )^0.5 if isic>=2600 & isic<2900;
(520,047 real changes made)
.         replace a = 1 - _b[ln_cond_lambda]  if isic>=2600 & isic<2900;
(520,047 real changes made)
.                 replace a_se = _se[ln_cond_lambda]  if isic>=2600 & isic<2900;
(520,047 real changes made)
.         replace fstat = e(widstat) if isic>=2600 & isic<2900;
(520,047 real changes made)
.         replace obsv =  e(N) if isic>=2600 & isic<2900;
(520,047 real changes made)
.         replace id=9 if isic>=2600 & isic<2900;
(520,047 real changes made)
.         ivreghdfe ln_x_wih  (lprice ln_cond_lambda = exc_col ln_nfirms ln_nproducts ltax) 
>         if isic>=2900 & isic<3100, a(fe1 fe2) cluster(fe2);
(dropped 68850 singleton observations)
(MWFE estimator converged in 20 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on fe2

Number of clusters (fe2) =       76616                Number of obs =   257788
                                                      F(  2, 76615) =    85.34
                                                      Prob > F      =   0.0000
Total (centered) SS     =  859750.8506                Centered R2   =  -4.2878
Total (uncentered) SS   =  859750.8506                Uncentered R2 =  -4.2878
Residual SS             =  4546223.692                Root MSE      =    4.231

--------------------------------------------------------------------------------
               |               Robust
      ln_x_wih | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
        lprice |  -4.401875   .6620697    -6.65   0.000    -5.699528   -3.104222
ln_cond_lambda |    .289859   .0437876     6.62   0.000     .2040356    .3756825
--------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             75.830
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               41.187
                         (Kleibergen-Paap rk Wald F statistic):         19.884
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):       193.965
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         lprice ln_cond_lambda
Excluded instruments: exc_col ln_nfirms ln_nproducts ltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      3848           0        3848     |
         fe2 |     76616       76616           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
.   outreg using output/temp/Table_Q1_outeg.tex, varlabels tex fragment merge  
>         ctitle("" "Mach") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

      ------------------------------------------------------------------------------------------------------------------------------------------
                             A&M         Food      Text&L&F     Wood      Paper     Petr       Chem      Rub&Plas   Miner & BasFaM     Mach    
      ------------------------------------------------------------------------------------------------------------------------------------------
       lprice               -4.563      -2.476      -3.256     -2.093    -7.858    -2.080     -4.738      -4.025        -3.390        -4.402   
                          (1.739)***  (0.818)***  (0.297)***  (1.196)*  (3.953)**  (1.812)  (0.496)***  (0.791)***    (0.453)***    (0.662)*** 
       ln_cond_lambda       0.302       0.073       0.315      0.107      0.105    -0.028     0.087       0.336         0.319         0.290    
                          (0.132)**    (0.050)    (0.023)***  (0.191)    (0.154)   (0.200)  (0.031)***  (0.062)***    (0.036)***    (0.044)*** 
       N Obs.               10,762      17,594     110,925     5,282     35,058     3,675    127,946     101,730       173,432       257,788   
       Weak Ident Test       3.07        5.01       59.94       2.12      2.00      1.53      29.71        9.95         20.03         19.88    
       UnderIdent P-val      0.02        0.00        0.00       0.21      0.27      0.60       0.00        0.00          0.00          0.00    
       N Prod-Year grs.       .           .           .          .          .         .         .           .             .             .      
      ------------------------------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01

.         replace theta = -_b[lprice]  if isic>=2900 & isic<3100;
(777,764 real changes made)
.         replace theta_se = _se[lprice]  if isic>=2900 & isic<3100;
(777,764 real changes made)
.         replace psi = -(1 - _b[ln_cond_lambda])/_b[lprice]  if isic>=2900 & isic<3100;
(777,764 real changes made)
.         replace psi_se = psi * ( (_se[lprice]/_b[lprice])^2 
>         + (_se[ln_cond_lambda]/_b[ln_cond_lambda])^2 )^0.5 if isic>=2900 & isic<3100;
(777,764 real changes made)
.         replace a = 1 - _b[ln_cond_lambda]  if isic>=2900 & isic<3100;
(777,764 real changes made)
.                         replace a_se = _se[ln_cond_lambda]  if isic>=2900 & isic<3100;
(777,764 real changes made)
.         replace fstat = e(widstat) if  isic>=2900 & isic<3100;
(777,764 real changes made)
.         replace obsv =  e(N) if  isic>=2900 & isic<3100;
(777,764 real changes made)
.         replace id=10 if isic>=2900 & isic<3100;
(777,764 real changes made)
.         ivreghdfe ln_x_wih  (lprice ln_cond_lambda = exc_col exc_usd ln_nfirms ln_nproducts ltax) 
>         if isic>=3100 & isic<3400, a(fe1 fe2) cluster(fe2);
(dropped 70546 singleton observations)
(MWFE estimator converged in 21 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on fe2

Number of clusters (fe2) =       74836                Number of obs =   246597
                                                      F(  2, 74835) =   376.27
                                                      Prob > F      =   0.0000
Total (centered) SS     =  843525.4876                Centered R2   =   0.3135
Total (uncentered) SS   =  843525.4876                Uncentered R2 =   0.3135
Residual SS             =  579113.0832                Root MSE      =    1.543

--------------------------------------------------------------------------------
               |               Robust
      ln_x_wih | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
        lprice |  -.7555099    .221426    -3.41   0.001    -1.189504    -.321516
ln_cond_lambda |   .3909428    .015088    25.91   0.000     .3613704    .4205151
--------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             89.091
                                                   Chi-sq(4) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               91.397
                         (Kleibergen-Paap rk Wald F statistic):         19.251
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    13.97
                                         10% maximal IV relative bias     8.78
                                         20% maximal IV relative bias     5.91
                                         30% maximal IV relative bias     4.79
                                         10% maximal IV size             19.45
                                         15% maximal IV size             11.22
                                         20% maximal IV size              8.38
                                         25% maximal IV size              6.89
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):      1488.518
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         lprice ln_cond_lambda
Excluded instruments: exc_col exc_usd ln_nfirms ln_nproducts ltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      3292           0        3292     |
         fe2 |     74836       74836           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
. outreg using output/temp/Table_Q1_outeg.tex, varlabels tex fragment merge  
>         ctitle("" "Elec") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

------------------------------------------------------------------------------------------------------------------------------------------------------
                       A&M         Food      Text&L&F     Wood      Paper     Petr       Chem      Rub&Plas   Miner & BasFaM     Mach        Elec    
------------------------------------------------------------------------------------------------------------------------------------------------------
 lprice               -4.563      -2.476      -3.256     -2.093    -7.858    -2.080     -4.738      -4.025        -3.390        -4.402      -0.756   
                    (1.739)***  (0.818)***  (0.297)***  (1.196)*  (3.953)**  (1.812)  (0.496)***  (0.791)***    (0.453)***    (0.662)***  (0.221)*** 
 ln_cond_lambda       0.302       0.073       0.315      0.107      0.105    -0.028     0.087       0.336         0.319         0.290       0.391    
                    (0.132)**    (0.050)    (0.023)***  (0.191)    (0.154)   (0.200)  (0.031)***  (0.062)***    (0.036)***    (0.044)***  (0.015)*** 
 N Obs.               10,762      17,594     110,925     5,282     35,058     3,675    127,946     101,730       173,432       257,788     246,597   
 Weak Ident Test       3.07        5.01       59.94       2.12      2.00      1.53      29.71        9.95         20.03         19.88       19.25    
 UnderIdent P-val      0.02        0.00        0.00       0.21      0.27      0.60       0.00        0.00          0.00          0.00        0.00    
 N Prod-Year grs.       .           .           .          .          .         .         .           .             .             .           .      
------------------------------------------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01

.         replace theta = -_b[lprice]  if isic>=3100 & isic<3400;
(774,292 real changes made)
.         replace theta_se = _se[lprice]  if isic>=3100 & isic<3400;
(774,292 real changes made)
.         replace psi = -(1 - _b[ln_cond_lambda])/_b[lprice]  if isic>=3100 & isic<3400;
(774,292 real changes made)
.         replace psi_se = psi * ( (_se[lprice]/_b[lprice])^2 
>         + (_se[ln_cond_lambda]/_b[ln_cond_lambda])^2 )^0.5 if isic>=3100 & isic<3400;
(774,292 real changes made)
.         replace a = 1 - _b[ln_cond_lambda]   if isic>=3100 & isic<3400;
(774,292 real changes made)
.                         replace a_se = _se[ln_cond_lambda]   if isic>=3100 & isic<3400;
(774,292 real changes made)
.         replace fstat = e(widstat) if  isic>=3100 & isic<3400;
(774,292 real changes made)
.         replace obsv =  e(N) if  isic>=3100 & isic<3400;
(774,292 real changes made)
.         replace id=11 if isic>=3100 & isic<3400;
(774,292 real changes made)
.         ivreghdfe ln_x_wih  (lprice ln_cond_lambda = exc_col exc_usd ln_nfirms ln_nproducts ltax) 
>         if isic>=3400, a(fe1 fe2) cluster(fe2);
(dropped 40076 singleton observations)
(MWFE estimator converged in 18 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on fe2

Number of clusters (fe2) =       43245                Number of obs =   147772
                                                      F(  2, 43244) =   220.86
                                                      Prob > F      =   0.0000
Total (centered) SS     =  474604.6612                Centered R2   =  -0.3843
Total (uncentered) SS   =  474604.6612                Uncentered R2 =  -0.3843
Residual SS             =  657006.4143                Root MSE      =    2.125

--------------------------------------------------------------------------------
               |               Robust
      ln_x_wih | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
        lprice |  -2.156499   .4622865    -4.66   0.000    -3.062589   -1.250409
ln_cond_lambda |   .4861007   .0318572    15.26   0.000       .42366    .5485414
--------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             52.321
                                                   Chi-sq(4) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               29.950
                         (Kleibergen-Paap rk Wald F statistic):         11.373
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    13.97
                                         10% maximal IV relative bias     8.78
                                         20% maximal IV relative bias     5.91
                                         30% maximal IV relative bias     4.79
                                         10% maximal IV size             19.45
                                         15% maximal IV size             11.22
                                         20% maximal IV size              8.38
                                         25% maximal IV size              6.89
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):       464.967
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         lprice ln_cond_lambda
Excluded instruments: exc_col exc_usd ln_nfirms ln_nproducts ltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      2288           0        2288     |
         fe2 |     43245       43245           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
.  outreg using output/temp/Table_Q1_outeg.tex, varlabels tex fragment merge  
>         ctitle("" "Trnsp & NEC") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

------------------------------------------------------------------------------------------------------------------------------------------------------
                       A&M         Food      Text&L&F     Wood      Paper     Petr       Chem      Rub&Plas   Miner & BasFaM     Mach        Elec    
------------------------------------------------------------------------------------------------------------------------------------------------------
 lprice               -4.563      -2.476      -3.256     -2.093    -7.858    -2.080     -4.738      -4.025        -3.390        -4.402      -0.756   
                    (1.739)***  (0.818)***  (0.297)***  (1.196)*  (3.953)**  (1.812)  (0.496)***  (0.791)***    (0.453)***    (0.662)***  (0.221)*** 
 ln_cond_lambda       0.302       0.073       0.315      0.107      0.105    -0.028     0.087       0.336         0.319         0.290       0.391    
                    (0.132)**    (0.050)    (0.023)***  (0.191)    (0.154)   (0.200)  (0.031)***  (0.062)***    (0.036)***    (0.044)***  (0.015)*** 
 N Obs.               10,762      17,594     110,925     5,282     35,058     3,675    127,946     101,730       173,432       257,788     246,597   
 Weak Ident Test       3.07        5.01       59.94       2.12      2.00      1.53      29.71        9.95         20.03         19.88       19.25    
 UnderIdent P-val      0.02        0.00        0.00       0.21      0.27      0.60       0.00        0.00          0.00          0.00        0.00    
 N Prod-Year grs.       .           .           .          .          .         .         .           .             .             .           .      
------------------------------------------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


                                                          ---------------------------------
                                                                              Trnsp & NEC 
                                                          ---------------------------------
                                                           lprice               -2.156    
                                                                              (0.462)***  
                                                           ln_cond_lambda        0.486    
                                                                              (0.032)***  
                                                           N Obs.               147,772   
                                                           Weak Ident Test       11.37    
                                                           UnderIdent P-val      0.00     
                                                           N Prod-Year grs.        .      
                                                          ---------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01

.         replace theta = -_b[lprice]  if isic>=3400;
(447,040 real changes made)
.         replace theta_se = _se[lprice]  if isic>=3400;
(447,040 real changes made)
.         replace psi = -(1 - _b[ln_cond_lambda])/_b[lprice]  if isic>=3400;
(447,040 real changes made)
.         replace psi_se = psi * ( (_se[lprice]/_b[lprice])^2 + 
>         (_se[ln_cond_lambda]/_b[ln_cond_lambda])^2 )^0.5 if isic>=3400;
(447,040 real changes made)
.         replace a = 1 - _b[ln_cond_lambda]  if isic>=3400;
(447,040 real changes made)
.                         replace a_se = _se[ln_cond_lambda]  if isic>=3400;
(447,040 real changes made)
.     replace fstat = e(widstat) if  isic>=3400;
(447,040 real changes made)
.         replace obsv =  e(N) if  isic>=3400;
(447,040 real changes made)
.         replace id=12  if isic>=3400;
(447,040 real changes made)
.         collapse  theta theta_se psi psi_se a a_se fstat obsv, by(id);
. save data/internally_generated/tableQ1_estimates.dta, replace;
file data/internally_generated/tableQ1_estimates.dta saved
. #delimit cr     
delimiter now cr
. 
. erase data/temp/colombia_imports_appendix_Q.dta
. erase data/temp/colombia_imports_updated_hs.dta
. 
. }

. 
. ************************************************
. *****      CREATE TABLE Q1 in LaTex    ********
. ************************************************
. use data/internally_generated/tableQ1_estimates.dta, clear

. 
. capture file close OuputTable

.         file open  OuputTable using "output/Table_Q1.tex", write replace

.         file write      OuputTable /// 
>             "\begin{adjustwidth}{-0.25in}{-0.0in}" _n ///                                                                                           
>                                                                              
>                 "\small" _n ///
>                 "\begin{tabular}{lccccccccccc}" _n ///
>                 "\toprule" _n ///
>                 "& & & \multicolumn{5}{c}{Estimated Parameter} && \phantom{abc} & \phantom{abc} & \\"   _n ///
>                 "\cmidrule{4-8}"_n ///
>                 "Sector & ISIC4 codes && $\sigma_{k}-1$ && $\frac{\sigma_{k}-1}{\gamma_{k}-1}$ && $\mu_{k}$ && Obs. & \specialcell{\footnotesize Wea
> k \\ Ident. Test} \\" _n ///
>                 "\midrule "

.                 
.                 local sectors  `" "Agriculture \& Mining" "Food" "Textiles, Leather \& Footwear" "Wood" "Paper" "Petroleum"  "Chemicals" "Rubber \& 
> Plastic"  "Minerals \& Fabricated Metals" "Machinery"   "Electrical \& Optical Equipment"  "Transport Equipment \& N.E.C."  "'

.                 
.                                 local isic  `" "100-1499" "1500-1699" "1700-1999" "2000-2099" "2100-2299" "2300-2399" "2400-2499" "2500-2599"  "2600
> -2899" "2900-3099" "3100-3399" "3400-3800"  "'

.                 
.                 forval i = 1/12 {
  2.         
.                 local sector_code : word `i' of `isic'
  3.                 local sector: word `i' of `sectors'
  4.                 di `i'
  5.                 scalar A = theta[`i']
  6.                 scalar B = a[`i']
  7.                 scalar C = psi[`i']
  8.                 scalar D = theta_se[`i']
  9.                 scalar E = a_se[`i']
 10.                 scalar F = psi_se[`i']
 11.                 scalar G = fstat[`i']
 12.                 scalar H = obsv[`i']
 13.                 
.                 file write OuputTable ///
>                 "`sector'  & `sector_code' &&" %6.3f (A) "&&" %6.3f (B) "&&" %6.3f (C) "&&"  %9.0fc (H) "&"  %3.2f (G) "\\" _n ///
>                 "& && \footnotesize(" %6.3f (D) ") && \footnotesize(" %6.3f (E) ") && \footnotesize(" %6.3f (F) ") &&   &   \\ \addlinespace        
>                                                                                                     "
 14.                 
.                 }
1
2
3
4
5
6
7
8
9
10
11
12

.                 
.         file write OuputTable ///       
>         "\bottomrule \\ \end{tabular} \vspace{-0.2in} \\"       _n ///
>     "\footnotesize {\it Notes}. Estimation results of Equation \eqref{eq: FE Estimation}. Standard errors in parentheses. The estimation is conducte
> d with HS10 product-year and firm-product fixed effects." _n ///
>         "All standard errors are simultaneously clustered by product-year and by origin-product, which is akin to the correction proposed by \citet{
> adao2019shift}." _n ///      
>         "The weak identification test statistics is the F statistics from the Kleibergen-Paap Wald test for weak identification of all instrumented 
> variables." _n ///
>         "The test for over-identification is not reported due to the pitfalls of the standard over-identification Sargan-Hansen J test in the multi-
> dimensional large datasets pointed by \cite{AngrsitEtAl96}." _n ///
>     "\end{adjustwidth}"

. 
. file close OuputTable

. *erase data/internally_generated/colombia_imports_appendix_Q
. log close
      name:  <unnamed>
       log:  /Users/ahmadlp/Dropbox/LL2020/Replication_Aug_2023/Stata/logs/10-table_Q1.log
  log type:  text
 closed on:   8 Aug 2023, 18:18:54
------------------------------------------------------------------------------------------------------------------------------------------------------
