------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/ahmadlp/Dropbox/LL2020/Replication_Aug_2023/Stata/logs/11-figure_R1.log
  log type:  text
 opened on:   8 Aug 2023, 18:18:54

. 
. if "$access_to_edd" == "yes" {
. use id psi using data/internally_generated/table3_estimates
. rename psi mu
. drop if missing(id)
(1 observation deleted)
. tempfile markup
. save `markup'
file /var/folders/gm/wcs7h97j64gctmx1tdk8jx8h0000gn/T//S_30433.000001 saved as .dta format
. 
. use id theta using data/internally_generated/table3_estimates
. rename theta sigma
. drop if missing(id)
(1 observation deleted)
. merge 1:1 id using `markup'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                                14  (_merge==3)
    -----------------------------------------
. drop _m
. tempfile estimation_results
. save `estimation_results'
file /var/folders/gm/wcs7h97j64gctmx1tdk8jx8h0000gn/T//S_30433.000002 saved as .dta format
. 
. use "data/confidential_data/edd_worldbank/CYH6_manuf.dta", clear
. 
. keep A1 A6i y h6 c
. gen Ni = A1
. gen Xi = A1*A6i
(361,452 missing values generated)
. drop A1
. rename c country
. rename y year
. rename h6 hs6
. destring hs6, force replace
hs6: all characters numeric; replaced as long
. 
. merge m:1 hs6 using data/concordance/isic_hs6

    Result                      Number of obs
    -----------------------------------------
    Not matched                        73,755
        from master                    72,189  (_merge==1)
        from using                      1,566  (_merge==2)

    Matched                           930,729  (_merge==3)
    -----------------------------------------
. drop if _m == 2
(1,566 observations deleted)
. 
. gen id = 0
. replace id=1 if isic>=100 & isic<1500
(6,670 real changes made)
. replace id=2 if isic>=1500 & isic<1700
(48,895 real changes made)
. replace id=3 if isic>=1700 & isic<2000
(178,075 real changes made)
. replace id=4 if isic>=2000 & isic<2100
(12,305 real changes made)
. replace id=5 if isic>=2100 & isic<2300
(22,019 real changes made)
. replace id=7 if isic>=2400 & isic<2500
(132,103 real changes made)
. replace id=9 if isic>=2600 & isic<2700
(36,664 real changes made)
. replace id=10 if isic>=2700 & isic<2900
(133,984 real changes made)
. replace id=11 if isic>=2900 & isic<3100
(132,486 real changes made)
. replace id=12 if isic>=3100 & isic<3400
(101,346 real changes made)
. replace id=13 if isic>=3400 & isic<3600
(33,125 real changes made)
. replace id=14 if isic>=3600 & isic<3800
(45,451 real changes made)
. replace id=14 if id==0
(119,795 real changes made)
. 
. collapse (mean) Ni [w=Xi], by(country year id)
(analytic weights assumed)
. 
. winsor2 Ni , by(id year) trim cuts(5 95) replace
. 
. merge m:1 id using `estimation_results'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             2
        from master                         0  (_merge==1)
        from using                          2  (_merge==2)

    Matched                             5,934  (_merge==3)
    -----------------------------------------
. keep if _m==3
(2 observations deleted)
. 
. gen ln_sigma = log(sigma-1)
. gen ln_mu = log((1/Ni)*(1+mu))
(405 missing values generated)
. gen ln_mu_baseline = log((1+mu))
. 
. keep if year>=2007 & year<=2013
(2,443 observations deleted)
. 
. reg ln_sigma ln_mu

      Source |       SS           df       MS      Number of obs   =     3,221
-------------+----------------------------------   F(1, 3219)      =    155.87
       Model |  108.755203         1  108.755203   Prob > F        =    0.0000
    Residual |  2245.96405     3,219  .697721046   R-squared       =    0.0462
-------------+----------------------------------   Adj R-squared   =    0.0459
       Total |  2354.71925     3,220   .73127927   Root MSE        =     .8353

------------------------------------------------------------------------------
    ln_sigma | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       ln_mu |  -.1380206    .011055   -12.48   0.000    -.1596962    -.116345
       _cons |   .4534404   .0353596    12.82   0.000     .3841108      .52277
------------------------------------------------------------------------------
. gen b1 = _b[ln_mu]
. gen b1_se = _se[ln_mu]
. gen obsv_1 = e(N) 
. 
. reghdfe ln_sigma ln_mu, a(year) 
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      3,221
Absorbing 1 HDFE group                            F(   1,   3213) =     156.25
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0464
                                                  Adj R-squared   =     0.0444
                                                  Within R-sq.    =     0.0464
                                                  Root MSE        =     0.8360

------------------------------------------------------------------------------
    ln_sigma | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       ln_mu |  -.1385904   .0110872   -12.50   0.000     -.160329   -.1168517
       _cons |   .4517832   .0354495    12.74   0.000     .3822772    .5212892
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |         7           0           7     |
-----------------------------------------------------+
. gen b2 = _b[ln_mu]
. gen b2_se = _se[ln_mu]
. gen obsv_2 = e(N) 
. 
. reghdfe ln_sigma ln_mu, a(year country)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =      3,221
Absorbing 2 HDFE groups                           F(   1,   3156) =     315.89
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0963
                                                  Adj R-squared   =     0.0780
                                                  Within R-sq.    =     0.0910
                                                  Root MSE        =     0.8211

------------------------------------------------------------------------------
    ln_sigma | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       ln_mu |  -.2790087   .0156983   -17.77   0.000    -.3097885   -.2482288
       _cons |    .043409   .0478925     0.91   0.365    -.0504945    .1373126
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |         7           0           7     |
     country |        58           1          57     |
-----------------------------------------------------+
. gen b3 = _b[ln_mu]
. gen b3_se = _se[ln_mu]
. gen obsv_3 = e(N) 
. 
. collapse b1 b1_se obsv_1 b2 b2_se obsv_2 b3 b3_se obsv_3
. save data/internally_generated/tableR1_estimates, replace 
file data/internally_generated/tableR1_estimates.dta saved
. }

. 
. use data/internally_generated/tableR1_estimates, clear

. 
. capture file close OuputTable

.         file open  OuputTable using "output/Table_R1.tex", write replace

.         file write      OuputTable /// 
>     "\def\sym#1{\ifmmode^{#1}\else\(^{#1}\)\fi}" _n ///
>     "\begin{adjustbox}{width=0.7\textwidth}" _n ///
>     "\begin{tabular}{lcccccc}" _n ///
>                  "\midrule" _n ///                                                                                     
>     "& \multicolumn{5}{c}{dependent: trade elasticity ($ \sigma_{k} - 1 $)} \\ "   _n ///                
>          "\toprule" _n ///
>    "$\mu_{i,k}=\frac{1}{N_{i,k}}\times\frac{\gamma_{k}}{\gamma_{k}-1}$ &" %6.3f (b1) "\sym{***} &&" %6.3f (b2) "\sym{***} &&" %6.3f (b3) "\sym{***} 
> \\" _n ///                  
>         "&"   %8.4f (b1_se)  "&&"    %8.4f (b2_se)    "&&"    %8.4f (b3_se)    "\\  \\"   _n ///   
>     "\addlinespace"    _n ///   
>     "Year fixed effects    &   No   &&    Yes    &&   Yes  \\"    _n ///   
>     "Origin fixed effects  &   No   &&    No     &&  Yes   \\"    _n ///   
>     "Observations        &"        %9.0fc (obsv_1)      "&&"     %9.0fc (obsv_2)   "&&"   %9.0fc (obsv_1)   " \\ "  _n /// 
>                                         "\bottomrule"  _n /// 
>     "\end{tabular}"   _n ///
>         "\end{adjustbox}" 

. 
. file close OuputTable

. *erase data/internally_generated/table3_estimates
. log close
      name:  <unnamed>
       log:  /Users/ahmadlp/Dropbox/LL2020/Replication_Aug_2023/Stata/logs/11-figure_R1.log
  log type:  text
 closed on:   8 Aug 2023, 18:19:01
------------------------------------------------------------------------------------------------------------------------------------------------------
