------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/ahmadlp/Dropbox/LL2020/Replication_Aug_2023/Stata/logs/12-table_S1.log
  log type:  text
 opened on:   8 Aug 2023, 18:19:01

. 
. 
. if "$access_to_datamyne" == "yes" {
. use "./data/temp/colombia_imports_cleaned.dta", clear
. 
. gen hs2=substr(ProductHS,1,2)
. destring hs2, replace
hs2: all characters numeric; replaced as byte
. gen mnf=(hs2>=30 & hs2<=38) | (hs2>=42 & hs2<=97)
. drop hs2
. 
. bysort fe1: egen ub=pctile(Dlprice), p(99)
. bysort fe2: egen lb=pctile(Dlprice), p(1)
(2 missing values generated)
. drop if Dlprice>ub | Dlprice<lb
(6,841 observations deleted)
. 
. rename Dexc_usd Z1
. rename Dexc_col Z2
. gen Z = cond(!missing(Z1) & Z1!=0, Z1, Z2, .)
(14,735 missing values generated)
. 
. ************************************************
.  *********     POOLED ESTIMATION    ***********
. ************************************************;       
. 
. gen a_IV = .
(1,339,395 missing values generated)
. gen a_se_IV = .
(1,339,395 missing values generated)
. gen b_IV = .
(1,339,395 missing values generated)
. gen b_se_IV = .
(1,339,395 missing values generated)
. gen a_OLS = .
(1,339,395 missing values generated)
. gen a_se_OLS = .
(1,339,395 missing values generated)
. gen b_OLS = .
(1,339,395 missing values generated)
. gen b_se_OLS = .
(1,339,395 missing values generated)
. gen fstat = .
(1,339,395 missing values generated)
. gen idp = .
(1,339,395 missing values generated)
. gen obsv = .
(1,339,395 missing values generated)
. gen r2 = .
(1,339,395 missing values generated)
. gen N_fe = .
(1,339,395 missing values generated)
. 
. 
. 
. ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =  Z1 Dln_nfirms Dln_nproducts Dltax) if mnf, a(fe1) cluster(fe2) 
(dropped 2282 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on fe2

Number of clusters (fe2) =      508102                Number of obs =  1118525
                                                      F(  2,508101) =   977.82
                                                      Prob > F      =   0.0000
Total (centered) SS     =  9.45328e+10                Centered R2   =  -1.1150
Total (uncentered) SS   =  9.45328e+10                Uncentered R2 =  -1.1150
Residual SS             =  1.99941e+11                Root MSE      =    426.9

---------------------------------------------------------------------------------
                |               Robust
      Dln_x_wih | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -2.766262   .1857458   -14.89   0.000    -3.130318   -2.402206
Dln_cond_lambda |   .3395479   .0104674    32.44   0.000      .319032    .3600638
---------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):            463.429
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              259.908
                         (Kleibergen-Paap rk Wald F statistic):        106.056
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):      2448.214
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Excluded instruments: Z1 Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |     21353           0       21353     |
-----------------------------------------------------+
. replace a_IV = _b[Dlprice] if mnf
(1,133,009 real changes made)
. replace a_se_IV = _se[Dlprice] if mnf
(1,133,009 real changes made)
. replace b_IV = _b[Dln_cond_lambda] if mnf
(1,133,009 real changes made)
. replace b_se_IV = _se[Dln_cond_lambda] if mnf
(1,133,009 real changes made)
. replace fstat =  e(cdf) if mnf
(1,133,009 real changes made)
. replace idp = e(idp) if mnf
(1,133,009 real changes made)
. 
.  
. 
. reghdfe Dln_x_wih  Dlprice Dln_cond_lambda  if mnf, a(fe1) cluster(fe1 fe2)
(dropped 2267 singleton observations)
(MWFE estimator converged in 1 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Gelbach & Miller applied.

HDFE Linear regression                            Number of obs   =  1,130,742
Absorbing 1 HDFE group                            F(   2,  21415) =  210539.16
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.7824
                                                  Adj R-squared   =     0.7782
Number of clusters (fe1)     =     21,416         Within R-sq.    =     0.7774
Number of clusters (fe2)     =    514,689         Root MSE        =   138.5650

                              (Std. err. adjusted for 21,416 clusters in fe1 fe2)
---------------------------------------------------------------------------------
                |               Robust
      Dln_x_wih | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |   .2025452   .0035526    57.01   0.000     .1955819    .2095085
Dln_cond_lambda |   .8165241   .0021076   387.42   0.000      .812393    .8206552
          _cons |   10.38491   .0116842   888.80   0.000       10.362    10.40781
---------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |     21416       21416           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
. replace a_OLS = _b[Dlprice] if mnf
(1,133,009 real changes made)
. replace a_se_OLS = _se[Dlprice] if mnf
(1,133,009 real changes made)
. replace b_OLS = _b[Dln_cond_lambda] if mnf
(1,133,009 real changes made)
. replace b_se_OLS = _se[Dln_cond_lambda] if mnf
(1,133,009 real changes made)
. replace obsv =  e(N) if mnf     
(1,133,009 real changes made)
. replace r2 = e(r2_within) if mnf
(1,133,009 real changes made)
. replace N_fe = e(N_clust) if mnf
(1,133,009 real changes made)
.         
.         
. ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =   Z1 Dln_nfirms Dln_nproducts Dltariff) if ~mnf, a(fe1) cluster(fe2)
(dropped 1565 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on fe2

Number of clusters (fe2) =       86916                Number of obs =   202288
                                                      F(  2, 86915) =    55.49
                                                      Prob > F      =   0.0000
Total (centered) SS     =  1.36770e+10                Centered R2   =  -5.6376
Total (uncentered) SS   =  1.36770e+10                Uncentered R2 =  -5.6376
Residual SS             =  9.07825e+10                Root MSE      =      685

---------------------------------------------------------------------------------
                |               Robust
      Dln_x_wih | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -5.539722   .7063521    -7.84   0.000    -6.924166   -4.155278
Dln_cond_lambda |   .1669605   .0334696     4.99   0.000     .1013604    .2325605
---------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             85.925
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               28.835
                         (Kleibergen-Paap rk Wald F statistic):         21.636
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):        98.446
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Excluded instruments: Z1 Dln_nfirms Dln_nproducts Dltariff
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      8827           0        8827     |
-----------------------------------------------------+
. replace a_IV = _b[Dlprice] if ~mnf
(206,386 real changes made)
. replace a_se_IV = _se[Dlprice] if ~mnf
(206,386 real changes made)
. replace b_IV = _b[Dln_cond_lambda] if ~mnf
(206,386 real changes made)
. replace b_se_IV = _se[Dln_cond_lambda] if ~mnf
(206,386 real changes made)
. replace fstat =  e(cdf) if ~mnf
(206,386 real changes made)
. replace idp = e(idp) if ~mnf    
(206,386 real changes made)
. 
. 
. reghdfe Dln_x_wih  Dlprice Dln_cond_lambda  if ~mnf, a(fe1) cluster(fe1 fe2)
(dropped 1558 singleton observations)
(MWFE estimator converged in 1 iterations)
Warning: VCV matrix was non-positive semi-definite; adjustment from Cameron, Gelbach & Miller applied.

HDFE Linear regression                            Number of obs   =    204,828
Absorbing 1 HDFE group                            F(   2,   8902) =    4284.29
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.7349
                                                  Adj R-squared   =     0.7228
Number of clusters (fe1)     =      8,903         Within R-sq.    =     0.7260
Number of clusters (fe2)     =     88,220         Root MSE        =   139.0596

                               (Std. err. adjusted for 8,903 clusters in fe1 fe2)
---------------------------------------------------------------------------------
                |               Robust
      Dln_x_wih | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |   .1017971   .0067273    15.13   0.000     .0886101     .114984
Dln_cond_lambda |   .8038393   .0095072    84.55   0.000      .785203    .8224756
          _cons |   12.19737   .0118439  1029.85   0.000     12.17415    12.22059
---------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      8903        8903           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
. replace a_OLS = _b[Dlprice] if ~mnf
(206,386 real changes made)
. replace a_se_OLS = _se[Dlprice] if ~mnf
(206,386 real changes made)
. replace b_OLS = _b[Dln_cond_lambda] if ~mnf
(206,386 real changes made)
. replace b_se_OLS = _se[Dln_cond_lambda] if ~mnf
(206,386 real changes made)
. replace obsv =  e(N) if ~mnf    
(206,386 real changes made)
. replace r2 = e(r2_within) if ~mnf
(206,386 real changes made)
. replace N_fe = e(N_clust) if ~mnf
(206,386 real changes made)
. 
. collapse (mean) a_IV a_se_IV b_IV b_se_IV a_OLS a_se_OLS b_OLS b_se_OLS fstat idp obsv r2 N_fe, by(mnf)
. 
. save data/internally_generated/tableS1_estimates.dta, replace
file data/internally_generated/tableS1_estimates.dta saved
. 
. erase "./data/temp/colombia_imports_cleaned.dta"
. }

. 
. 
. use data/internally_generated/tableS1_estimates.dta, clear

. sort mnf

. 
. scalar A_IV_mnf = a_IV[2]

. scalar A_se_IV_mnf = a_se_IV[2]

. scalar B_IV_mnf = b_IV[2]

. scalar B_se_IV_mnf = b_se_IV[2]

. scalar fstat_mnf = fstat[2]

. scalar idp_mnf = idp[2]

. 
. scalar A_OLS_mnf = a_OLS[2]

. scalar A_se_OLS_mnf = a_se_OLS[2]

. scalar B_OLS_mnf = b_OLS[2]

. scalar B_se_OLS_mnf = b_se_OLS[2]

. scalar obsv_mnf =  obsv[2]

. scalar r2_mnf = r2[2]

. scalar N_fe_mnf = N_fe[2]

. 
. scalar A_IV_non = a_IV[1]

. scalar A_se_IV_non = a_se_IV[1]

. scalar B_IV_non = b_IV[1]

. scalar B_se_IV_non = b_se_IV[1]

. scalar fstat_non =  fstat[1]

. scalar idp_non = idp[1]

. 
. scalar A_OLS_non = a_OLS[1]

. scalar A_se_OLS_non = a_se_OLS[1]

. scalar B_OLS_non = b_OLS[1]

. scalar B_se_OLS_non = b_se_OLS[1]

. scalar obsv_non =  obsv[1]

. scalar r2_non = r2[1]

. scalar N_fe_non = N_fe[1]

. 
. ************************************************
. *****      CREATE TABLE 9 in LaTex    ********
. ************************************************        
. 
. capture file close OuputTable

.         file open  OuputTable using "output/Table_S1.tex", write replace

.         file write      OuputTable /// 
>         "\begin{adjustwidth}{0.2in}{0in}"  _n ///
>         "\begin{tabular}{lccccccc}"  _n ///
>         "               \toprule                "   _n ///                          
>     " &  &                \multicolumn{2}{c}{Manufacturing}  & \phantom{abc} &  \multicolumn{2}{c}{Non-Manufacturing}  \\"  _n ///
>     "                                         \cmidrule{3-4}  \cmidrule{6-7}                       "  _n ///
>     " Variable (log)                                               &&    2SLS     &   OLS     &&                      2SLS  &     OLS  \\  "  _n ///
>     "                                     \midrule                   "   _n ///
>     "Price, $1-\sigma$ &&"  %6.3f (A_IV_mnf) "*** &" %6.3f (A_OLS_mnf) "&&"  %6.3f (A_IV_non) "&"  %6.3f (A_OLS_non) "\\"  _n ///
>          "       && ("   %6.3f (A_se_IV_mnf) ") & (" %6.3f (A_se_OLS_mnf) ") && ("  %6.3f (A_se_IV_non) ") & ("  %6.3f (A_se_OLS_non) ") \\ \addline
> space"  _n ///
>          "Within-national share, $1-\mu(\sigma-1)$ &&"  %3.2f (B_IV_mnf) "*** &" %3.2f (B_OLS_mnf) "&&"  %3.2f (B_IV_non) "&"  %3.2f (B_OLS_non) "\\
> "  _n ///
>          "       && ("   %6.3f (B_se_IV_mnf) ") & (" %6.3f (B_se_OLS_mnf) ") && ("  %6.3f (B_se_IV_non) ") & ("  %6.3f (B_se_OLS_non) ") \\ \\"  _n 
> ///
>          "Weak Identification Test           & &"  %3.2f (fstat_mnf) "&  ...    &&"          %3.2f (fstat_non)   "& ...   \\"  _n ///
>      "Under-Identification P-value       & &"  %3.2f (idp_mnf)   "&   ...       &&"   %3.2f (idp_non)  "& ...   \\"  _n /// 
>      "Within-$R^{2}$      & &  ...      &"    %3.2f (r2_mnf)      "&&             ...     &"    %3.2f (r2_non)   "\\" _n /// 
>      "N of Product-Year Groups   & &  \multicolumn{2}{c}{" %9.0fc (N_fe_mnf) "} &&            \multicolumn{2}{c}{" %9.0fc (N_fe_non) "} \\ "   _n //
> /  
>      "Observations               & &   \multicolumn{2}{c}{" %9.0fc (obsv_mnf) "}        &&            \multicolumn{2}{c}{" %9.0fc (obsv_non) "}  \\"
>   _n ///
>         "\bottomrule \\ \end{tabular} \vspace{0.05in} \\"       _n ///  
>     "\footnotesize {\it Notes}. *** denotes significant at the 1\% level. The Estimating Equation is \eqref{eq:Main}.  Standard errors in brackets a
> re robust to clustering within product-year. " _n ///
>         "The estimation is conducted with HS10 product-year fixed effects. The reported $R^2$ in the OLS specifications correspond to within-group g
> oodness of fit. " _n ///      
>         "Weak identification test statistics is the F statistics from the Kleibergen-Paap Wald test for weak identification of all instrumented vari
> ables. " _n ///
>         "The p-value of the under-identification test of instrumented variables is based on the Kleibergen-Paap LM test. " _n ///
>         "The test for over-identification is not reported due to the pitfalls of the standard over-identification Sargan-Hansen J test in the multi-
> dimensional large datasets pointed by \cite{AngrsitEtAl96}." _n ///
>     "\end{adjustwidth}"

.                                                                                                                                  
. file close OuputTable

. 
. log close
      name:  <unnamed>
       log:  /Users/ahmadlp/Dropbox/LL2020/Replication_Aug_2023/Stata/logs/12-table_S1.log
  log type:  text
 closed on:   8 Aug 2023, 18:20:14
------------------------------------------------------------------------------------------------------------------------------------------------------
