------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/ahmadlp/Dropbox/LL2020/Replication_Aug_2023/Stata/logs/4-figure_H1.log
  log type:  text
 opened on:   8 Aug 2023, 17:41:50

. 
. import delimited using data/internally_generated/appendixH_simulation_2x10.csv, case(preserve) clear
(encoding automatically selected: ISO-8859-1)
(4 vars, 50 obs)

. gen case = 1

. tempfile Output_2x10

. save `Output_2x10'
file /var/folders/gm/wcs7h97j64gctmx1tdk8jx8h0000gn/T//S_30433.000001 saved as .dta format

. 
. import delimited using data/internally_generated/appendixH_simulation_5x10.csv, case(preserve) clear
(encoding automatically selected: ISO-8859-1)
(4 vars, 50 obs)

. gen case = 2

. tempfile Output_5x10

. save `Output_5x10'
file /var/folders/gm/wcs7h97j64gctmx1tdk8jx8h0000gn/T//S_30433.000002 saved as .dta format

. 
. import delimited using data/internally_generated/appendixH_simulation_20x10.csv, case(preserve) clear
(encoding automatically selected: ISO-8859-1)
(4 vars, 50 obs)

. gen case = 3

. tempfile Output_20x10

. save `Output_20x10'
file /var/folders/gm/wcs7h97j64gctmx1tdk8jx8h0000gn/T//S_30433.000003 saved as .dta format

. 
. use `Output_2x10', clear

. append using `Output_5x10'

. append using `Output_20x10'

. 
. keep if dW_Theory>1 & dW_MPEC>1
(2 observations deleted)

. save data/internally_generated/appendixH_simulation_all, replace
(file data/internally_generated/appendixH_simulation_all.dta not found)
file data/internally_generated/appendixH_simulation_all.dta saved

. 
. *graph set window fontface "Merriweather Bold"
. graph twoway ///
>  (scatter dW_Theory dW_MPEC if case==1, msize(medlarge))  (scatter dW_Theory dW_MPEC if case==2, msize(medlarge)) ///
>  (scatter dW_Theory dW_MPEC if case==3, msize(medlarge))   (function y=x, range(5 15) lpattern(dash)) , ///
>  ytitle(Theorem 1 ( %{&Delta}W{subscript:i} )) xtitle(Numerical Optimization ( %{&Delta}W{subscript:i} ) ) ///
>  ylabel(5(2)15) yscale(log) xsize(5) ysize(5) ///
>  xlabel(5(2)15) xscale(log) ///
>  legend(pos(10) col(1) size(medium) ring(0) lab(1 "2 Countries") lab(2 "5 countries") lab(3 "20 countries") lab(4 "45-degree line") )

.  
. *note({fontface Arial Narrow: Abel used as the default font for the graphs. Arial Narrow used for notes.}, span size(*0.65)) xsize(5) ysize(5) ///
> 
.  graph export "output/Figure_H1.pdf", replace
file /Users/ahmadlp/Dropbox/LL2020/Replication_Aug_2023/Stata/output/Figure_H1.pdf saved as PDF format

.  graph close

.  log close
      name:  <unnamed>
       log:  /Users/ahmadlp/Dropbox/LL2020/Replication_Aug_2023/Stata/logs/4-figure_H1.log
  log type:  text
 closed on:   8 Aug 2023, 17:41:51
------------------------------------------------------------------------------------------------------------------------------------------------------
