------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/ahmadlp/Dropbox/LL2020/Replication_Aug_2023/Stata/logs/5-figure_H2.log
  log type:  text
 opened on:   8 Aug 2023, 17:41:51

. 
. use dW_MPEC dW_Theory case using data/internally_generated/appendixH_simulation_all, clear

. 
. gen id = 1

. replace id =  2 if dW_Theory > 1.0025*dW_MPEC
(33 real changes made)

. replace id =  3 if dW_MPEC > 1.0025*dW_Theory
(7 real changes made)

. gen frequency = 1 

. 
. collapse (sum) frequency, by(id case)

. bysort case: egen total_freq = total(frequency)

. replace frequency = frequency/total_freq
(7 real changes made)

. drop total_freq

. 
. reshape wide frequency, i(case) j(id)
(j = 1 2 3)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations                7   ->   3           
Number of variables                   3   ->   4           
j variable (3 values)                id   ->   (dropped)
xij variables:
                              frequency   ->   frequency1 frequency2 frequency3
-----------------------------------------------------------------------------

. forvalues i=1/3 {
  2. replace frequency`i' = 0 if missing(frequency`i')
  3. replace frequency`i' = 100*frequency`i'
  4. }
(0 real changes made)
(3 real changes made)
(0 real changes made)
(3 real changes made)
(2 real changes made)
(1 real change made)

. 
. gen     case_desc = "2 countries"                       if case==1
(2 missing values generated)

. replace case_desc = "5 countries"                       if case==2
(1 real change made)

. replace case_desc = "20 countries"                      if case==3
variable case_desc was str11 now str12
(1 real change made)

. 
. label variable frequency1   "Theorem 1 and MPEC have comparable accuracy"

. label variable frequency2   "Theorem 1 is more accurate by at least 0.25%"

. label variable frequency3   "MPEC is more accurate by at least 0.25%"

. 
. *graph set window fontface "Merriweather"
. ds frequency*
frequency1  frequency2  frequency3

. local items : word count `r(varlist)'

. display `item'


. local colors = `items' + 1

. colorpalette9    ///
>  "250 150   0"  ///
>  "  0  100  175"  ///
>   , n(`colors') nograph

. foreach x of numlist 1/`items' {
  2.  
. 
. *** here the code for bar colors
.  local barcolor `barcolor' bar(`x', fcolor("`r(p`x')'") ///
>  lcolor(black) lwidth(*2)) `///' 
  3.  
.  
. *** here the code for legend
.  local mylab : var lab frequency`x'
  4.  local legend `legend' lab(`x' "`mylab'") 
  5. }

. 
. *** the final graph we want:
. graph bar (mean) frequency*, ///
>  over(case_desc, gap(*1.5) label(labsize(4)) axis(lcolor(none)) sort(case)) bargap(-15)  ///
>   `barcolor' ///
>   ytitle(% frequency, size(medlarge)) ///
>   legend(`legend' col(1) size(medlarge) pos(6) ring(1) region(fcolor(none)) ) ///
>   title("") xsize(2) ysize(1) //note("{fontface typewriter:Source: WBES}", size(3)) 

.   
. graph export "output/Figure_H2.pdf", replace
file /Users/ahmadlp/Dropbox/LL2020/Replication_Aug_2023/Stata/output/Figure_H2.pdf saved as PDF format

. 
. graph close

. log close   
      name:  <unnamed>
       log:  /Users/ahmadlp/Dropbox/LL2020/Replication_Aug_2023/Stata/logs/5-figure_H2.log
  log type:  text
 closed on:   8 Aug 2023, 17:41:52
------------------------------------------------------------------------------------------------------------------------------------------------------
