------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/ahmadlp/Dropbox/LL2020/Replication_Aug_2023/Stata/logs/9-figure_P1.log
  log type:  text
 opened on:   8 Aug 2023, 17:43:05

. 
. if "$access_to_datamyne" == "yes" {
. *************** Perform Robustness Checks *********************
. do code/data_prep/4-robustness_check_1 // build IV using initial shares

. clear

. **************************************************************/
. 
. use "data/exchange_rate_report_boc/exchange_rate_report.dta", clear

. collapse (mean) xrate_usd xrate_col,by( month year country )

. 
. 
. gen CountryofOrigin=strupper(country)

. sort CountryofOrigin

. collapse (mean) xrate_usd xrate_col , by(month year CountryofOrigin)

. 
. egen id=group(CountryofOrigin)

. gen date=ym(year, month)

. tsset id date

Panel variable: id (strongly balanced)
 Time variable: date, 564 to 660
         Delta: 1 unit

. 
. *gen Flxrate_col = log(F12.xrate_col) - log(F11.xrate_col)
. *gen Flxrate_usd = log(F12.xrate_usd) - log(F11.xrate_usd)
. 
. *local n_lag= 1
. local n_lag=7

. 
. 
. ******************************************
. forvalues y=1/`n_lag'  {
  2. local x2 = 12*`y'
  3. local x1 = 12*(`y' - 1)  
  4. gen exc_col_F`y' = 100*(log(F`x2'.xrate_col) - log(F`x1'.xrate_col))
  5. gen exc_usd_F`y' = 100*(log(F`x2'.xrate_usd) - log(F`x1'.xrate_usd))
  6. }
(920 missing values generated)
(920 missing values generated)
(1,824 missing values generated)
(1,824 missing values generated)
(2,736 missing values generated)
(2,736 missing values generated)
(3,648 missing values generated)
(3,648 missing values generated)
(4,560 missing values generated)
(4,560 missing values generated)
(5,472 missing values generated)
(5,472 missing values generated)
(6,384 missing values generated)
(6,384 missing values generated)

. ************************************/
. 
. drop id

. merge 1:m CountryofOrigin year month using "data/temp/colombia_imports_updated_hs.dta"
(variable CountryofOrigin was str24, now str50 to accommodate using data's values)
(variable year was int, now float to accommodate using data's values)
(variable month was byte, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                       272,394
        from master                     1,580  (_merge==1)
        from using                    270,814  (_merge==2)

    Matched                        17,003,919  (_merge==3)
    -----------------------------------------

. *merge 1:m CountryofOrigin year month using Colombiaimports_HS10_collapsed
. 
. destring  VATPercent TariffPercent ExchangeRate, replace
VATPercent: all characters numeric; replaced as double
(1580 missing values generated)
TariffPercent: all characters numeric; replaced as double
(1580 missing values generated)
ExchangeRate: all characters numeric; replaced as double
(1580 missing values generated)

. drop if CustomsValueTariffBase<0
(1 observation deleted)

. 
. ******************************************************************************
. collapse (sum) CustomsValueTariffBase Valuetobepay Quantity ///
> (mean) VATPercent TariffPercent exc_col_F* exc_usd_F* [fw=CustomsValueTariffBase], ///
> by(year ProductHS CountryofOrigin Provider)

. 
. /******************************************************************************
> foreach var of varlist VATPercent TariffPercent exc_col_F* exc_usd_F* {
> replace `var' = `var' * CustomsValueTariffBase
> }
> 
> collapse (sum) CustomsValueTariffBase Valuetobepay Quantity VATPercent ///
> TariffPercent exc_col_F* exc_usd_F*, by(year ProductHS CountryofOrigin Provider)
> 
> foreach var of varlist VATPercent TariffPercent exc_col_F* exc_usd_F* {
> replace `var' = `var' / CustomsValueTariffBase
> }
> ******************************************************************************/
. 
. egen id = group(ProductHS CountryofOrigin Provider)
(13 missing values generated)

. drop if missing(id)
(13 observations deleted)

. tsset id year

Panel variable: id (unbalanced)
 Time variable: year, 2007 to 2013, but with gaps
         Delta: 1 unit

. 
. generate Dexc_col = cond(!missing(L7.exc_col_F7) , L7.exc_col_F7, ///
>                     cond(!missing(L6.exc_col_F6) , L6.exc_col_F6, ///
>                                 cond(!missing(L5.exc_col_F5) , L5.exc_col_F5, ///
>                                     cond(!missing(L4.exc_col_F4) , L4.exc_col_F4, ///
>                                     cond(!missing(L3.exc_col_F3) , L3.exc_col_F3, ///
>                                         cond(!missing(L2.exc_col_F2) , L2.exc_col_F2, ///
>                                     cond(!missing(L.exc_col_F1) , L.exc_col_F1, ///
>                                                                                 . )))))))
(2,210,182 missing values generated)

.                                                                                 
. generate Dexc_usd = cond(!missing(L7.exc_usd_F7) , L7.exc_usd_F7, ///
>                     cond(!missing(L6.exc_usd_F6) , L6.exc_usd_F6, ///
>                                     cond(!missing(L5.exc_usd_F5) , L5.exc_usd_F5, ///
>                                     cond(!missing(L4.exc_usd_F4) , L4.exc_usd_F4, ///
>                                     cond(!missing(L3.exc_usd_F3) , L3.exc_usd_F3, ///
>                                         cond(!missing(L2.exc_usd_F2) , L2.exc_usd_F2, ///
>                                         cond(!missing(L.exc_usd_F1) , L.exc_usd_F1, ///
>                                                                         . )))))))
(2,210,182 missing values generated)

. 
. ****************************************
. ** Save Data -- Firm Level
. ****************************************
. gen x_whi = CustomsValueTariffBase + Valuetobepay

. 
. ****************************************
. ** Construct Within-National Shares
. ****************************************
. bysort year ProductHS CountryofOrigin : egen x_hi=total(x_whi)

. 
. gen ln_cond_lambda = log(x_whi/x_hi)

. *****************************************
. 
. gen price=x_whi/Quantity
(14 missing values generated)

. gen lprice=log(price)
(14 missing values generated)

. gen lvat=log(1+0.01*VATPercent)

. gen ltariff=log(1+0.01*TariffPercent)

. gen ltax = lvat + ltariff

. 
. gen ln_x_wih = log(x_whi)

. gen ln_q_wih = log(Quantity)
(14 missing values generated)

. 
. egen panelvar = group(ProductHS CountryofOrigin Provider)

. drop if missing(panelvar)
(0 observations deleted)

. 
. *******************************************************
. ** Contructing Khandelwal IVs for Within-National Share
. ********************************************************
. 
. * number of firms exporting from country i in product h
. bysort year CountryofOrigin ProductHS: gen ln_nfirms=log(_N )

. 
. * number of products firm w exports in
. bysort year CountryofOrigin Provider: gen ln_nproducts=log(_N )

. 
. tsset id year

Panel variable: id (unbalanced)
 Time variable: year, 2007 to 2013, but with gaps
         Delta: 1 unit

. gen ltariff_lag = L.ltariff
(2,460,852 missing values generated)

. gen ltax_lag = L.ltax
(2,460,852 missing values generated)

. ********************************************************
. 
. xtset panelvar year

Panel variable: panelvar (unbalanced)
 Time variable: year, 2007 to 2013, but with gaps
         Delta: 1 unit

. foreach var in lprice ln_x_wih ltax ltariff lvat ln_cond_lambda ln_nfirms ln_nproducts {
  2.         gen D`var'=100*D.`var'
  3.         }
(2,460,854 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)

.         
.         keep if Dln_x_wih!=.
(2,460,852 observations deleted)

.         
. egen fe1=group(ProductHS year)

. gen fe2=panelvar

. 
. 
. keep Dln_x_wih Dln_cond_lambda Dlprice Dexc_col Dexc_usd Dlvat Dltariff Dltax fe1 fe2 ProductHS Dln_nfirms Dln_nproducts ///
> ln_x_wih ln_cond_lambda lprice ltariff lvat ltax ln_nfirms ln_nproducts ltariff_lag ltax_lag year

. 
. *****************************************/
. gen theta=.
(1,346,236 missing values generated)

. gen theta_se=.
(1,346,236 missing values generated)

. gen a =.
(1,346,236 missing values generated)

. gen a_se=.
(1,346,236 missing values generated)

. gen psi=.
(1,346,236 missing values generated)

. gen psi_se=.
(1,346,236 missing values generated)

. gen id=.
(1,346,236 missing values generated)

. 
. **************************
. gen hs2=substr(ProductHS,1,2)

. destring hs2, replace
hs2: all characters numeric; replaced as byte

. gen mnf=(hs2>=30 & hs2<=38) | (hs2>=42 & hs2<=97)

. drop hs2

. *************************/
. 
. gen hs6=substr(ProductHS,1,6)

. destring hs6, replace
hs6: all characters numeric; replaced as long

. merge m:1 hs6 using data/concordance/isic_hs6

    Result                      Number of obs
    -----------------------------------------
    Not matched                         5,096
        from master                     4,587  (_merge==1)
        from using                        509  (_merge==2)

    Matched                         1,341,649  (_merge==3)
    -----------------------------------------

. replace isic=3600 if _merge == 1
(4,587 real changes made)

. drop _merge

. 
. winsor2 Dlprice Dln_x_wih, replace cuts(1 99) by(fe1) trim

. rename Dexc_usd Z1

. rename Dexc_col Z2

. 
. generate Z = cond(!missing(Z1) & Z1!=0, Z1, Z2, .)
(15,295 missing values generated)

. 
. ************************************************
. *****   INDUSTRY-LEVEL ESTIMATION    ***********
. ************************************************        
. 
. set more off

.         #delimit;
delimiter now ;
.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda = Z Dln_nfirms Dln_nproducts Dltax) 
>         if isic>=100 & isic<1500, liml a(fe1);
(dropped 390 singleton observations)
(MWFE estimator converged in 1 iterations)

LIML estimation
---------------
k               =1.00115
lambda          =1.00115

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =    11568
                                                      F(  2, 10359) =     3.53
                                                      Prob > F      =   0.0295
Total (centered) SS     =  433870990.1                Centered R2   =  -8.2503
Total (uncentered) SS   =  433870990.1                Uncentered R2 =  -8.2503
Residual SS             =   4013428899                Root MSE      =    622.4

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -8.949047   3.375343    -2.65   0.008    -15.56537   -2.332723
Dln_cond_lambda |   .1714008   .1636504     1.05   0.295    -.1493855    .4921872
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          22.380
                                                   Chi-sq(3) P-val =    0.0001
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                5.019
Stock-Yogo weak ID test critical values: 10% maximal LIML size            4.72
                                         15% maximal LIML size            3.39
                                         20% maximal LIML size            2.99
                                         25% maximal LIML size            2.79
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):          13.280
                                                   Chi-sq(2) P-val =    0.0013
------------------------------------------------------------------------------
Anderson-Rubin statistic (overidentification test of all instruments):  13.287
                                                   Chi-sq(2) P-val =    0.0013
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      1207           0        1207     |
-----------------------------------------------------+

. outreg using output/temp/FigP1_A_outreg.tex, varlabels tex fragment replace  
>         ctitle("" "A&M") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g );

                                                           --------------------------------
                                                                                  A&M     
                                                           --------------------------------
                                                            Dlprice              -8.949   
                                                                               (3.375)*** 
                                                            Dln_cond_lambda      0.171    
                                                                                (0.164)   
                                                            N Obs.               11,568   
                                                            Weak Ident Test       5.02    
                                                            UnderIdent P-val      0.00    
                                                            N Prod-Year grs.       .      
                                                           --------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=100 & isic<1500;
(12,551 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=100 & isic<1500;
(12,551 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=100 & isic<1500;
(12,551 real changes made)

.         replace a_se = _se[Dln_cond_lambda]  if isic>=100 & isic<1500;
(12,551 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=100 & isic<1500;
(12,551 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>         + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=100 & isic<1500;
(12,551 real changes made)

.         replace id=1 if isic>=100 & isic<1500;
(12,551 real changes made)

. ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda = Z Dln_nfirms Dln_nproducts Dltax) 
>         if isic>=1500 & isic<1700, a(fe1) ;
(dropped 396 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =    19615
                                                      F(  2, 17815) =    10.37
                                                      Prob > F      =   0.0000
Total (centered) SS     =  588479705.2                Centered R2   =  -0.3233
Total (uncentered) SS   =  588479705.2                Uncentered R2 =  -0.3233
Residual SS             =  778722433.2                Root MSE      =    209.1

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -2.355381   .5731516    -4.11   0.000    -3.478814   -1.231948
Dln_cond_lambda |   .0977008   .0396942     2.46   0.014     .0198964    .1755053
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          58.144
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               13.240
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):         118.100
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      1798           0        1798     |
-----------------------------------------------------+

.   outreg using output/temp/FigP1_A_outreg.tex, varlabels tex fragment merge  
>         ctitle( "" "Food") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g );

                                                     --------------------------------------------
                                                                            A&M         Food    
                                                     --------------------------------------------
                                                      Dlprice              -8.949      -2.355   
                                                                         (3.375)***  (0.573)*** 
                                                      Dln_cond_lambda      0.171       0.098    
                                                                          (0.164)    (0.040)**  
                                                      N Obs.               11,568      19,615   
                                                      Weak Ident Test       5.02       13.24    
                                                      UnderIdent P-val      0.00        0.00    
                                                      N Prod-Year grs.       .           .      
                                                     --------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=1500 & isic<1700;
(20,882 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=1500 & isic<1700;
(20,882 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=1500 & isic<1700;
(20,882 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=1500 & isic<1700;
(20,882 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=1500 & isic<1700;
(20,882 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>                 + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=1500 & isic<1700;
(20,882 real changes made)

.         replace id=2 if isic>=1500 & isic<1700;
(20,882 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda = Z Dln_nfirms Dln_nproducts Dltax) 
>         if isic>=1700 & isic<2000, a(fe1);
(dropped 551 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =   125120
                                                      F(  2,121197) =   272.38
                                                      Prob > F      =   0.0000
Total (centered) SS     =   9274007577                Centered R2   =  -0.3258
Total (uncentered) SS   =   9274007577                Uncentered R2 =  -0.3258
Residual SS             =  1.22953e+10                Root MSE      =    318.5

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -3.347629   .2122949   -15.77   0.000    -3.763723   -2.931534
Dln_cond_lambda |   .2465427   .0180726    13.64   0.000     .2111207    .2819648
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         583.205
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              141.889
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):        1107.238
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      3921           0        3921     |
-----------------------------------------------------+

. outreg using output/temp/FigP1_A_outreg.tex, varlabels tex fragment merge  
>         ctitle( "" "Text&L&F") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g );

                                               --------------------------------------------------------
                                                                      A&M         Food      Text&L&F  
                                               --------------------------------------------------------
                                                Dlprice              -8.949      -2.355      -3.348   
                                                                   (3.375)***  (0.573)***  (0.212)*** 
                                                Dln_cond_lambda      0.171       0.098       0.247    
                                                                    (0.164)    (0.040)**   (0.018)*** 
                                                N Obs.               11,568      19,615     125,120   
                                                Weak Ident Test       5.02       13.24       141.89   
                                                UnderIdent P-val      0.00        0.00        0.00    
                                                N Prod-Year grs.       .           .           .      
                                               --------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=1700 & isic<2000;
(132,055 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=1700 & isic<2000;
(132,055 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=1700 & isic<2000;
(132,055 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=1700 & isic<2000;
(132,055 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=1700 & isic<2000;
(132,055 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>                 + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=1700 & isic<2000;
(132,055 real changes made)

.         replace id=3 if isic>=1700 & isic<2000;
(132,055 real changes made)

. ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda = Z Dln_nfirms Dln_nproducts Dltax) 
>         if isic>=2000 & isic<2100, a(fe1);
(dropped 67 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     5872
                                                      F(  2,  5516) =     3.75
                                                      Prob > F      =   0.0236
Total (centered) SS     =    411998029                Centered R2   =  -4.1699
Total (uncentered) SS   =    411998029                Uncentered R2 =  -4.1699
Residual SS             =   2129981909                Root MSE      =    621.4

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -3.485236    1.41418    -2.46   0.014    -6.257587   -.7128852
Dln_cond_lambda |   .1054948   .1952018     0.54   0.589    -.2771778    .4881674
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):           8.167
                                                   Chi-sq(3) P-val =    0.0427
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                1.920
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           1.915
                                                   Chi-sq(2) P-val =    0.3839
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |       354           0         354     |
-----------------------------------------------------+

. outreg using output/temp/FigP1_A_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Wood") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

                                         -------------------------------------------------------------------
                                                                A&M         Food      Text&L&F     Wood    
                                         -------------------------------------------------------------------
                                          Dlprice              -8.949      -2.355      -3.348     -3.485   
                                                             (3.375)***  (0.573)***  (0.212)***  (1.414)** 
                                          Dln_cond_lambda      0.171       0.098       0.247       0.105   
                                                              (0.164)    (0.040)**   (0.018)***   (0.195)  
                                          N Obs.               11,568      19,615     125,120      5,872   
                                          Weak Ident Test       5.02       13.24       141.89      1.92    
                                          UnderIdent P-val      0.00        0.00        0.00       0.04    
                                          N Prod-Year grs.       .           .           .           .     
                                         -------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=2000 & isic<2100;
(6,031 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2000 & isic<2100;
(6,031 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2000 & isic<2100;
(6,031 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=2000 & isic<2100;
(6,031 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2000 & isic<2100;
(6,031 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>                 + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2000 & isic<2100;
(6,031 real changes made)

.         replace id=4 if isic>=2000 & isic<2100;
(6,031 real changes made)

. ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =  Z1 Dln_nfirms Dln_nproducts Dltax)
>         if isic>=2100 & isic<2300, a(fe1);
(dropped 104 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =    37376
                                                      F(  2, 36393) =     9.42
                                                      Prob > F      =   0.0001
Total (centered) SS     =   3042698081                Centered R2   =  -1.1484
Total (uncentered) SS   =   3042698081                Uncentered R2 =  -1.1484
Residual SS             =   6536809851                Root MSE      =    423.8

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -2.549898   .9570892    -2.66   0.008     -4.42582   -.6739749
Dln_cond_lambda |   .1509714   .0540777     2.79   0.005     .0449775    .2569653
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          14.821
                                                   Chi-sq(3) P-val =    0.0020
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                3.609
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):          67.229
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Excluded instruments: Z1 Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |       981           0         981     |
-----------------------------------------------------+

.   outreg using output/temp/FigP1_A_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Paper") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

                                   -------------------------------------------------------------------------------
                                                          A&M         Food      Text&L&F     Wood       Paper    
                                   -------------------------------------------------------------------------------
                                    Dlprice              -8.949      -2.355      -3.348     -3.485      -2.550   
                                                       (3.375)***  (0.573)***  (0.212)***  (1.414)**  (0.957)*** 
                                    Dln_cond_lambda      0.171       0.098       0.247       0.105      0.151    
                                                        (0.164)    (0.040)**   (0.018)***   (0.195)   (0.054)*** 
                                    N Obs.               11,568      19,615     125,120      5,872      37,376   
                                    Weak Ident Test       5.02       13.24       141.89      1.92        3.61    
                                    UnderIdent P-val      0.00        0.00        0.00       0.04        0.00    
                                    N Prod-Year grs.       .           .           .           .          .      
                                   -------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=2100 & isic<2300;
(38,560 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2100 & isic<2300;
(38,560 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2100 & isic<2300;
(38,560 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=2100 & isic<2300;
(38,560 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2100 & isic<2300;
(38,560 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>                 + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2100 & isic<2300;
(38,560 real changes made)

.         replace id=5 if isic>=2100 & isic<2300;
(38,560 real changes made)

. ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =  Z Dln_nfirms Dln_nproducts Dltariff) 
>  if isic>=2300 & isic<2400, a(fe1);
(dropped 35 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     3973
                                                      F(  2,  3792) =     5.60
                                                      Prob > F      =   0.0037
Total (centered) SS     =  192068381.9                Centered R2   =   0.0510
Total (uncentered) SS   =  192068381.9                Uncentered R2 =   0.0510
Residual SS             =  182270533.9                Root MSE      =    219.2

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -.4619623   .2849332    -1.62   0.105    -1.020599    .0966747
Dln_cond_lambda |    .210456    .077145     2.73   0.006     .0592064    .3617057
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          14.387
                                                   Chi-sq(3) P-val =    0.0024
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                3.444
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           9.015
                                                   Chi-sq(2) P-val =    0.0110
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltariff
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |       179           0         179     |
-----------------------------------------------------+

.   outreg using output/temp/FigP1_A_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Petr") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

                             -------------------------------------------------------------------------------------------
                                                    A&M         Food      Text&L&F     Wood       Paper        Petr    
                             -------------------------------------------------------------------------------------------
                              Dlprice              -8.949      -2.355      -3.348     -3.485      -2.550      -0.462   
                                                 (3.375)***  (0.573)***  (0.212)***  (1.414)**  (0.957)***   (0.285)   
                              Dln_cond_lambda      0.171       0.098       0.247       0.105      0.151       0.210    
                                                  (0.164)    (0.040)**   (0.018)***   (0.195)   (0.054)***  (0.077)*** 
                              N Obs.               11,568      19,615     125,120      5,872      37,376      3,973    
                              Weak Ident Test       5.02       13.24       141.89      1.92        3.61        3.44    
                              UnderIdent P-val      0.00        0.00        0.00       0.04        0.00        0.00    
                              N Prod-Year grs.       .           .           .           .          .           .      
                             -------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]   if isic>=2300 & isic<2400;
(4,089 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2300 & isic<2400;
(4,089 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2300 & isic<2400;
(4,089 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=2300 & isic<2400;
(4,089 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2300 & isic<2400;
(4,089 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2
>                 + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2300 & isic<2400;
(4,089 real changes made)

.         replace id=6 if isic>=2300 & isic<2400;
(4,089 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =  Z Dln_nfirms Dln_nproducts Dlvat) 
>         if isic>=2400 & isic<2500, a(fe1)       cluster(fe2 fe1);
(dropped 802 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on fe2 and fe1

Number of clusters (fe2) =       52525                Number of obs =   133142
Number of clusters (fe1) =        6714                F(  2,  6713) =    57.64
                                                      Prob > F      =   0.0000
Total (centered) SS     =   6414885871                Centered R2   =  -1.8303
Total (uncentered) SS   =   6414885871                Uncentered R2 =  -1.8303
Residual SS             =  1.81559e+10                Root MSE      =    369.3

---------------------------------------------------------------------------------
                |               Robust
      Dln_x_wih | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -3.918142   .3984436    -9.83   0.000    -4.699218   -3.137066
Dln_cond_lambda |   .0784875   .0250644     3.13   0.002     .0293534    .1276216
---------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):            140.005
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               74.047
                         (Kleibergen-Paap rk Wald F statistic):         38.161
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):        72.368
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Excluded instruments: Z Dln_nfirms Dln_nproducts Dlvat
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      6714        6714           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. outreg using output/temp/FigP1_A_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Chem") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

                       -------------------------------------------------------------------------------------------------------
                                              A&M         Food      Text&L&F     Wood       Paper        Petr        Chem    
                       -------------------------------------------------------------------------------------------------------
                        Dlprice              -8.949      -2.355      -3.348     -3.485      -2.550      -0.462      -3.918   
                                           (3.375)***  (0.573)***  (0.212)***  (1.414)**  (0.957)***   (0.285)    (0.398)*** 
                        Dln_cond_lambda      0.171       0.098       0.247       0.105      0.151       0.210       0.078    
                                            (0.164)    (0.040)**   (0.018)***   (0.195)   (0.054)***  (0.077)***  (0.025)*** 
                        N Obs.               11,568      19,615     125,120      5,872      37,376      3,973      133,142   
                        Weak Ident Test       5.02       13.24       141.89      1.92        3.61        3.44       38.16    
                        UnderIdent P-val      0.00        0.00        0.00       0.04        0.00        0.00        0.00    
                        N Prod-Year grs.       .           .           .           .          .           .           .      
                       -------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=2400 & isic<2500;
(136,470 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2400 & isic<2500;
(136,470 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2400 & isic<2500;
(136,470 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=2400 & isic<2500;
(136,470 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2400 & isic<2500;
(136,470 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>                 + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2400 & isic<2500;
(136,470 real changes made)

.         replace id=7 if isic>=2400 & isic<2500;
(136,470 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =  Z Dln_nfirms Dln_nproducts Dlvat) 
>         if isic>=2500 & isic<2600, a(fe1);
(dropped 25 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =   106398
                                                      F(  2,105281) =    63.02
                                                      Prob > F      =   0.0000
Total (centered) SS     =   8066237763                Centered R2   =  -4.4735
Total (uncentered) SS   =   8066237763                Uncentered R2 =  -4.4735
Residual SS             =  4.41507e+10                Root MSE      =    647.6

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -4.961838   .8982375    -5.52   0.000    -6.722372   -3.201305
Dln_cond_lambda |   .2830795   .0563402     5.02   0.000     .1726534    .3935056
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          37.897
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                9.378
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):         113.914
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Excluded instruments: Z Dln_nfirms Dln_nproducts Dlvat
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      1115           0        1115     |
-----------------------------------------------------+

.  outreg using output/temp/FigP1_A_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Rub&Plas") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

                 -------------------------------------------------------------------------------------------------------------------
                                        A&M         Food      Text&L&F     Wood       Paper        Petr        Chem      Rub&Plas  
                 -------------------------------------------------------------------------------------------------------------------
                  Dlprice              -8.949      -2.355      -3.348     -3.485      -2.550      -0.462      -3.918      -4.962   
                                     (3.375)***  (0.573)***  (0.212)***  (1.414)**  (0.957)***   (0.285)    (0.398)***  (0.898)*** 
                  Dln_cond_lambda      0.171       0.098       0.247       0.105      0.151       0.210       0.078       0.283    
                                      (0.164)    (0.040)**   (0.018)***   (0.195)   (0.054)***  (0.077)***  (0.025)***  (0.056)*** 
                  N Obs.               11,568      19,615     125,120      5,872      37,376      3,973      133,142     106,398   
                  Weak Ident Test       5.02       13.24       141.89      1.92        3.61        3.44       38.16        9.38    
                  UnderIdent P-val      0.00        0.00        0.00       0.04        0.00        0.00        0.00        0.00    
                  N Prod-Year grs.       .           .           .           .          .           .           .           .      
                 -------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=2500 & isic<2600;
(110,022 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2500 & isic<2600;
(110,022 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2500 & isic<2600;
(110,022 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=2500 & isic<2600;
(110,022 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2500 & isic<2600;
(110,022 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>                 + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2500 & isic<2600;
(110,022 real changes made)

.         replace id=8 if isic>=2500 & isic<2600;
(110,022 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =  Z Dln_nfirms Dln_nproducts Dlvat) 
>         if isic>=2600 & isic<2700, a(fe1);
(dropped 88 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =    27952
                                                      F(  2, 27071) =    15.61
                                                      Prob > F      =   0.0000
Total (centered) SS     =   1904786727                Centered R2   =  -2.9791
Total (uncentered) SS   =   1904786727                Uncentered R2 =  -2.9791
Residual SS             =   7579339372                Root MSE      =    529.1

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -4.252284   1.092816    -3.89   0.000     -6.39426   -2.110309
Dln_cond_lambda |   .1514541   .0811726     1.87   0.062    -.0076484    .3105565
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          21.194
                                                   Chi-sq(3) P-val =    0.0001
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                5.135
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):          41.397
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Excluded instruments: Z Dln_nfirms Dln_nproducts Dlvat
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |       879           0         879     |
-----------------------------------------------------+

.  outreg using output/temp/FigP1_A_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Miner") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

           -------------------------------------------------------------------------------------------------------------------------------
                                  A&M         Food      Text&L&F     Wood       Paper        Petr        Chem      Rub&Plas     Miner    
           -------------------------------------------------------------------------------------------------------------------------------
            Dlprice              -8.949      -2.355      -3.348     -3.485      -2.550      -0.462      -3.918      -4.962      -4.252   
                               (3.375)***  (0.573)***  (0.212)***  (1.414)**  (0.957)***   (0.285)    (0.398)***  (0.898)***  (1.093)*** 
            Dln_cond_lambda      0.171       0.098       0.247       0.105      0.151       0.210       0.078       0.283       0.151    
                                (0.164)    (0.040)**   (0.018)***   (0.195)   (0.054)***  (0.077)***  (0.025)***  (0.056)***   (0.081)*  
            N Obs.               11,568      19,615     125,120      5,872      37,376      3,973      133,142     106,398      27,952   
            Weak Ident Test       5.02       13.24       141.89      1.92        3.61        3.44       38.16        9.38        5.13    
            UnderIdent P-val      0.00        0.00        0.00       0.04        0.00        0.00        0.00        0.00        0.00    
            N Prod-Year grs.       .           .           .           .          .           .           .           .           .      
           -------------------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=2600 & isic<2700;
(28,616 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2600 & isic<2700;
(28,616 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2600 & isic<2700;
(28,616 real changes made)

.         replace a_se = _se[Dln_cond_lambda]  if isic>=2600 & isic<2700;
(28,616 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2600 & isic<2700;
(28,616 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>         + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2600 & isic<2700;
(28,616 real changes made)

.         replace id=9 if isic>=2600 & isic<2700;
(28,616 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =  Z Dln_nfirms Dln_nproducts Dlvat) 
>         if isic>=2700 & isic<2900, a(fe1);
(dropped 420 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =   153102
                                                      F(  2,149919) =   191.07
                                                      Prob > F      =   0.0000
Total (centered) SS     =  1.26333e+10                Centered R2   =  -1.6438
Total (uncentered) SS   =  1.26333e+10                Uncentered R2 =  -1.6438
Residual SS             =  3.34002e+10                Root MSE      =      472

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -3.687536   .4734641    -7.79   0.000    -4.615516   -2.759556
Dln_cond_lambda |   .3587283   .0274086    13.09   0.000     .3050079    .4124486
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          85.372
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               20.911
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):         425.708
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Excluded instruments: Z Dln_nfirms Dln_nproducts Dlvat
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      3181           0        3181     |
-----------------------------------------------------+

.   outreg using output/temp/FigP1_A_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "BasFaM") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

     -------------------------------------------------------------------------------------------------------------------------------------------
                            A&M         Food      Text&L&F     Wood       Paper        Petr        Chem      Rub&Plas     Miner       BasFaM   
     -------------------------------------------------------------------------------------------------------------------------------------------
      Dlprice              -8.949      -2.355      -3.348     -3.485      -2.550      -0.462      -3.918      -4.962      -4.252      -3.688   
                         (3.375)***  (0.573)***  (0.212)***  (1.414)**  (0.957)***   (0.285)    (0.398)***  (0.898)***  (1.093)***  (0.473)*** 
      Dln_cond_lambda      0.171       0.098       0.247       0.105      0.151       0.210       0.078       0.283       0.151       0.359    
                          (0.164)    (0.040)**   (0.018)***   (0.195)   (0.054)***  (0.077)***  (0.025)***  (0.056)***   (0.081)*   (0.027)*** 
      N Obs.               11,568      19,615     125,120      5,872      37,376      3,973      133,142     106,398      27,952     153,102   
      Weak Ident Test       5.02       13.24       141.89      1.92        3.61        3.44       38.16        9.38        5.13       20.91    
      UnderIdent P-val      0.00        0.00        0.00       0.04        0.00        0.00        0.00        0.00        0.00        0.00    
      N Prod-Year grs.       .           .           .           .          .           .           .           .           .           .      
     -------------------------------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=2700 & isic<2900;
(157,679 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2700 & isic<2900;
(157,679 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2700 & isic<2900;
(157,679 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=2700 & isic<2900;
(157,679 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2700 & isic<2900;
(157,679 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>         + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2700 & isic<2900;
(157,679 real changes made)

.         replace id=10 if isic>=2700 & isic<2900;
(157,679 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =   Z Dln_nfirms Dln_nproducts Dltax) 
>         if isic>=2900 & isic<3100, a(fe1);
(dropped 446 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =   263797
                                                      F(  2,259813) =    59.01
                                                      Prob > F      =   0.0000
Total (centered) SS     =  1.91335e+10                Centered R2   = -16.8205
Total (uncentered) SS   =  1.91335e+10                Uncentered R2 = -16.8205
Residual SS             =  3.40968e+11                Root MSE      =     1146

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -8.526919   1.058434    -8.06   0.000    -10.60142   -6.452417
Dln_cond_lambda |   .0389082   .0660328     0.59   0.556    -.0905144    .1683307
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          78.083
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               19.231
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):          54.308
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      3982           0        3982     |
-----------------------------------------------------+

.  outreg using output/temp/FigP1_A_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Mach") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

     -------------------------------------------------------------------------------------------------------------------------------------------
                            A&M         Food      Text&L&F     Wood       Paper        Petr        Chem      Rub&Plas     Miner       BasFaM   
     -------------------------------------------------------------------------------------------------------------------------------------------
      Dlprice              -8.949      -2.355      -3.348     -3.485      -2.550      -0.462      -3.918      -4.962      -4.252      -3.688   
                         (3.375)***  (0.573)***  (0.212)***  (1.414)**  (0.957)***   (0.285)    (0.398)***  (0.898)***  (1.093)***  (0.473)*** 
      Dln_cond_lambda      0.171       0.098       0.247       0.105      0.151       0.210       0.078       0.283       0.151       0.359    
                          (0.164)    (0.040)**   (0.018)***   (0.195)   (0.054)***  (0.077)***  (0.025)***  (0.056)***   (0.081)*   (0.027)*** 
      N Obs.               11,568      19,615     125,120      5,872      37,376      3,973      133,142     106,398      27,952     153,102   
      Weak Ident Test       5.02       13.24       141.89      1.92        3.61        3.44       38.16        9.38        5.13       20.91    
      UnderIdent P-val      0.00        0.00        0.00       0.04        0.00        0.00        0.00        0.00        0.00        0.00    
      N Prod-Year grs.       .           .           .           .          .           .           .           .           .           .      
     -------------------------------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


                                                           --------------------------------
                                                                                  Mach    
                                                           --------------------------------
                                                            Dlprice              -8.527   
                                                                               (1.058)*** 
                                                            Dln_cond_lambda      0.039    
                                                                                (0.066)   
                                                            N Obs.              263,797   
                                                            Weak Ident Test      19.23    
                                                            UnderIdent P-val      0.00    
                                                            N Prod-Year grs.       .      
                                                           --------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=2900 & isic<3100;
(272,102 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2900 & isic<3100;
(272,102 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2900 & isic<3100;
(272,102 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=2900 & isic<3100;
(272,102 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2900 & isic<3100;
(272,102 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>         + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2900 & isic<3100;
(272,102 real changes made)

.         replace id=11 if isic>=2900 & isic<3100;
(272,102 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =   Z Dln_nfirms Dln_nproducts Dltax) 
>         if isic>=3100 & isic<3400, a(fe1);
(dropped 230 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =   257775
                                                      F(  2,254410) =   386.28
                                                      Prob > F      =   0.0000
Total (centered) SS     =  1.94412e+10                Centered R2   =  -0.1331
Total (uncentered) SS   =  1.94412e+10                Uncentered R2 =  -0.1331
Residual SS             =  2.20279e+10                Root MSE      =    294.3

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -1.377633   .1475002    -9.34   0.000    -1.666729   -1.088536
Dln_cond_lambda |   .3153694   .0127369    24.76   0.000     .2904054    .3403335
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         319.311
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               78.883
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):        1656.974
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      3363           0        3363     |
-----------------------------------------------------+

. outreg using output/temp/FigP1_A_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Elec") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

     -------------------------------------------------------------------------------------------------------------------------------------------
                            A&M         Food      Text&L&F     Wood       Paper        Petr        Chem      Rub&Plas     Miner       BasFaM   
     -------------------------------------------------------------------------------------------------------------------------------------------
      Dlprice              -8.949      -2.355      -3.348     -3.485      -2.550      -0.462      -3.918      -4.962      -4.252      -3.688   
                         (3.375)***  (0.573)***  (0.212)***  (1.414)**  (0.957)***   (0.285)    (0.398)***  (0.898)***  (1.093)***  (0.473)*** 
      Dln_cond_lambda      0.171       0.098       0.247       0.105      0.151       0.210       0.078       0.283       0.151       0.359    
                          (0.164)    (0.040)**   (0.018)***   (0.195)   (0.054)***  (0.077)***  (0.025)***  (0.056)***   (0.081)*   (0.027)*** 
      N Obs.               11,568      19,615     125,120      5,872      37,376      3,973      133,142     106,398      27,952     153,102   
      Weak Ident Test       5.02       13.24       141.89      1.92        3.61        3.44       38.16        9.38        5.13       20.91    
      UnderIdent P-val      0.00        0.00        0.00       0.04        0.00        0.00        0.00        0.00        0.00        0.00    
      N Prod-Year grs.       .           .           .           .          .           .           .           .           .           .      
     -------------------------------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


                                                     --------------------------------------------
                                                                            Mach        Elec    
                                                     --------------------------------------------
                                                      Dlprice              -8.527      -1.378   
                                                                         (1.058)***  (0.148)*** 
                                                      Dln_cond_lambda      0.039       0.315    
                                                                          (0.066)    (0.013)*** 
                                                      N Obs.              263,797     257,775   
                                                      Weak Ident Test      19.23       78.88    
                                                      UnderIdent P-val      0.00        0.00    
                                                      N Prod-Year grs.       .           .      
                                                     --------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=3100 & isic<3400;
(265,219 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=3100 & isic<3400;
(265,219 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=3100 & isic<3400;
(265,219 real changes made)

.         replace a_se = _se[Dln_cond_lambda]  if isic>=3100 & isic<3400;
(265,219 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=3100 & isic<3400;
(265,219 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>         + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=3100 & isic<3400;
(265,219 real changes made)

.         replace id=12 if isic>=3100 & isic<3400;
(265,219 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =   Z Dln_nfirms Dln_nproducts Dltariff) 
>         if isic>=3400 & isic<3600, a(fe1);
(dropped 86 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =    85920
                                                      F(  2, 84882) =   310.91
                                                      Prob > F      =   0.0000
Total (centered) SS     =   5842560767                Centered R2   =  -0.7030
Total (uncentered) SS   =   5842560767                Uncentered R2 =  -0.7030
Residual SS             =   9949857125                Root MSE      =    342.4

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -2.568716   .4934138    -5.21   0.000    -3.535804   -1.601629
Dln_cond_lambda |     .63573    .025674    24.76   0.000     .5854091    .6860509
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          43.513
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               10.752
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):         433.052
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltariff
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      1036           0        1036     |
-----------------------------------------------------+

. outreg using output/temp/FigP1_A_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Trnsp") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

     -------------------------------------------------------------------------------------------------------------------------------------------
                            A&M         Food      Text&L&F     Wood       Paper        Petr        Chem      Rub&Plas     Miner       BasFaM   
     -------------------------------------------------------------------------------------------------------------------------------------------
      Dlprice              -8.949      -2.355      -3.348     -3.485      -2.550      -0.462      -3.918      -4.962      -4.252      -3.688   
                         (3.375)***  (0.573)***  (0.212)***  (1.414)**  (0.957)***   (0.285)    (0.398)***  (0.898)***  (1.093)***  (0.473)*** 
      Dln_cond_lambda      0.171       0.098       0.247       0.105      0.151       0.210       0.078       0.283       0.151       0.359    
                          (0.164)    (0.040)**   (0.018)***   (0.195)   (0.054)***  (0.077)***  (0.025)***  (0.056)***   (0.081)*   (0.027)*** 
      N Obs.               11,568      19,615     125,120      5,872      37,376      3,973      133,142     106,398      27,952     153,102   
      Weak Ident Test       5.02       13.24       141.89      1.92        3.61        3.44       38.16        9.38        5.13       20.91    
      UnderIdent P-val      0.00        0.00        0.00       0.04        0.00        0.00        0.00        0.00        0.00        0.00    
      N Prod-Year grs.       .           .           .           .          .           .           .           .           .           .      
     -------------------------------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


                                               --------------------------------------------------------
                                                                      Mach        Elec       Trnsp    
                                               --------------------------------------------------------
                                                Dlprice              -8.527      -1.378      -2.569   
                                                                   (1.058)***  (0.148)***  (0.493)*** 
                                                Dln_cond_lambda      0.039       0.315       0.636    
                                                                    (0.066)    (0.013)***  (0.026)*** 
                                                N Obs.              263,797     257,775      85,920   
                                                Weak Ident Test      19.23       78.88       10.75    
                                                UnderIdent P-val      0.00        0.00        0.00    
                                                N Prod-Year grs.       .           .           .      
                                               --------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=3400 & isic<3600;
(88,729 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=3400 & isic<3600;
(88,729 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=3400 & isic<3600;
(88,729 real changes made)

.         replace a_se = _se[Dln_cond_lambda]  if isic>=3400 & isic<3600;
(88,729 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=3400 & isic<3600;
(88,729 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 + 
>         (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=3400 & isic<3600;
(88,729 real changes made)

.         replace id=13  if isic>=3400 & isic<3600;
(88,729 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =   Z Dln_nfirms Dln_nproducts Dltax) 
>         if isic>=3600 & isic<3800, a(fe1);
(dropped 112 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =    70264
                                                      F(  2, 68983) =    36.36
                                                      Prob > F      =   0.0000
Total (centered) SS     =   5288598014                Centered R2   =  -7.2679
Total (uncentered) SS   =   5288598014                Uncentered R2 =  -7.2679
Residual SS             =  4.37255e+10                Root MSE      =    796.2

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -6.097009   .9235786    -6.60   0.000    -7.907221   -4.286796
Dln_cond_lambda |   .0661159   .0894621     0.74   0.460    -.1092297    .2414616
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          53.121
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               13.048
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):          17.970
                                                   Chi-sq(2) P-val =    0.0001
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      1279           0        1279     |
-----------------------------------------------------+

. outreg using output/temp/FigP1_A_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "MnfR") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

     -------------------------------------------------------------------------------------------------------------------------------------------
                            A&M         Food      Text&L&F     Wood       Paper        Petr        Chem      Rub&Plas     Miner       BasFaM   
     -------------------------------------------------------------------------------------------------------------------------------------------
      Dlprice              -8.949      -2.355      -3.348     -3.485      -2.550      -0.462      -3.918      -4.962      -4.252      -3.688   
                         (3.375)***  (0.573)***  (0.212)***  (1.414)**  (0.957)***   (0.285)    (0.398)***  (0.898)***  (1.093)***  (0.473)*** 
      Dln_cond_lambda      0.171       0.098       0.247       0.105      0.151       0.210       0.078       0.283       0.151       0.359    
                          (0.164)    (0.040)**   (0.018)***   (0.195)   (0.054)***  (0.077)***  (0.025)***  (0.056)***   (0.081)*   (0.027)*** 
      N Obs.               11,568      19,615     125,120      5,872      37,376      3,973      133,142     106,398      27,952     153,102   
      Weak Ident Test       5.02       13.24       141.89      1.92        3.61        3.44       38.16        9.38        5.13       20.91    
      UnderIdent P-val      0.00        0.00        0.00       0.04        0.00        0.00        0.00        0.00        0.00        0.00    
      N Prod-Year grs.       .           .           .           .          .           .           .           .           .           .      
     -------------------------------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


                                         --------------------------------------------------------------------
                                                                Mach        Elec       Trnsp        MnfR    
                                         --------------------------------------------------------------------
                                          Dlprice              -8.527      -1.378      -2.569      -6.097   
                                                             (1.058)***  (0.148)***  (0.493)***  (0.924)*** 
                                          Dln_cond_lambda      0.039       0.315       0.636       0.066    
                                                              (0.066)    (0.013)***  (0.026)***   (0.089)   
                                          N Obs.              263,797     257,775      85,920      70,264   
                                          Weak Ident Test      19.23       78.88       10.75       13.05    
                                          UnderIdent P-val      0.00        0.00        0.00        0.00    
                                          N Prod-Year grs.       .           .           .           .      
                                         --------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=3600 & isic<3800;
(72,006 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=3600 & isic<3800;
(72,006 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda]) if isic>=3600 & isic<3800;
(72,006 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=3600 & isic<3800;
(72,006 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=3600 & isic<3800;
(72,006 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>         + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=3600 & isic<3800;
(72,006 real changes made)

.         replace id=14 if isic>=3600 & isic<3800;
(72,006 real changes made)

.         collapse theta psi, by(id);

. save data/internally_generated/figP1_initial_share_iv.dta, replace;
file data/internally_generated/figP1_initial_share_iv.dta saved

. 
end of do-file
. do code/data_prep/5-robustness_check_2 // exclude excessively large firms

. clear

. **************************************************************
. 
. use "data/exchange_rate_report_boc/exchange_rate_report.dta", clear

. collapse (mean) xrate_usd xrate_col,by( month year country )

. 
. 
. gen CountryofOrigin=strupper(country)

. sort CountryofOrigin

. collapse (mean) xrate_usd xrate_col , by(month year CountryofOrigin)

. 
. egen id=group(CountryofOrigin)

. gen date=ym(year, month)

. tsset id date

Panel variable: id (strongly balanced)
 Time variable: date, 564 to 660
         Delta: 1 unit

. 
. *gen Flxrate_col = log(F12.xrate_col) - log(F11.xrate_col)
. *gen Flxrate_usd = log(F12.xrate_usd) - log(F11.xrate_usd)
. 
. local n_lag=7

. 
. ******************************************
. forvalues y=1/`n_lag'  {
  2. local x2 = 12*`y'
  3. local x1 = 12*(`y' - 1 ) 
  4. gen exc_col_F`y' = 100*(log(F`x2'.xrate_col) - log(F`x1'.xrate_col))
  5. gen exc_usd_F`y' = 100*(log(F`x2'.xrate_usd) - log(F`x1'.xrate_usd))
  6. }
(920 missing values generated)
(920 missing values generated)
(1,824 missing values generated)
(1,824 missing values generated)
(2,736 missing values generated)
(2,736 missing values generated)
(3,648 missing values generated)
(3,648 missing values generated)
(4,560 missing values generated)
(4,560 missing values generated)
(5,472 missing values generated)
(5,472 missing values generated)
(6,384 missing values generated)
(6,384 missing values generated)

. drop id

. 
. merge 1:m CountryofOrigin year month using "data/temp/colombia_imports_updated_hs.dta"
(variable CountryofOrigin was str24, now str50 to accommodate using data's values)
(variable year was int, now float to accommodate using data's values)
(variable month was byte, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                       272,394
        from master                     1,580  (_merge==1)
        from using                    270,814  (_merge==2)

    Matched                        17,003,919  (_merge==3)
    -----------------------------------------

. *merge 1:m CountryofOrigin year month using Colombiaimports_HS10_collapsed
. 
. destring  VATPercent TariffPercent ExchangeRate, replace
VATPercent: all characters numeric; replaced as double
(1580 missing values generated)
TariffPercent: all characters numeric; replaced as double
(1580 missing values generated)
ExchangeRate: all characters numeric; replaced as double
(1580 missing values generated)

. drop if CustomsValueTariffBase<0
(1 observation deleted)

. 
. collapse (sum) CustomsValueTariffBase Valuetobepay Quantity (mean) VATPercent TariffPercent exc_col_F* exc_usd_F* ExchangeRate [fw=CustomsValueTarif
> fBase], by(year ProductHS CountryofOrigin Provider)

. ***************************************
. 
. egen id = group(ProductHS CountryofOrigin Provider)
(13 missing values generated)

. drop if missing(id)
(13 observations deleted)

. tsset id year

Panel variable: id (unbalanced)
 Time variable: year, 2007 to 2013, but with gaps
         Delta: 1 unit

. 
. generate Dexc_col = cond(!missing(L.exc_col_F1) ,  L.exc_col_F1, ///
>                     cond(!missing(L2.exc_col_F2) , L2.exc_col_F2, ///
>                                 cond(!missing(L3.exc_col_F3) , L3.exc_col_F3, ///
>                                     cond(!missing(L4.exc_col_F4) , L4.exc_col_F4, ///
>                                     cond(!missing(L5.exc_col_F5) , L5.exc_col_F5, ///
>                                         cond(!missing(L6.exc_col_F6) , L6.exc_col_F6, ///
>                                     cond(!missing(L7.exc_col_F7) , L7.exc_col_F7, ///
>                                                                                 . )))))))
(2,210,182 missing values generated)

.                                                                                 
. generate Dexc_usd = cond(!missing(L.exc_usd_F1) ,  L.exc_usd_F1, ///
>                     cond(!missing(L2.exc_usd_F2) , L2.exc_usd_F2, ///
>                                     cond(!missing(L3.exc_usd_F3) , L3.exc_usd_F3, ///
>                                     cond(!missing(L4.exc_usd_F4) , L4.exc_usd_F4, ///
>                                     cond(!missing(L5.exc_usd_F5) , L4.exc_usd_F5, ///
>                                         cond(!missing(L6.exc_usd_F6) , L5.exc_usd_F6, ///
>                                         cond(!missing(L7.exc_usd_F7) , L6.exc_usd_F7, ///
>                                                                         . )))))))
(2,227,024 missing values generated)

. 
. ****************************************
. ** Save Data -- Firm Level
. ****************************************
. gen x_whi = CustomsValueTariffBase + Valuetobepay

. 
. ****************************************
. ** Construct Within-National Shares
. ****************************************
. bysort year ProductHS CountryofOrigin : egen x_hi=total(x_whi)

. 
. gen ln_cond_lambda = log(x_whi/x_hi)

. *****************************************
. 
. gen price=x_whi/Quantity
(14 missing values generated)

. gen lprice=log(price)
(14 missing values generated)

. gen lvat=log(1+0.01*VATPercent)

. gen ltariff=log(1+0.01*TariffPercent)

. *gen ltariff=log(1+TariffPercent)
. *gen lvat=log(1+VATPercent)
. gen ltax = lvat + ltariff

. gen lexc = log(ExchangeRate)

. 
. gen ln_x_wih = log(x_whi)

. gen ln_q_wih = log(Quantity)
(14 missing values generated)

. 
. *gen lexc_col = log(exc_col)
. *gen lexc_usd = log(exc_usd)
. 
. gen hs8=substr(ProductHS,1,8)

. destring hs8, replace
hs8: all characters numeric; replaced as long

. *gen mnf=(hs2>=30 & hs2<=38) | (hs2>=42 & hs2<=97)
. 
. egen panelvar = group(ProductHS CountryofOrigin Provider)

. drop if missing(panelvar)
(0 observations deleted)

. 
. *******************************************************
. ** Contructing Khandelwal IVs for Within-National Share
. ********************************************************
. 
. * number of firms exporting from country i in product h
. bysort year CountryofOrigin ProductHS: gen ln_nfirms=log(_N)

. 
. * number of products firm w exports in
. bysort year CountryofOrigin Provider: gen ln_nproducts=log(_N)

. 
. tsset id year

Panel variable: id (unbalanced)
 Time variable: year, 2007 to 2013, but with gaps
         Delta: 1 unit

. gen ltariff_lag = L.ltariff
(2,460,852 missing values generated)

. gen ltax_lag = L.ltax
(2,460,852 missing values generated)

. ********************************************************
. 
. xtset panelvar year

Panel variable: panelvar (unbalanced)
 Time variable: year, 2007 to 2013, but with gaps
         Delta: 1 unit

. foreach var in lprice ln_x_wih ltax ltariff lvat ln_cond_lambda ln_nfirms ln_nproducts lexc {
  2.         gen D`var'=100*D.`var'
  3.         }
(2,460,854 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)

.         
.         keep if Dln_x_wih!=.
(2,460,852 observations deleted)

.         
. egen fe1=group(ProductHS year)

. gen fe2=panelvar

. 
. 
. *drop if Quantity<=1
. *drop if FOBValueUS<500
. 
. keep Dln_x_wih Dln_cond_lambda Dlprice Dexc_col Dexc_usd Dlvat Dltariff Dltax fe1 fe2 ProductHS Dln_nfirms Dln_nproducts ///
> ln_x_wih ln_cond_lambda lprice ltariff lvat ltax ln_nfirms ln_nproducts ltariff_lag ltax_lag year Dlexc

. 
. *****************************************
. gen theta=.
(1,346,236 missing values generated)

. gen theta_se=.
(1,346,236 missing values generated)

. gen a_se=.
(1,346,236 missing values generated)

. gen a = .
(1,346,236 missing values generated)

. gen psi=.
(1,346,236 missing values generated)

. gen psi_se=.
(1,346,236 missing values generated)

. gen id=.
(1,346,236 missing values generated)

. 
. 
. gen hs2=substr(ProductHS,1,2)

. destring hs2, replace
hs2: all characters numeric; replaced as byte

. gen mnf=(hs2>=30 & hs2<=38) | (hs2>=42 & hs2<=97)

. drop hs2

. 
. gen hs6=substr(ProductHS,1,6)

. destring hs6, replace
hs6: all characters numeric; replaced as long

. 
. merge m:1 hs6 using data/concordance/isic_hs6

    Result                      Number of obs
    -----------------------------------------
    Not matched                         5,096
        from master                     4,587  (_merge==1)
        from using                        509  (_merge==2)

    Matched                         1,341,649  (_merge==3)
    -----------------------------------------

. replace isic=3600 if _merge == 1
(4,587 real changes made)

. drop _merge

. 
. winsor2 Dlprice Dln_x_wih, replace cuts(1 99) by(fe1) trim

. rename Dexc_usd Z1

. rename Dexc_col Z2

. 
. generate Z = cond(!missing(Z1) & Z1!=0, Z1, Z2, .)
(15,295 missing values generated)

. ************************************************
. *****   INDUSTRY-LEVEL ESTIMATION    ***********
. ************************************************
. 
. set more off

.         #delimit;
delimiter now ;
.                 ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda = Z Dln_nfirms Dln_nproducts Dltax) Dlexc
>         if isic>=100 & isic<1500, liml a(fe1);
(dropped 390 singleton observations)
(MWFE estimator converged in 1 iterations)

LIML estimation
---------------
k               =1.00085
lambda          =1.00085

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =    11568
                                                      F(  3, 10358) =     4.26
                                                      Prob > F      =   0.0051
Total (centered) SS     =  433870990.1                Centered R2   =  -6.9249
Total (uncentered) SS   =  433870990.1                Uncentered R2 =  -6.9249
Residual SS             =   3438373137                Root MSE      =    576.2

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -8.201908   2.856848    -2.87   0.004    -13.80188   -2.601933
Dln_cond_lambda |    .126841   .1476263     0.86   0.390     -.162535    .4162171
          Dlexc |   9.199997   2.707557     3.40   0.001     3.892662    14.50733
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          20.814
                                                   Chi-sq(3) P-val =    0.0001
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                4.667
Stock-Yogo weak ID test critical values: 10% maximal LIML size            4.72
                                         15% maximal LIML size            3.39
                                         20% maximal LIML size            2.99
                                         25% maximal LIML size            2.79
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           9.855
                                                   Chi-sq(2) P-val =    0.0072
------------------------------------------------------------------------------
Anderson-Rubin statistic (overidentification test of all instruments):   9.859
                                                   Chi-sq(2) P-val =    0.0072
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      1207           0        1207     |
-----------------------------------------------------+

. outreg using output/temp/FigP1_B_outreg.tex, varlabels tex fragment replace  
>         ctitle("" "A&M") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g );

                                                           --------------------------------
                                                                                  A&M     
                                                           --------------------------------
                                                            Dlprice              -8.202   
                                                                               (2.857)*** 
                                                            Dln_cond_lambda      0.127    
                                                                                (0.148)   
                                                            Dlexc                9.200    
                                                                               (2.708)*** 
                                                            N Obs.               11,568   
                                                            Weak Ident Test       4.67    
                                                            UnderIdent P-val      0.00    
                                                            N Prod-Year grs.       .      
                                                           --------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=100 & isic<1500;
(12,551 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=100 & isic<1500;
(12,551 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=100 & isic<1500;
(12,551 real changes made)

.         replace a_se = _se[Dln_cond_lambda]  if isic>=100 & isic<1500;
(12,551 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=100 & isic<1500;
(12,551 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>         + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=100 & isic<1500;
(12,551 real changes made)

.         replace id=1 if isic>=100 & isic<1500;
(12,551 real changes made)

. ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda = Z Dln_nfirms Dln_nproducts Dltax) Dlexc
>         if isic>=1500 & isic<1700, a(fe1) ;
(dropped 396 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =    19615
                                                      F(  3, 17814) =    39.32
                                                      Prob > F      =   0.0000
Total (centered) SS     =  588479705.2                Centered R2   =  -0.2103
Total (uncentered) SS   =  588479705.2                Uncentered R2 =  -0.2103
Residual SS             =  712265736.2                Root MSE      =      200

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -2.065959   .5140749    -4.02   0.000    -3.073596   -1.058322
Dln_cond_lambda |   .0919782   .0379336     2.42   0.015     .0176246    .1663319
          Dlexc |   4.271838   .5288556     8.08   0.000      3.23523    5.308446
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          66.815
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               15.220
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):         128.783
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      1798           0        1798     |
-----------------------------------------------------+

.   outreg using output/temp/FigP1_B_outreg.tex, varlabels tex fragment merge  
>         ctitle( "" "Food") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g );

                                                     --------------------------------------------
                                                                            A&M         Food    
                                                     --------------------------------------------
                                                      Dlprice              -8.202      -2.066   
                                                                         (2.857)***  (0.514)*** 
                                                      Dln_cond_lambda      0.127       0.092    
                                                                          (0.148)    (0.038)**  
                                                      Dlexc                9.200       4.272    
                                                                         (2.708)***  (0.529)*** 
                                                      N Obs.               11,568      19,615   
                                                      Weak Ident Test       4.67       15.22    
                                                      UnderIdent P-val      0.00        0.00    
                                                      N Prod-Year grs.       .           .      
                                                     --------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=1500 & isic<1700;
(20,882 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=1500 & isic<1700;
(20,882 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=1500 & isic<1700;
(20,882 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=1500 & isic<1700;
(20,882 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=1500 & isic<1700;
(20,882 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>                 + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=1500 & isic<1700;
(20,882 real changes made)

.         replace id=2 if isic>=1500 & isic<1700;
(20,882 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda = Z Dln_nfirms Dln_nproducts Dltax) Dlexc
>         if isic>=1700 & isic<2000, a(fe1);
(dropped 551 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =   125120
                                                      F(  3,121196) =   251.74
                                                      Prob > F      =   0.0000
Total (centered) SS     =   9274007577                Centered R2   =  -0.3921
Total (uncentered) SS   =   9274007577                Uncentered R2 =  -0.3921
Residual SS             =  1.29104e+10                Root MSE      =    326.4

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -3.576383   .2273835   -15.73   0.000    -4.022051   -3.130716
Dln_cond_lambda |   .2504369   .0184494    13.57   0.000     .2142764    .2865974
          Dlexc |    5.59536   .2960735    18.90   0.000     5.015061    6.175659
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         542.540
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              131.951
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):        1051.501
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      3921           0        3921     |
-----------------------------------------------------+

. outreg using output/temp/FigP1_B_outreg.tex, varlabels tex fragment merge  
>         ctitle( "" "Text&L&F") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g );

                                               --------------------------------------------------------
                                                                      A&M         Food      Text&L&F  
                                               --------------------------------------------------------
                                                Dlprice              -8.202      -2.066      -3.576   
                                                                   (2.857)***  (0.514)***  (0.227)*** 
                                                Dln_cond_lambda      0.127       0.092       0.250    
                                                                    (0.148)    (0.038)**   (0.018)*** 
                                                Dlexc                9.200       4.272       5.595    
                                                                   (2.708)***  (0.529)***  (0.296)*** 
                                                N Obs.               11,568      19,615     125,120   
                                                Weak Ident Test       4.67       15.22       131.95   
                                                UnderIdent P-val      0.00        0.00        0.00    
                                                N Prod-Year grs.       .           .           .      
                                               --------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=1700 & isic<2000;
(132,055 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=1700 & isic<2000;
(132,055 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=1700 & isic<2000;
(132,055 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=1700 & isic<2000;
(132,055 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=1700 & isic<2000;
(132,055 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>                 + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=1700 & isic<2000;
(132,055 real changes made)

.         replace id=3 if isic>=1700 & isic<2000;
(132,055 real changes made)

. ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda = Z Dln_nfirms Dln_nproducts Dltax) Dlexc
>         if isic>=2000 & isic<2100, a(fe1) ;
(dropped 67 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     5872
                                                      F(  3,  5515) =     4.05
                                                      Prob > F      =   0.0069
Total (centered) SS     =    411998029                Centered R2   =  -4.7031
Total (uncentered) SS   =    411998029                Uncentered R2 =  -4.7031
Residual SS             =   2349686357                Root MSE      =    652.7

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -3.715933   1.509217    -2.46   0.014    -6.674593   -.7572725
Dln_cond_lambda |   .1039215   .2065806     0.50   0.615    -.3010579    .5089009
          Dlexc |   8.283936   2.796843     2.96   0.003     2.801022    13.76685
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):           7.948
                                                   Chi-sq(3) P-val =    0.0471
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                1.868
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           1.662
                                                   Chi-sq(2) P-val =    0.4356
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |       354           0         354     |
-----------------------------------------------------+

. outreg using output/temp/FigP1_B_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Wood") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

                                         --------------------------------------------------------------------
                                                                A&M         Food      Text&L&F      Wood    
                                         --------------------------------------------------------------------
                                          Dlprice              -8.202      -2.066      -3.576      -3.716   
                                                             (2.857)***  (0.514)***  (0.227)***  (1.509)**  
                                          Dln_cond_lambda      0.127       0.092       0.250       0.104    
                                                              (0.148)    (0.038)**   (0.018)***   (0.207)   
                                          Dlexc                9.200       4.272       5.595       8.284    
                                                             (2.708)***  (0.529)***  (0.296)***  (2.797)*** 
                                          N Obs.               11,568      19,615     125,120      5,872    
                                          Weak Ident Test       4.67       15.22       131.95       1.87    
                                          UnderIdent P-val      0.00        0.00        0.00        0.05    
                                          N Prod-Year grs.       .           .           .           .      
                                         --------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=2000 & isic<2100;
(6,031 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2000 & isic<2100;
(6,031 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2000 & isic<2100;
(6,031 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=2000 & isic<2100;
(6,031 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2000 & isic<2100;
(6,031 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>                 + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2000 & isic<2100;
(6,031 real changes made)

.         replace id=4 if isic>=2000 & isic<2100;
(6,031 real changes made)

. ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =  Z1 Dln_nfirms Dln_nproducts Dltax) Dlexc
>         if isic>=2100 & isic<2300, a(fe1) ;
(dropped 104 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =    37376
                                                      F(  3, 36392) =    30.00
                                                      Prob > F      =   0.0000
Total (centered) SS     =   3042698081                Centered R2   =  -0.6031
Total (uncentered) SS   =   3042698081                Uncentered R2 =  -0.6031
Residual SS             =   4877701294                Root MSE      =    366.1

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -1.918971   .7079627    -2.71   0.007    -3.306599   -.5313436
Dln_cond_lambda |   .1497455   .0469284     3.19   0.001     .0577645    .2417264
          Dlexc |   3.579185   .6863609     5.21   0.000     2.233898    4.924472
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          20.206
                                                   Chi-sq(3) P-val =    0.0002
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                4.921
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):          91.118
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z1 Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |       981           0         981     |
-----------------------------------------------------+

.   outreg using output/temp/FigP1_B_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Paper") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

                                   --------------------------------------------------------------------------------
                                                          A&M         Food      Text&L&F      Wood       Paper    
                                   --------------------------------------------------------------------------------
                                    Dlprice              -8.202      -2.066      -3.576      -3.716      -1.919   
                                                       (2.857)***  (0.514)***  (0.227)***  (1.509)**   (0.708)*** 
                                    Dln_cond_lambda      0.127       0.092       0.250       0.104       0.150    
                                                        (0.148)    (0.038)**   (0.018)***   (0.207)    (0.047)*** 
                                    Dlexc                9.200       4.272       5.595       8.284       3.579    
                                                       (2.708)***  (0.529)***  (0.296)***  (2.797)***  (0.686)*** 
                                    N Obs.               11,568      19,615     125,120      5,872       37,376   
                                    Weak Ident Test       4.67       15.22       131.95       1.87        4.92    
                                    UnderIdent P-val      0.00        0.00        0.00        0.05        0.00    
                                    N Prod-Year grs.       .           .           .           .           .      
                                   --------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=2100 & isic<2300;
(38,560 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2100 & isic<2300;
(38,560 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2100 & isic<2300;
(38,560 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=2100 & isic<2300;
(38,560 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2100 & isic<2300;
(38,560 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>                 + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2100 & isic<2300;
(38,560 real changes made)

.         replace id=5 if isic>=2100 & isic<2300;
(38,560 real changes made)

. ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =  Z Dln_nfirms Dln_nproducts Dltariff) 
>  if isic>=2300 & isic<2400, a(fe1) ;
(dropped 35 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     3973
                                                      F(  2,  3792) =     5.31
                                                      Prob > F      =   0.0050
Total (centered) SS     =  192068381.9                Centered R2   =  -0.1189
Total (uncentered) SS   =  192068381.9                Uncentered R2 =  -0.1189
Residual SS             =  214897976.7                Root MSE      =    238.1

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -.6359383   .3554943    -1.79   0.074    -1.332917    .0610401
Dln_cond_lambda |   .2239976   .0843209     2.66   0.008     .0586789    .3893163
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          10.957
                                                   Chi-sq(3) P-val =    0.0120
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                2.620
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           7.819
                                                   Chi-sq(2) P-val =    0.0201
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltariff
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |       179           0         179     |
-----------------------------------------------------+

.   outreg using output/temp/FigP1_B_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Petr") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

                             --------------------------------------------------------------------------------------------
                                                    A&M         Food      Text&L&F      Wood       Paper        Petr    
                             --------------------------------------------------------------------------------------------
                              Dlprice              -8.202      -2.066      -3.576      -3.716      -1.919      -0.636   
                                                 (2.857)***  (0.514)***  (0.227)***  (1.509)**   (0.708)***   (0.355)*  
                              Dln_cond_lambda      0.127       0.092       0.250       0.104       0.150       0.224    
                                                  (0.148)    (0.038)**   (0.018)***   (0.207)    (0.047)***  (0.084)*** 
                              Dlexc                9.200       4.272       5.595       8.284       3.579                
                                                 (2.708)***  (0.529)***  (0.296)***  (2.797)***  (0.686)***             
                              N Obs.               11,568      19,615     125,120      5,872       37,376      3,973    
                              Weak Ident Test       4.67       15.22       131.95       1.87        4.92        2.62    
                              UnderIdent P-val      0.00        0.00        0.00        0.05        0.00        0.01    
                              N Prod-Year grs.       .           .           .           .           .           .      
                             --------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]   if isic>=2300 & isic<2400;
(4,089 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2300 & isic<2400;
(4,089 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2300 & isic<2400;
(4,089 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=2300 & isic<2400;
(4,089 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2300 & isic<2400;
(4,089 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2
>                 + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2300 & isic<2400;
(4,089 real changes made)

.         replace id=6 if isic>=2300 & isic<2400;
(4,089 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =  Z Dln_nfirms Dln_nproducts Dlvat) Dlexc
>         if isic>=2400 & isic<2500, a(fe1) ;
(dropped 802 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =   133142
                                                      F(  3,126425) =   154.94
                                                      Prob > F      =   0.0000
Total (centered) SS     =   6414885871                Centered R2   =  -1.7073
Total (uncentered) SS   =   6414885871                Uncentered R2 =  -1.7073
Residual SS             =  1.73668e+10                Root MSE      =    370.6

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -3.824024    .280513   -13.63   0.000    -4.373825   -3.274223
Dln_cond_lambda |   .0831293    .022726     3.66   0.000     .0385868    .1276719
          Dlexc |   5.855809   .3107761    18.84   0.000     5.246693    6.464925
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         299.791
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               71.326
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):         117.486
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z Dln_nfirms Dln_nproducts Dlvat
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      6714           0        6714     |
-----------------------------------------------------+

. outreg using output/temp/FigP1_B_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Chem") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

                       --------------------------------------------------------------------------------------------------------
                                              A&M         Food      Text&L&F      Wood       Paper        Petr        Chem    
                       --------------------------------------------------------------------------------------------------------
                        Dlprice              -8.202      -2.066      -3.576      -3.716      -1.919      -0.636      -3.824   
                                           (2.857)***  (0.514)***  (0.227)***  (1.509)**   (0.708)***   (0.355)*   (0.281)*** 
                        Dln_cond_lambda      0.127       0.092       0.250       0.104       0.150       0.224       0.083    
                                            (0.148)    (0.038)**   (0.018)***   (0.207)    (0.047)***  (0.084)***  (0.023)*** 
                        Dlexc                9.200       4.272       5.595       8.284       3.579                   5.856    
                                           (2.708)***  (0.529)***  (0.296)***  (2.797)***  (0.686)***              (0.311)*** 
                        N Obs.               11,568      19,615     125,120      5,872       37,376      3,973      133,142   
                        Weak Ident Test       4.67       15.22       131.95       1.87        4.92        2.62       71.33    
                        UnderIdent P-val      0.00        0.00        0.00        0.05        0.00        0.01        0.00    
                        N Prod-Year grs.       .           .           .           .           .           .           .      
                       --------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=2400 & isic<2500;
(136,470 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2400 & isic<2500;
(136,470 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2400 & isic<2500;
(136,470 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=2400 & isic<2500;
(136,470 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2400 & isic<2500;
(136,470 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>                 + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2400 & isic<2500;
(136,470 real changes made)

.         replace id=7 if isic>=2400 & isic<2500;
(136,470 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =  Z Dln_nfirms Dln_nproducts Dlvat) Dlexc
>         if isic>=2500 & isic<2600, a(fe1);
(dropped 25 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =   106398
                                                      F(  3,105280) =    56.12
                                                      Prob > F      =   0.0000
Total (centered) SS     =   8066237763                Centered R2   =  -4.8630
Total (uncentered) SS   =   8066237763                Uncentered R2 =  -4.8630
Residual SS             =  4.72928e+10                Root MSE      =    670.2

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -5.174153   .9516623    -5.44   0.000    -7.039398   -3.308908
Dln_cond_lambda |   .2785809   .0584656     4.76   0.000     .1639891    .3931727
          Dlexc |   6.193444    .952114     6.50   0.000     4.327314    8.059575
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          36.291
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                8.980
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):         105.366
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z Dln_nfirms Dln_nproducts Dlvat
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      1115           0        1115     |
-----------------------------------------------------+

.  outreg using output/temp/FigP1_B_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Rub&Plas") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

                 --------------------------------------------------------------------------------------------------------------------
                                        A&M         Food      Text&L&F      Wood       Paper        Petr        Chem      Rub&Plas  
                 --------------------------------------------------------------------------------------------------------------------
                  Dlprice              -8.202      -2.066      -3.576      -3.716      -1.919      -0.636      -3.824      -5.174   
                                     (2.857)***  (0.514)***  (0.227)***  (1.509)**   (0.708)***   (0.355)*   (0.281)***  (0.952)*** 
                  Dln_cond_lambda      0.127       0.092       0.250       0.104       0.150       0.224       0.083       0.279    
                                      (0.148)    (0.038)**   (0.018)***   (0.207)    (0.047)***  (0.084)***  (0.023)***  (0.058)*** 
                  Dlexc                9.200       4.272       5.595       8.284       3.579                   5.856       6.193    
                                     (2.708)***  (0.529)***  (0.296)***  (2.797)***  (0.686)***              (0.311)***  (0.952)*** 
                  N Obs.               11,568      19,615     125,120      5,872       37,376      3,973      133,142     106,398   
                  Weak Ident Test       4.67       15.22       131.95       1.87        4.92        2.62       71.33        8.98    
                  UnderIdent P-val      0.00        0.00        0.00        0.05        0.00        0.01        0.00        0.00    
                  N Prod-Year grs.       .           .           .           .           .           .           .           .      
                 --------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=2500 & isic<2600;
(110,022 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2500 & isic<2600;
(110,022 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2500 & isic<2600;
(110,022 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=2500 & isic<2600;
(110,022 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2500 & isic<2600;
(110,022 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>                 + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2500 & isic<2600;
(110,022 real changes made)

.         replace id=8 if isic>=2500 & isic<2600;
(110,022 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =  Z Dln_nfirms Dln_nproducts Dlvat) Dlexc
>         if isic>=2600 & isic<2700, a(fe1);
(dropped 88 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =    27952
                                                      F(  3, 27070) =    13.60
                                                      Prob > F      =   0.0000
Total (centered) SS     =   1904786727                Centered R2   =  -3.8231
Total (uncentered) SS   =   1904786727                Uncentered R2 =  -3.8231
Residual SS             =   9186911343                Root MSE      =    582.6

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -4.786589   1.253308    -3.82   0.000    -7.243137    -2.33004
Dln_cond_lambda |    .121747   .0910207     1.34   0.181    -.0566583    .3001522
          Dlexc |   6.121575   1.329772     4.60   0.000     3.515153    8.727997
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          19.577
                                                   Chi-sq(3) P-val =    0.0002
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                4.743
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):          32.208
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z Dln_nfirms Dln_nproducts Dlvat
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |       879           0         879     |
-----------------------------------------------------+

.  outreg using output/temp/FigP1_B_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Miner") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

           --------------------------------------------------------------------------------------------------------------------------------
                                  A&M         Food      Text&L&F      Wood       Paper        Petr        Chem      Rub&Plas     Miner    
           --------------------------------------------------------------------------------------------------------------------------------
            Dlprice              -8.202      -2.066      -3.576      -3.716      -1.919      -0.636      -3.824      -5.174      -4.787   
                               (2.857)***  (0.514)***  (0.227)***  (1.509)**   (0.708)***   (0.355)*   (0.281)***  (0.952)***  (1.253)*** 
            Dln_cond_lambda      0.127       0.092       0.250       0.104       0.150       0.224       0.083       0.279       0.122    
                                (0.148)    (0.038)**   (0.018)***   (0.207)    (0.047)***  (0.084)***  (0.023)***  (0.058)***   (0.091)   
            Dlexc                9.200       4.272       5.595       8.284       3.579                   5.856       6.193       6.122    
                               (2.708)***  (0.529)***  (0.296)***  (2.797)***  (0.686)***              (0.311)***  (0.952)***  (1.330)*** 
            N Obs.               11,568      19,615     125,120      5,872       37,376      3,973      133,142     106,398      27,952   
            Weak Ident Test       4.67       15.22       131.95       1.87        4.92        2.62       71.33        8.98        4.74    
            UnderIdent P-val      0.00        0.00        0.00        0.05        0.00        0.01        0.00        0.00        0.00    
            N Prod-Year grs.       .           .           .           .           .           .           .           .           .      
           --------------------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=2600 & isic<2700;
(28,616 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2600 & isic<2700;
(28,616 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2600 & isic<2700;
(28,616 real changes made)

.         replace a_se = _se[Dln_cond_lambda]  if isic>=2600 & isic<2700;
(28,616 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2600 & isic<2700;
(28,616 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>         + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2600 & isic<2700;
(28,616 real changes made)

.         replace id=9 if isic>=2600 & isic<2700;
(28,616 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =  Z Dln_nfirms Dln_nproducts Dlvat) Dlexc
>         if isic>=2700 & isic<2900, a(fe1);
(dropped 420 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =   153102
                                                      F(  3,149918) =   197.02
                                                      Prob > F      =   0.0000
Total (centered) SS     =  1.26333e+10                Centered R2   =  -1.3828
Total (uncentered) SS   =  1.26333e+10                Uncentered R2 =  -1.3828
Residual SS             =  3.01030e+10                Root MSE      =    448.1

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -3.449848   .4240486    -8.14   0.000    -4.280974   -2.618721
Dln_cond_lambda |   .3564307   .0260227    13.70   0.000     .3054268    .4074345
          Dlexc |   4.805874   .4500765    10.68   0.000     3.923733    5.688015
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          96.083
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               23.536
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):         467.862
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z Dln_nfirms Dln_nproducts Dlvat
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      3181           0        3181     |
-----------------------------------------------------+

.   outreg using output/temp/FigP1_B_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "BasFaM") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

     --------------------------------------------------------------------------------------------------------------------------------------------
                            A&M         Food      Text&L&F      Wood       Paper        Petr        Chem      Rub&Plas     Miner       BasFaM   
     --------------------------------------------------------------------------------------------------------------------------------------------
      Dlprice              -8.202      -2.066      -3.576      -3.716      -1.919      -0.636      -3.824      -5.174      -4.787      -3.450   
                         (2.857)***  (0.514)***  (0.227)***  (1.509)**   (0.708)***   (0.355)*   (0.281)***  (0.952)***  (1.253)***  (0.424)*** 
      Dln_cond_lambda      0.127       0.092       0.250       0.104       0.150       0.224       0.083       0.279       0.122       0.356    
                          (0.148)    (0.038)**   (0.018)***   (0.207)    (0.047)***  (0.084)***  (0.023)***  (0.058)***   (0.091)    (0.026)*** 
      Dlexc                9.200       4.272       5.595       8.284       3.579                   5.856       6.193       6.122       4.806    
                         (2.708)***  (0.529)***  (0.296)***  (2.797)***  (0.686)***              (0.311)***  (0.952)***  (1.330)***  (0.450)*** 
      N Obs.               11,568      19,615     125,120      5,872       37,376      3,973      133,142     106,398      27,952     153,102   
      Weak Ident Test       4.67       15.22       131.95       1.87        4.92        2.62       71.33        8.98        4.74       23.54    
      UnderIdent P-val      0.00        0.00        0.00        0.05        0.00        0.01        0.00        0.00        0.00        0.00    
      N Prod-Year grs.       .           .           .           .           .           .           .           .           .           .      
     --------------------------------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=2700 & isic<2900;
(157,679 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2700 & isic<2900;
(157,679 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2700 & isic<2900;
(157,679 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=2700 & isic<2900;
(157,679 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2700 & isic<2900;
(157,679 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>         + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2700 & isic<2900;
(157,679 real changes made)

.         replace id=10 if isic>=2700 & isic<2900;
(157,679 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =   Z Dln_nfirms Dln_nproducts Dltax) 
>         if isic>=2900 & isic<3100, a(fe1)       ;
(dropped 446 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =   263797
                                                      F(  2,259813) =    66.18
                                                      Prob > F      =   0.0000
Total (centered) SS     =  1.91335e+10                Centered R2   = -13.9813
Total (uncentered) SS   =  1.91335e+10                Uncentered R2 = -13.9813
Residual SS             =  2.86644e+11                Root MSE      =     1050

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -7.750403   .9343468    -8.29   0.000    -9.581698   -5.919109
Dln_cond_lambda |   .0733278   .0594402     1.23   0.217    -.0431733    .1898289
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          84.285
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               20.759
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):          73.456
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      3982           0        3982     |
-----------------------------------------------------+

.  outreg using output/temp/FigP1_B_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Mach") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

     --------------------------------------------------------------------------------------------------------------------------------------------
                            A&M         Food      Text&L&F      Wood       Paper        Petr        Chem      Rub&Plas     Miner       BasFaM   
     --------------------------------------------------------------------------------------------------------------------------------------------
      Dlprice              -8.202      -2.066      -3.576      -3.716      -1.919      -0.636      -3.824      -5.174      -4.787      -3.450   
                         (2.857)***  (0.514)***  (0.227)***  (1.509)**   (0.708)***   (0.355)*   (0.281)***  (0.952)***  (1.253)***  (0.424)*** 
      Dln_cond_lambda      0.127       0.092       0.250       0.104       0.150       0.224       0.083       0.279       0.122       0.356    
                          (0.148)    (0.038)**   (0.018)***   (0.207)    (0.047)***  (0.084)***  (0.023)***  (0.058)***   (0.091)    (0.026)*** 
      Dlexc                9.200       4.272       5.595       8.284       3.579                   5.856       6.193       6.122       4.806    
                         (2.708)***  (0.529)***  (0.296)***  (2.797)***  (0.686)***              (0.311)***  (0.952)***  (1.330)***  (0.450)*** 
      N Obs.               11,568      19,615     125,120      5,872       37,376      3,973      133,142     106,398      27,952     153,102   
      Weak Ident Test       4.67       15.22       131.95       1.87        4.92        2.62       71.33        8.98        4.74       23.54    
      UnderIdent P-val      0.00        0.00        0.00        0.05        0.00        0.01        0.00        0.00        0.00        0.00    
      N Prod-Year grs.       .           .           .           .           .           .           .           .           .           .      
     --------------------------------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


                                                           --------------------------------
                                                                                  Mach    
                                                           --------------------------------
                                                            Dlprice              -7.750   
                                                                               (0.934)*** 
                                                            Dln_cond_lambda      0.073    
                                                                                (0.059)   
                                                            Dlexc                         
                                                                                          
                                                            N Obs.              263,797   
                                                            Weak Ident Test      20.76    
                                                            UnderIdent P-val      0.00    
                                                            N Prod-Year grs.       .      
                                                           --------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=2900 & isic<3100;
(272,102 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2900 & isic<3100;
(272,102 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2900 & isic<3100;
(272,102 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=2900 & isic<3100;
(272,102 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2900 & isic<3100;
(272,102 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>         + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2900 & isic<3100;
(272,102 real changes made)

.         replace id=11 if isic>=2900 & isic<3100;
(272,102 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =   Z Dln_nfirms Dln_nproducts Dltax) Dlexc
>         if isic>=3100 & isic<3400, a(fe1) ;
(dropped 230 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =   257775
                                                      F(  3,254409) =   531.28
                                                      Prob > F      =   0.0000
Total (centered) SS     =  1.94412e+10                Centered R2   =  -0.0738
Total (uncentered) SS   =  1.94412e+10                Uncentered R2 =  -0.0738
Residual SS             =  2.08754e+10                Root MSE      =    286.5

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -1.297155   .1386236    -9.36   0.000    -1.568853   -1.025456
Dln_cond_lambda |   .3168788    .012374    25.61   0.000     .2926261    .3411315
          Dlexc |   2.989134   .1646826    18.15   0.000     2.666361    3.311908
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         344.193
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               85.037
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):        1739.817
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      3363           0        3363     |
-----------------------------------------------------+

. outreg using output/temp/FigP1_B_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Elec") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

     --------------------------------------------------------------------------------------------------------------------------------------------
                            A&M         Food      Text&L&F      Wood       Paper        Petr        Chem      Rub&Plas     Miner       BasFaM   
     --------------------------------------------------------------------------------------------------------------------------------------------
      Dlprice              -8.202      -2.066      -3.576      -3.716      -1.919      -0.636      -3.824      -5.174      -4.787      -3.450   
                         (2.857)***  (0.514)***  (0.227)***  (1.509)**   (0.708)***   (0.355)*   (0.281)***  (0.952)***  (1.253)***  (0.424)*** 
      Dln_cond_lambda      0.127       0.092       0.250       0.104       0.150       0.224       0.083       0.279       0.122       0.356    
                          (0.148)    (0.038)**   (0.018)***   (0.207)    (0.047)***  (0.084)***  (0.023)***  (0.058)***   (0.091)    (0.026)*** 
      Dlexc                9.200       4.272       5.595       8.284       3.579                   5.856       6.193       6.122       4.806    
                         (2.708)***  (0.529)***  (0.296)***  (2.797)***  (0.686)***              (0.311)***  (0.952)***  (1.330)***  (0.450)*** 
      N Obs.               11,568      19,615     125,120      5,872       37,376      3,973      133,142     106,398      27,952     153,102   
      Weak Ident Test       4.67       15.22       131.95       1.87        4.92        2.62       71.33        8.98        4.74       23.54    
      UnderIdent P-val      0.00        0.00        0.00        0.05        0.00        0.01        0.00        0.00        0.00        0.00    
      N Prod-Year grs.       .           .           .           .           .           .           .           .           .           .      
     --------------------------------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


                                                     --------------------------------------------
                                                                            Mach        Elec    
                                                     --------------------------------------------
                                                      Dlprice              -7.750      -1.297   
                                                                         (0.934)***  (0.139)*** 
                                                      Dln_cond_lambda      0.073       0.317    
                                                                          (0.059)    (0.012)*** 
                                                      Dlexc                            2.989    
                                                                                     (0.165)*** 
                                                      N Obs.              263,797     257,775   
                                                      Weak Ident Test      20.76       85.04    
                                                      UnderIdent P-val      0.00        0.00    
                                                      N Prod-Year grs.       .           .      
                                                     --------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=3100 & isic<3400;
(265,219 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=3100 & isic<3400;
(265,219 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=3100 & isic<3400;
(265,219 real changes made)

.         replace a_se = _se[Dln_cond_lambda]  if isic>=3100 & isic<3400;
(265,219 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=3100 & isic<3400;
(265,219 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>         + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=3100 & isic<3400;
(265,219 real changes made)

.         replace id=12 if isic>=3100 & isic<3400;
(265,219 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =   Z Dln_nfirms Dln_nproducts Dltariff) Dlexc
>         if isic>=3400 & isic<3600, a(fe1) ;
(dropped 86 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =    85920
                                                      F(  3, 84881) =   274.87
                                                      Prob > F      =   0.0000
Total (centered) SS     =   5842560767                Centered R2   =  -0.7335
Total (uncentered) SS   =   5842560767                Uncentered R2 =  -0.7335
Residual SS             =  1.01281e+10                Root MSE      =    345.4

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -2.598137   .4713889    -5.51   0.000    -3.522055   -1.674219
Dln_cond_lambda |   .6265106   .0259672    24.13   0.000      .575615    .6774061
          Dlexc |   4.209664   .5806632     7.25   0.000     3.071569    5.347759
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          48.559
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               12.000
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):         418.336
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltariff
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      1036           0        1036     |
-----------------------------------------------------+

. outreg using output/temp/FigP1_B_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Trnsp") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

     --------------------------------------------------------------------------------------------------------------------------------------------
                            A&M         Food      Text&L&F      Wood       Paper        Petr        Chem      Rub&Plas     Miner       BasFaM   
     --------------------------------------------------------------------------------------------------------------------------------------------
      Dlprice              -8.202      -2.066      -3.576      -3.716      -1.919      -0.636      -3.824      -5.174      -4.787      -3.450   
                         (2.857)***  (0.514)***  (0.227)***  (1.509)**   (0.708)***   (0.355)*   (0.281)***  (0.952)***  (1.253)***  (0.424)*** 
      Dln_cond_lambda      0.127       0.092       0.250       0.104       0.150       0.224       0.083       0.279       0.122       0.356    
                          (0.148)    (0.038)**   (0.018)***   (0.207)    (0.047)***  (0.084)***  (0.023)***  (0.058)***   (0.091)    (0.026)*** 
      Dlexc                9.200       4.272       5.595       8.284       3.579                   5.856       6.193       6.122       4.806    
                         (2.708)***  (0.529)***  (0.296)***  (2.797)***  (0.686)***              (0.311)***  (0.952)***  (1.330)***  (0.450)*** 
      N Obs.               11,568      19,615     125,120      5,872       37,376      3,973      133,142     106,398      27,952     153,102   
      Weak Ident Test       4.67       15.22       131.95       1.87        4.92        2.62       71.33        8.98        4.74       23.54    
      UnderIdent P-val      0.00        0.00        0.00        0.05        0.00        0.01        0.00        0.00        0.00        0.00    
      N Prod-Year grs.       .           .           .           .           .           .           .           .           .           .      
     --------------------------------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


                                               --------------------------------------------------------
                                                                      Mach        Elec       Trnsp    
                                               --------------------------------------------------------
                                                Dlprice              -7.750      -1.297      -2.598   
                                                                   (0.934)***  (0.139)***  (0.471)*** 
                                                Dln_cond_lambda      0.073       0.317       0.627    
                                                                    (0.059)    (0.012)***  (0.026)*** 
                                                Dlexc                            2.989       4.210    
                                                                               (0.165)***  (0.581)*** 
                                                N Obs.              263,797     257,775      85,920   
                                                Weak Ident Test      20.76       85.04       12.00    
                                                UnderIdent P-val      0.00        0.00        0.00    
                                                N Prod-Year grs.       .           .           .      
                                               --------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=3400 & isic<3600;
(88,729 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=3400 & isic<3600;
(88,729 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=3400 & isic<3600;
(88,729 real changes made)

.         replace a_se = _se[Dln_cond_lambda]  if isic>=3400 & isic<3600;
(88,729 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=3400 & isic<3600;
(88,729 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 + 
>         (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=3400 & isic<3600;
(88,729 real changes made)

.         replace id=13  if isic>=3400 & isic<3600;
(88,729 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =   Z Dln_nfirms Dln_nproducts Dltax) Dlexc
>         if isic>=3600 & isic<3800, a(fe1)       ;
(dropped 112 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =    70264
                                                      F(  3, 68982) =    31.28
                                                      Prob > F      =   0.0000
Total (centered) SS     =   5288598014                Centered R2   =  -7.9641
Total (uncentered) SS   =   5288598014                Uncentered R2 =  -7.9641
Residual SS             =  4.74077e+10                Root MSE      =      829

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -6.388441   .9732383    -6.56   0.000    -8.295987   -4.480896
Dln_cond_lambda |   .0439983   .0938774     0.47   0.639    -.1400012    .2279979
          Dlexc |   8.402729   1.162386     7.23   0.000     6.124454      10.681
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          52.019
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               12.777
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):          13.216
                                                   Chi-sq(2) P-val =    0.0013
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      1279           0        1279     |
-----------------------------------------------------+

. outreg using output/temp/FigP1_B_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "MnfR") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

     --------------------------------------------------------------------------------------------------------------------------------------------
                            A&M         Food      Text&L&F      Wood       Paper        Petr        Chem      Rub&Plas     Miner       BasFaM   
     --------------------------------------------------------------------------------------------------------------------------------------------
      Dlprice              -8.202      -2.066      -3.576      -3.716      -1.919      -0.636      -3.824      -5.174      -4.787      -3.450   
                         (2.857)***  (0.514)***  (0.227)***  (1.509)**   (0.708)***   (0.355)*   (0.281)***  (0.952)***  (1.253)***  (0.424)*** 
      Dln_cond_lambda      0.127       0.092       0.250       0.104       0.150       0.224       0.083       0.279       0.122       0.356    
                          (0.148)    (0.038)**   (0.018)***   (0.207)    (0.047)***  (0.084)***  (0.023)***  (0.058)***   (0.091)    (0.026)*** 
      Dlexc                9.200       4.272       5.595       8.284       3.579                   5.856       6.193       6.122       4.806    
                         (2.708)***  (0.529)***  (0.296)***  (2.797)***  (0.686)***              (0.311)***  (0.952)***  (1.330)***  (0.450)*** 
      N Obs.               11,568      19,615     125,120      5,872       37,376      3,973      133,142     106,398      27,952     153,102   
      Weak Ident Test       4.67       15.22       131.95       1.87        4.92        2.62       71.33        8.98        4.74       23.54    
      UnderIdent P-val      0.00        0.00        0.00        0.05        0.00        0.01        0.00        0.00        0.00        0.00    
      N Prod-Year grs.       .           .           .           .           .           .           .           .           .           .      
     --------------------------------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


                                         --------------------------------------------------------------------
                                                                Mach        Elec       Trnsp        MnfR    
                                         --------------------------------------------------------------------
                                          Dlprice              -7.750      -1.297      -2.598      -6.388   
                                                             (0.934)***  (0.139)***  (0.471)***  (0.973)*** 
                                          Dln_cond_lambda      0.073       0.317       0.627       0.044    
                                                              (0.059)    (0.012)***  (0.026)***   (0.094)   
                                          Dlexc                            2.989       4.210       8.403    
                                                                         (0.165)***  (0.581)***  (1.162)*** 
                                          N Obs.              263,797     257,775      85,920      70,264   
                                          Weak Ident Test      20.76       85.04       12.00       12.78    
                                          UnderIdent P-val      0.00        0.00        0.00        0.00    
                                          N Prod-Year grs.       .           .           .           .      
                                         --------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=3600 & isic<3800;
(72,006 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=3600 & isic<3800;
(72,006 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda]) if isic>=3600 & isic<3800;
(72,006 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=3600 & isic<3800;
(72,006 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=3600 & isic<3800;
(72,006 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>         + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=3600 & isic<3800;
(72,006 real changes made)

.         replace id=14 if isic>=3600 & isic<3800;
(72,006 real changes made)

.         collapse  theta psi, by(id);

. save data/internally_generated/figP1_exc_rate_control.dta, replace ;
file data/internally_generated/figP1_exc_rate_control.dta saved

. 
end of do-file
. do code/data_prep/6-robustness_check_3 // control for exchange rate

. clear

. **************************************************************/
. 
. use "data/exchange_rate_report_boc/exchange_rate_report.dta", clear

. collapse (mean) xrate_usd xrate_col,by( month year country )

. 
. 
. gen CountryofOrigin=strupper(country)

. sort CountryofOrigin

. collapse (mean) xrate_usd xrate_col , by(month year CountryofOrigin)

. 
. egen id=group(CountryofOrigin)

. gen date=ym(year, month)

. tsset id date

Panel variable: id (strongly balanced)
 Time variable: date, 564 to 660
         Delta: 1 unit

. 
. *gen Flxrate_col = log(F12.xrate_col) - log(F11.xrate_col)
. *gen Flxrate_usd = log(F12.xrate_usd) - log(F11.xrate_usd)
. 
. local n_lag=7

. 
. ******************************************
. forvalues y=1/`n_lag'  {
  2. local x2 = 12*`y'
  3. local x1 = 12*(`y' - 1 ) 
  4. gen exc_col_F`y' = 100*(log(F`x2'.xrate_col) - log(F`x1'.xrate_col))
  5. gen exc_usd_F`y' = 100*(log(F`x2'.xrate_usd) - log(F`x1'.xrate_usd))
  6. }
(920 missing values generated)
(920 missing values generated)
(1,824 missing values generated)
(1,824 missing values generated)
(2,736 missing values generated)
(2,736 missing values generated)
(3,648 missing values generated)
(3,648 missing values generated)
(4,560 missing values generated)
(4,560 missing values generated)
(5,472 missing values generated)
(5,472 missing values generated)
(6,384 missing values generated)
(6,384 missing values generated)

. drop id

. 
. merge 1:m CountryofOrigin year month using "data/temp/colombia_imports_updated_hs.dta"
(variable CountryofOrigin was str24, now str50 to accommodate using data's values)
(variable year was int, now float to accommodate using data's values)
(variable month was byte, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                       272,394
        from master                     1,580  (_merge==1)
        from using                    270,814  (_merge==2)

    Matched                        17,003,919  (_merge==3)
    -----------------------------------------

. *merge 1:m CountryofOrigin year month using Colombiaimports_HS10_collapsed
. 
. destring  VATPercent TariffPercent ExchangeRate, replace
VATPercent: all characters numeric; replaced as double
(1580 missing values generated)
TariffPercent: all characters numeric; replaced as double
(1580 missing values generated)
ExchangeRate: all characters numeric; replaced as double
(1580 missing values generated)

. drop if CustomsValueTariffBase<0
(1 observation deleted)

. 
. collapse (sum) CustomsValueTariffBase Valuetobepay Quantity (mean) VATPercent TariffPercent exc_col_F* exc_usd_F* ExchangeRate [fw=CustomsValueTarif
> fBase], by(year ProductHS CountryofOrigin Provider)

. ***************************************
. 
. egen id = group(ProductHS CountryofOrigin Provider)
(13 missing values generated)

. drop if missing(id)
(13 observations deleted)

. tsset id year

Panel variable: id (unbalanced)
 Time variable: year, 2007 to 2013, but with gaps
         Delta: 1 unit

. 
. generate Dexc_col = cond(!missing(L.exc_col_F1) ,  L.exc_col_F1, ///
>                     cond(!missing(L2.exc_col_F2) , L2.exc_col_F2, ///
>                                 cond(!missing(L3.exc_col_F3) , L3.exc_col_F3, ///
>                                     cond(!missing(L4.exc_col_F4) , L4.exc_col_F4, ///
>                                     cond(!missing(L5.exc_col_F5) , L5.exc_col_F5, ///
>                                         cond(!missing(L6.exc_col_F6) , L6.exc_col_F6, ///
>                                     cond(!missing(L7.exc_col_F7) , L7.exc_col_F7, ///
>                                                                                 . )))))))
(2,210,182 missing values generated)

.                                                                                 
. generate Dexc_usd = cond(!missing(L.exc_usd_F1) ,  L.exc_usd_F1, ///
>                     cond(!missing(L2.exc_usd_F2) , L2.exc_usd_F2, ///
>                                     cond(!missing(L3.exc_usd_F3) , L3.exc_usd_F3, ///
>                                     cond(!missing(L4.exc_usd_F4) , L4.exc_usd_F4, ///
>                                     cond(!missing(L5.exc_usd_F5) , L4.exc_usd_F5, ///
>                                         cond(!missing(L6.exc_usd_F6) , L5.exc_usd_F6, ///
>                                         cond(!missing(L7.exc_usd_F7) , L6.exc_usd_F7, ///
>                                                                         . )))))))
(2,227,024 missing values generated)

. 
. ****************************************
. ** Save Data -- Firm Level
. ****************************************
. gen x_whi = CustomsValueTariffBase + Valuetobepay

. 
. ****************************************
. ** Construct Within-National Shares
. ****************************************
. bysort year ProductHS CountryofOrigin : egen x_hi=total(x_whi)

. 
. gen ln_cond_lambda = log(x_whi/x_hi)

. *****************************************
. 
. gen price=x_whi/Quantity
(14 missing values generated)

. gen lprice=log(price)
(14 missing values generated)

. gen lvat=log(1+0.01*VATPercent)

. gen ltariff=log(1+0.01*TariffPercent)

. *gen ltariff=log(1+TariffPercent)
. *gen lvat=log(1+VATPercent)
. gen ltax = lvat + ltariff

. gen lexc = log(ExchangeRate)

. 
. gen ln_x_wih = log(x_whi)

. gen ln_q_wih = log(Quantity)
(14 missing values generated)

. 
. *gen lexc_col = log(exc_col)
. *gen lexc_usd = log(exc_usd)
. 
. gen hs8=substr(ProductHS,1,8)

. destring hs8, replace
hs8: all characters numeric; replaced as long

. *gen mnf=(hs2>=30 & hs2<=38) | (hs2>=42 & hs2<=97)
. 
. egen panelvar = group(ProductHS CountryofOrigin Provider)

. drop if missing(panelvar)
(0 observations deleted)

. 
. *******************************************************
. ** Contructing Khandelwal IVs for Within-National Share
. ********************************************************
. 
. * number of firms exporting from country i in product h
. bysort year CountryofOrigin ProductHS: gen ln_nfirms=log(_N)

. 
. * number of products firm w exports in
. bysort year CountryofOrigin Provider: gen ln_nproducts=log(_N)

. 
. tsset id year

Panel variable: id (unbalanced)
 Time variable: year, 2007 to 2013, but with gaps
         Delta: 1 unit

. gen ltariff_lag = L.ltariff
(2,460,852 missing values generated)

. gen ltax_lag = L.ltax
(2,460,852 missing values generated)

. ********************************************************
. 
. xtset panelvar year

Panel variable: panelvar (unbalanced)
 Time variable: year, 2007 to 2013, but with gaps
         Delta: 1 unit

. foreach var in lprice ln_x_wih ltax ltariff lvat ln_cond_lambda ln_nfirms ln_nproducts lexc {
  2.         gen D`var'=100*D.`var'
  3.         }
(2,460,854 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)
(2,460,852 missing values generated)

.         
.         keep if Dln_x_wih!=.
(2,460,852 observations deleted)

.         
. egen fe1=group(ProductHS year)

. gen fe2=panelvar

. 
. 
. *drop if Quantity<=1
. *drop if FOBValueUS<500
. 
. gen hs2=substr(ProductHS,1,2)

. bysort year hs2 CountryofOrigin : egen x_i=total(x_whi)

. bysort year hs2 Provider : egen x_w=total(x_whi)

. drop if x_w/x_i>0.1
(133,215 observations deleted)

. 
. 
. keep Dln_x_wih Dln_cond_lambda Dlprice Dexc_col Dexc_usd Dlvat Dltariff Dltax fe1 fe2 ProductHS Dln_nfirms Dln_nproducts ///
> ln_x_wih ln_cond_lambda lprice ltariff lvat ltax ln_nfirms ln_nproducts ltariff_lag ltax_lag year Dlexc

. 
. *****************************************
. gen theta=.
(1,213,021 missing values generated)

. gen theta_se=.
(1,213,021 missing values generated)

. gen a_se=.
(1,213,021 missing values generated)

. gen a = .
(1,213,021 missing values generated)

. gen psi=.
(1,213,021 missing values generated)

. gen psi_se=.
(1,213,021 missing values generated)

. gen id=.
(1,213,021 missing values generated)

. 
. 
. gen hs2=substr(ProductHS,1,2)

. destring hs2, replace
hs2: all characters numeric; replaced as byte

. gen mnf=(hs2>=30 & hs2<=38) | (hs2>=42 & hs2<=97)

. drop hs2

. 
. gen hs6=substr(ProductHS,1,6)

. destring hs6, replace
hs6: all characters numeric; replaced as long

. 
. merge m:1 hs6 using data/concordance/isic_hs6

    Result                      Number of obs
    -----------------------------------------
    Not matched                         4,320
        from master                     3,732  (_merge==1)
        from using                        588  (_merge==2)

    Matched                         1,209,289  (_merge==3)
    -----------------------------------------

. replace isic=3600 if _merge == 1
(3,732 real changes made)

. drop _merge

. 
. winsor2 Dlprice Dln_x_wih, replace cuts(1 99) by(fe1) trim

. rename Dexc_usd Z1

. rename Dexc_col Z2

. 
. generate Z = cond(!missing(Z1) & Z1!=0, Z1, Z2, .)
(4,712 missing values generated)

. ************************************************
. *****   INDUSTRY-LEVEL ESTIMATION    ***********
. ************************************************
. 
. set more off

.         #delimit;
delimiter now ;
.                 ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda = Z Dln_nfirms Dln_nproducts Dltax) Dlexc
>         if isic>=100 & isic<1500, liml a(fe1);
(dropped 400 singleton observations)
(MWFE estimator converged in 1 iterations)

LIML estimation
---------------
k               =1.00131
lambda          =1.00131

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     8377
                                                      F(  3,  7386) =     4.69
                                                      Prob > F      =   0.0028
Total (centered) SS     =  319240372.1                Centered R2   =  -4.1114
Total (uncentered) SS   =  319240372.1                Uncentered R2 =  -4.1114
Residual SS             =   1631753264                Root MSE      =      470

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -6.056288   1.960556    -3.09   0.002    -9.899537    -2.21304
Dln_cond_lambda |  -.0032448   .1406798    -0.02   0.982    -.2790173    .2725277
          Dlexc |   6.231408   1.697167     3.67   0.000     2.904476     9.55834
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          25.459
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                5.627
Stock-Yogo weak ID test critical values: 10% maximal LIML size            4.72
                                         15% maximal LIML size            3.39
                                         20% maximal LIML size            2.99
                                         25% maximal LIML size            2.79
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):          10.979
                                                   Chi-sq(2) P-val =    0.0041
------------------------------------------------------------------------------
Anderson-Rubin statistic (overidentification test of all instruments):  10.986
                                                   Chi-sq(2) P-val =    0.0041
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |       988           0         988     |
-----------------------------------------------------+

. outreg using output/temp/FigP1_C_outreg.tex, varlabels tex fragment replace  
>         ctitle("" "A&M") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g );

                                                           --------------------------------
                                                                                  A&M     
                                                           --------------------------------
                                                            Dlprice              -6.056   
                                                                               (1.961)*** 
                                                            Dln_cond_lambda      -0.003   
                                                                                (0.141)   
                                                            Dlexc                6.231    
                                                                               (1.697)*** 
                                                            N Obs.               8,377    
                                                            Weak Ident Test       5.63    
                                                            UnderIdent P-val      0.00    
                                                            N Prod-Year grs.       .      
                                                           --------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=100 & isic<1500;
(9,075 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=100 & isic<1500;
(9,075 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=100 & isic<1500;
(9,075 real changes made)

.         replace a_se = _se[Dln_cond_lambda]  if isic>=100 & isic<1500;
(9,075 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=100 & isic<1500;
(9,075 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>         + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=100 & isic<1500;
(9,075 real changes made)

.         replace id=1 if isic>=100 & isic<1500;
(9,075 real changes made)

. ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda = Z Dln_nfirms Dln_nproducts Dltax) Dlexc
>         if isic>=1500 & isic<1700, a(fe1)  ;
(dropped 460 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =    13945
                                                      F(  3, 12468) =    37.90
                                                      Prob > F      =   0.0000
Total (centered) SS     =  429089187.9                Centered R2   =  -0.1143
Total (uncentered) SS   =  429089187.9                Uncentered R2 =  -0.1143
Residual SS             =  478130024.9                Root MSE      =    195.8

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -2.113901   .5867979    -3.60   0.000    -3.264115   -.9636864
Dln_cond_lambda |   .1460068   .0456027     3.20   0.001     .0566185    .2353951
          Dlexc |   4.393078   .5771118     7.61   0.000      3.26185    5.524306
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          47.488
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               10.649
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):          79.196
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      1474           0        1474     |
-----------------------------------------------------+

.   outreg using output/temp/FigP1_C_outreg.tex, varlabels tex fragment merge  
>         ctitle( "" "Food") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g );

                                                     --------------------------------------------
                                                                            A&M         Food    
                                                     --------------------------------------------
                                                      Dlprice              -6.056      -2.114   
                                                                         (1.961)***  (0.587)*** 
                                                      Dln_cond_lambda      -0.003      0.146    
                                                                          (0.141)    (0.046)*** 
                                                      Dlexc                6.231       4.393    
                                                                         (1.697)***  (0.577)*** 
                                                      N Obs.               8,377       13,945   
                                                      Weak Ident Test       5.63       10.65    
                                                      UnderIdent P-val      0.00        0.00    
                                                      N Prod-Year grs.       .           .      
                                                     --------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=1500 & isic<1700;
(14,730 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=1500 & isic<1700;
(14,730 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=1500 & isic<1700;
(14,730 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=1500 & isic<1700;
(14,730 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=1500 & isic<1700;
(14,730 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>                 + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=1500 & isic<1700;
(14,730 real changes made)

.         replace id=2 if isic>=1500 & isic<1700;
(14,730 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda = Z Dln_nfirms Dln_nproducts Dltax) Dlexc
>         if isic>=1700 & isic<2000, a(fe1) ;
(dropped 606 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =    99691
                                                      F(  3, 96025) =   272.92
                                                      Prob > F      =   0.0000
Total (centered) SS     =   7459260912                Centered R2   =  -0.0979
Total (uncentered) SS   =   7459260912                Uncentered R2 =  -0.0979
Residual SS             =   8189384270                Root MSE      =      292

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -2.991177   .2270671   -13.17   0.000    -3.436226   -2.546128
Dln_cond_lambda |   .3108223   .0199077    15.61   0.000     .2718035    .3498412
          Dlexc |   5.028804   .3088776    16.28   0.000     4.423408    5.634201
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         399.613
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               96.615
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):         988.317
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      3663           0        3663     |
-----------------------------------------------------+

. outreg using output/temp/FigP1_C_outreg.tex, varlabels tex fragment merge  
>         ctitle( "" "Text&L&F") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g );

                                               --------------------------------------------------------
                                                                      A&M         Food      Text&L&F  
                                               --------------------------------------------------------
                                                Dlprice              -6.056      -2.114      -2.991   
                                                                   (1.961)***  (0.587)***  (0.227)*** 
                                                Dln_cond_lambda      -0.003      0.146       0.311    
                                                                    (0.141)    (0.046)***  (0.020)*** 
                                                Dlexc                6.231       4.393       5.029    
                                                                   (1.697)***  (0.577)***  (0.309)*** 
                                                N Obs.               8,377       13,945      99,691   
                                                Weak Ident Test       5.63       10.65       96.61    
                                                UnderIdent P-val      0.00        0.00        0.00    
                                                N Prod-Year grs.       .           .           .      
                                               --------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=1700 & isic<2000;
(102,553 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=1700 & isic<2000;
(102,553 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=1700 & isic<2000;
(102,553 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=1700 & isic<2000;
(102,553 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=1700 & isic<2000;
(102,553 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>                 + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=1700 & isic<2000;
(102,553 real changes made)

.         replace id=3 if isic>=1700 & isic<2000;
(102,553 real changes made)

. ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda = Z Dln_nfirms Dln_nproducts Dltax) Dlexc
>         if isic>=2000 & isic<2100, a(fe1) ;
(dropped 81 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     4948
                                                      F(  3,  4624) =     2.12
                                                      Prob > F      =   0.0954
Total (centered) SS     =  356723312.5                Centered R2   =  -9.4107
Total (uncentered) SS   =  356723312.5                Uncentered R2 =  -9.4107
Residual SS             =   3713745098                Root MSE      =    896.2

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |   -5.08532   2.602584    -1.95   0.051    -10.18763    .0169861
Dln_cond_lambda |  -.1087791   .3719737    -0.29   0.770     -.838025    .6204668
          Dlexc |   11.37209   5.183525     2.19   0.028     1.209912    21.53428
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):           4.732
                                                   Chi-sq(3) P-val =    0.1925
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                1.106
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.024
                                                   Chi-sq(2) P-val =    0.9882
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |       321           0         321     |
-----------------------------------------------------+

. outreg using output/temp/FigP1_C_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Wood") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

                                         -------------------------------------------------------------------
                                                                A&M         Food      Text&L&F     Wood    
                                         -------------------------------------------------------------------
                                          Dlprice              -6.056      -2.114      -2.991     -5.085   
                                                             (1.961)***  (0.587)***  (0.227)***  (2.603)*  
                                          Dln_cond_lambda      -0.003      0.146       0.311      -0.109   
                                                              (0.141)    (0.046)***  (0.020)***   (0.372)  
                                          Dlexc                6.231       4.393       5.029      11.372   
                                                             (1.697)***  (0.577)***  (0.309)***  (5.184)** 
                                          N Obs.               8,377       13,945      99,691      4,948   
                                          Weak Ident Test       5.63       10.65       96.61       1.11    
                                          UnderIdent P-val      0.00        0.00        0.00       0.19    
                                          N Prod-Year grs.       .           .           .           .     
                                         -------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=2000 & isic<2100;
(5,095 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2000 & isic<2100;
(5,095 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2000 & isic<2100;
(5,095 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=2000 & isic<2100;
(5,095 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2000 & isic<2100;
(5,095 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>                 + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2000 & isic<2100;
(5,095 real changes made)

.         replace id=4 if isic>=2000 & isic<2100;
(5,095 real changes made)

. ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =  Z1 Dln_nfirms Dln_nproducts Dltax) Dlexc
>         if isic>=2100 & isic<2300, a(fe1) ;
(dropped 133 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =    34148
                                                      F(  3, 33226) =    37.27
                                                      Prob > F      =   0.0000
Total (centered) SS     =   2831374243                Centered R2   =  -0.1247
Total (uncentered) SS   =   2831374243                Uncentered R2 =  -0.1247
Residual SS             =   3184411386                Root MSE      =    309.6

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -1.247504   .5926552    -2.10   0.035    -2.409129   -.0858785
Dln_cond_lambda |   .1793552   .0434186     4.13   0.000     .0942532    .2644572
          Dlexc |   2.778863   .5562373     5.00   0.000     1.688619    3.869108
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          19.620
                                                   Chi-sq(3) P-val =    0.0002
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                4.775
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):         128.887
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z1 Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |       919           0         919     |
-----------------------------------------------------+

.   outreg using output/temp/FigP1_C_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Paper") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

                                   -------------------------------------------------------------------------------
                                                          A&M         Food      Text&L&F     Wood       Paper    
                                   -------------------------------------------------------------------------------
                                    Dlprice              -6.056      -2.114      -2.991     -5.085      -1.248   
                                                       (1.961)***  (0.587)***  (0.227)***  (2.603)*   (0.593)**  
                                    Dln_cond_lambda      -0.003      0.146       0.311      -0.109      0.179    
                                                        (0.141)    (0.046)***  (0.020)***   (0.372)   (0.043)*** 
                                    Dlexc                6.231       4.393       5.029      11.372      2.779    
                                                       (1.697)***  (0.577)***  (0.309)***  (5.184)**  (0.556)*** 
                                    N Obs.               8,377       13,945      99,691      4,948      34,148   
                                    Weak Ident Test       5.63       10.65       96.61       1.11        4.77    
                                    UnderIdent P-val      0.00        0.00        0.00       0.19        0.00    
                                    N Prod-Year grs.       .           .           .           .          .      
                                   -------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=2100 & isic<2300;
(35,126 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2100 & isic<2300;
(35,126 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2100 & isic<2300;
(35,126 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=2100 & isic<2300;
(35,126 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2100 & isic<2300;
(35,126 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>                 + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2100 & isic<2300;
(35,126 real changes made)

.         replace id=5 if isic>=2100 & isic<2300;
(35,126 real changes made)

. ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =  Z Dln_nfirms Dln_nproducts Dltariff) 
>  if isic>=2300 & isic<2400, a(fe1) ;
(dropped 33 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     3366
                                                      F(  2,  3190) =     3.63
                                                      Prob > F      =   0.0267
Total (centered) SS     =  164591100.8                Centered R2   =   0.0661
Total (uncentered) SS   =  164591100.8                Uncentered R2 =   0.0661
Residual SS             =  153711040.8                Root MSE      =    219.5

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -.4723818   .3545166    -1.33   0.183    -1.167485    .2227218
Dln_cond_lambda |   .2169006   .0877579     2.47   0.014     .0448329    .3889683
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):           8.887
                                                   Chi-sq(3) P-val =    0.0308
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                2.110
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           9.392
                                                   Chi-sq(2) P-val =    0.0091
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltariff
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |       174           0         174     |
-----------------------------------------------------+

.   outreg using output/temp/FigP1_C_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Petr") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

                              ------------------------------------------------------------------------------------------
                                                     A&M         Food      Text&L&F     Wood       Paper       Petr    
                              ------------------------------------------------------------------------------------------
                               Dlprice              -6.056      -2.114      -2.991     -5.085      -1.248     -0.472   
                                                  (1.961)***  (0.587)***  (0.227)***  (2.603)*   (0.593)**    (0.355)  
                               Dln_cond_lambda      -0.003      0.146       0.311      -0.109      0.179       0.217   
                                                   (0.141)    (0.046)***  (0.020)***   (0.372)   (0.043)***  (0.088)** 
                               Dlexc                6.231       4.393       5.029      11.372      2.779               
                                                  (1.697)***  (0.577)***  (0.309)***  (5.184)**  (0.556)***            
                               N Obs.               8,377       13,945      99,691      4,948      34,148      3,366   
                               Weak Ident Test       5.63       10.65       96.61       1.11        4.77       2.11    
                               UnderIdent P-val      0.00        0.00        0.00       0.19        0.00       0.03    
                               N Prod-Year grs.       .           .           .           .          .           .     
                              ------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]   if isic>=2300 & isic<2400;
(3,454 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2300 & isic<2400;
(3,454 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2300 & isic<2400;
(3,454 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=2300 & isic<2400;
(3,454 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2300 & isic<2400;
(3,454 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2
>                 + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2300 & isic<2400;
(3,454 real changes made)

.         replace id=6 if isic>=2300 & isic<2400;
(3,454 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =  Z Dln_nfirms Dln_nproducts Dlvat) Dlexc
>         if isic>=2400 & isic<2500, a(fe1) ;
(dropped 828 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =   116128
                                                      F(  3,109609) =   129.82
                                                      Prob > F      =   0.0000
Total (centered) SS     =   5539588081                Centered R2   =  -1.8147
Total (uncentered) SS   =   5539588081                Uncentered R2 =  -1.8147
Residual SS             =  1.55921e+10                Root MSE      =    377.2

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -3.876175   .3081307   -12.58   0.000    -4.480107   -3.272243
Dln_cond_lambda |   .0801529   .0241621     3.32   0.001     .0327956    .1275102
          Dlexc |   5.836019   .3379553    17.27   0.000     5.173631    6.498407
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         249.760
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               59.061
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):          96.757
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z Dln_nfirms Dln_nproducts Dlvat
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      6516           0        6516     |
-----------------------------------------------------+

. outreg using output/temp/FigP1_C_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Chem") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

                        ------------------------------------------------------------------------------------------------------
                                               A&M         Food      Text&L&F     Wood       Paper       Petr        Chem    
                        ------------------------------------------------------------------------------------------------------
                         Dlprice              -6.056      -2.114      -2.991     -5.085      -1.248     -0.472      -3.876   
                                            (1.961)***  (0.587)***  (0.227)***  (2.603)*   (0.593)**    (0.355)   (0.308)*** 
                         Dln_cond_lambda      -0.003      0.146       0.311      -0.109      0.179       0.217      0.080    
                                             (0.141)    (0.046)***  (0.020)***   (0.372)   (0.043)***  (0.088)**  (0.024)*** 
                         Dlexc                6.231       4.393       5.029      11.372      2.779                  5.836    
                                            (1.697)***  (0.577)***  (0.309)***  (5.184)**  (0.556)***             (0.338)*** 
                         N Obs.               8,377       13,945      99,691      4,948      34,148      3,366     116,128   
                         Weak Ident Test       5.63       10.65       96.61       1.11        4.77       2.11       59.06    
                         UnderIdent P-val      0.00        0.00        0.00       0.19        0.00       0.03        0.00    
                         N Prod-Year grs.       .           .           .           .          .           .          .      
                        ------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=2400 & isic<2500;
(118,145 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2400 & isic<2500;
(118,145 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2400 & isic<2500;
(118,145 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=2400 & isic<2500;
(118,145 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2400 & isic<2500;
(118,145 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>                 + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2400 & isic<2500;
(118,145 real changes made)

.         replace id=7 if isic>=2400 & isic<2500;
(118,145 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =  Z Dln_nfirms Dln_nproducts Dlvat) Dlexc
>         if isic>=2500 & isic<2600, a(fe1);
(dropped 28 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =   102107
                                                      F(  3,100993) =    59.12
                                                      Prob > F      =   0.0000
Total (centered) SS     =   7786807789                Centered R2   =  -4.2787
Total (uncentered) SS   =   7786807789                Uncentered R2 =  -4.2787
Residual SS             =  4.11045e+10                Root MSE      =      638

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -4.847218   .9649466    -5.02   0.000    -6.738501   -2.955934
Dln_cond_lambda |   .2800955   .0607767     4.61   0.000     .1609739    .3992172
          Dlexc |    5.92354   .9731563     6.09   0.000     4.016165    7.830914
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          31.345
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                7.753
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):         112.018
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z Dln_nfirms Dln_nproducts Dlvat
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      1111           0        1111     |
-----------------------------------------------------+

.  outreg using output/temp/FigP1_C_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Rub&Plas") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

                  ------------------------------------------------------------------------------------------------------------------
                                         A&M         Food      Text&L&F     Wood       Paper       Petr        Chem      Rub&Plas  
                  ------------------------------------------------------------------------------------------------------------------
                   Dlprice              -6.056      -2.114      -2.991     -5.085      -1.248     -0.472      -3.876      -4.847   
                                      (1.961)***  (0.587)***  (0.227)***  (2.603)*   (0.593)**    (0.355)   (0.308)***  (0.965)*** 
                   Dln_cond_lambda      -0.003      0.146       0.311      -0.109      0.179       0.217      0.080       0.280    
                                       (0.141)    (0.046)***  (0.020)***   (0.372)   (0.043)***  (0.088)**  (0.024)***  (0.061)*** 
                   Dlexc                6.231       4.393       5.029      11.372      2.779                  5.836       5.924    
                                      (1.697)***  (0.577)***  (0.309)***  (5.184)**  (0.556)***             (0.338)***  (0.973)*** 
                   N Obs.               8,377       13,945      99,691      4,948      34,148      3,366     116,128     102,107   
                   Weak Ident Test       5.63       10.65       96.61       1.11        4.77       2.11       59.06        7.75    
                   UnderIdent P-val      0.00        0.00        0.00       0.19        0.00       0.03        0.00        0.00    
                   N Prod-Year grs.       .           .           .           .          .           .          .           .      
                  ------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=2500 & isic<2600;
(105,079 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2500 & isic<2600;
(105,079 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2500 & isic<2600;
(105,079 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=2500 & isic<2600;
(105,079 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2500 & isic<2600;
(105,079 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>                 + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2500 & isic<2600;
(105,079 real changes made)

.         replace id=8 if isic>=2500 & isic<2600;
(105,079 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =  Z Dln_nfirms Dln_nproducts Dlvat) Dlexc
>         if isic>=2600 & isic<2700, a(fe1);
(dropped 109 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =    25008
                                                      F(  3, 24156) =    13.36
                                                      Prob > F      =   0.0000
Total (centered) SS     =   1735626442                Centered R2   =  -3.4735
Total (uncentered) SS   =   1735626442                Uncentered R2 =  -3.4735
Residual SS             =   7764350845                Root MSE      =    566.9

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -4.513507    1.21777    -3.71   0.000    -6.900412   -2.126602
Dln_cond_lambda |   .1391622   .0999552     1.39   0.164    -.0567562    .3350805
          Dlexc |   5.713956   1.302185     4.39   0.000     3.161593    8.266319
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          18.603
                                                   Chi-sq(3) P-val =    0.0003
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                4.495
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):          28.303
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z Dln_nfirms Dln_nproducts Dlvat
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |       849           0         849     |
-----------------------------------------------------+

.  outreg using output/temp/FigP1_C_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Miner") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

            ------------------------------------------------------------------------------------------------------------------------------
                                   A&M         Food      Text&L&F     Wood       Paper       Petr        Chem      Rub&Plas     Miner    
            ------------------------------------------------------------------------------------------------------------------------------
             Dlprice              -6.056      -2.114      -2.991     -5.085      -1.248     -0.472      -3.876      -4.847      -4.514   
                                (1.961)***  (0.587)***  (0.227)***  (2.603)*   (0.593)**    (0.355)   (0.308)***  (0.965)***  (1.218)*** 
             Dln_cond_lambda      -0.003      0.146       0.311      -0.109      0.179       0.217      0.080       0.280       0.139    
                                 (0.141)    (0.046)***  (0.020)***   (0.372)   (0.043)***  (0.088)**  (0.024)***  (0.061)***   (0.100)   
             Dlexc                6.231       4.393       5.029      11.372      2.779                  5.836       5.924       5.714    
                                (1.697)***  (0.577)***  (0.309)***  (5.184)**  (0.556)***             (0.338)***  (0.973)***  (1.302)*** 
             N Obs.               8,377       13,945      99,691      4,948      34,148      3,366     116,128     102,107      25,008   
             Weak Ident Test       5.63       10.65       96.61       1.11        4.77       2.11       59.06        7.75        4.50    
             UnderIdent P-val      0.00        0.00        0.00       0.19        0.00       0.03        0.00        0.00        0.00    
             N Prod-Year grs.       .           .           .           .          .           .          .           .           .      
            ------------------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=2600 & isic<2700;
(25,468 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2600 & isic<2700;
(25,468 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2600 & isic<2700;
(25,468 real changes made)

.         replace a_se = _se[Dln_cond_lambda]  if isic>=2600 & isic<2700;
(25,468 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2600 & isic<2700;
(25,468 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>         + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2600 & isic<2700;
(25,468 real changes made)

.         replace id=9 if isic>=2600 & isic<2700;
(25,468 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =  Z Dln_nfirms Dln_nproducts Dlvat) Dlexc
>         if isic>=2700 & isic<2900, a(fe1);
(dropped 473 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =   141653
                                                      F(  3,138716) =   263.01
                                                      Prob > F      =   0.0000
Total (centered) SS     =  1.18821e+10                Centered R2   =  -0.6444
Total (uncentered) SS   =  1.18821e+10                Uncentered R2 =  -0.6444
Residual SS             =  1.95395e+10                Root MSE      =    375.3

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -2.718829   .3695075    -7.36   0.000    -3.443057   -1.994601
Dln_cond_lambda |   .4020562   .0234829    17.12   0.000     .3560301    .4480822
          Dlexc |   4.086142   .4071714    10.04   0.000     3.288094     4.88419
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          85.965
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               21.058
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):         610.062
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z Dln_nfirms Dln_nproducts Dlvat
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      2934           0        2934     |
-----------------------------------------------------+

.   outreg using output/temp/FigP1_C_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "BasFaM") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

      ------------------------------------------------------------------------------------------------------------------------------------------
                             A&M         Food      Text&L&F     Wood       Paper       Petr        Chem      Rub&Plas     Miner       BasFaM   
      ------------------------------------------------------------------------------------------------------------------------------------------
       Dlprice              -6.056      -2.114      -2.991     -5.085      -1.248     -0.472      -3.876      -4.847      -4.514      -2.719   
                          (1.961)***  (0.587)***  (0.227)***  (2.603)*   (0.593)**    (0.355)   (0.308)***  (0.965)***  (1.218)***  (0.370)*** 
       Dln_cond_lambda      -0.003      0.146       0.311      -0.109      0.179       0.217      0.080       0.280       0.139       0.402    
                           (0.141)    (0.046)***  (0.020)***   (0.372)   (0.043)***  (0.088)**  (0.024)***  (0.061)***   (0.100)    (0.023)*** 
       Dlexc                6.231       4.393       5.029      11.372      2.779                  5.836       5.924       5.714       4.086    
                          (1.697)***  (0.577)***  (0.309)***  (5.184)**  (0.556)***             (0.338)***  (0.973)***  (1.302)***  (0.407)*** 
       N Obs.               8,377       13,945      99,691      4,948      34,148      3,366     116,128     102,107      25,008     141,653   
       Weak Ident Test       5.63       10.65       96.61       1.11        4.77       2.11       59.06        7.75        4.50       21.06    
       UnderIdent P-val      0.00        0.00        0.00       0.19        0.00       0.03        0.00        0.00        0.00        0.00    
       N Prod-Year grs.       .           .           .           .          .           .          .           .           .           .      
      ------------------------------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=2700 & isic<2900;
(145,404 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2700 & isic<2900;
(145,404 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2700 & isic<2900;
(145,404 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=2700 & isic<2900;
(145,404 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2700 & isic<2900;
(145,404 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>         + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2700 & isic<2900;
(145,404 real changes made)

.         replace id=10 if isic>=2700 & isic<2900;
(145,404 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =   Z Dln_nfirms Dln_nproducts Dltax) 
>         if isic>=2900 & isic<3100, a(fe1);
(dropped 430 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =   250762
                                                      F(  2,246844) =    68.13
                                                      Prob > F      =   0.0000
Total (centered) SS     =  1.79867e+10                Centered R2   = -12.6046
Total (uncentered) SS   =  1.79867e+10                Uncentered R2 = -12.6046
Residual SS             =  2.44702e+11                Root MSE      =    995.7

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -7.342643   .9230012    -7.96   0.000    -9.151701   -5.533585
Dln_cond_lambda |   .0915517   .0609382     1.50   0.133    -.0278856    .2109891
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          77.639
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               19.112
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):          77.691
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      3916           0        3916     |
-----------------------------------------------------+

.  outreg using output/temp/FigP1_C_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Mach") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

------------------------------------------------------------------------------------------------------------------------------------------------------
                       A&M         Food      Text&L&F     Wood       Paper       Petr        Chem      Rub&Plas     Miner       BasFaM       Mach    
------------------------------------------------------------------------------------------------------------------------------------------------------
 Dlprice              -6.056      -2.114      -2.991     -5.085      -1.248     -0.472      -3.876      -4.847      -4.514      -2.719      -7.343   
                    (1.961)***  (0.587)***  (0.227)***  (2.603)*   (0.593)**    (0.355)   (0.308)***  (0.965)***  (1.218)***  (0.370)***  (0.923)*** 
 Dln_cond_lambda      -0.003      0.146       0.311      -0.109      0.179       0.217      0.080       0.280       0.139       0.402       0.092    
                     (0.141)    (0.046)***  (0.020)***   (0.372)   (0.043)***  (0.088)**  (0.024)***  (0.061)***   (0.100)    (0.023)***   (0.061)   
 Dlexc                6.231       4.393       5.029      11.372      2.779                  5.836       5.924       5.714       4.086                
                    (1.697)***  (0.577)***  (0.309)***  (5.184)**  (0.556)***             (0.338)***  (0.973)***  (1.302)***  (0.407)***             
 N Obs.               8,377       13,945      99,691      4,948      34,148      3,366     116,128     102,107      25,008     141,653     250,762   
 Weak Ident Test       5.63       10.65       96.61       1.11        4.77       2.11       59.06        7.75        4.50       21.06       19.11    
 UnderIdent P-val      0.00        0.00        0.00       0.19        0.00       0.03        0.00        0.00        0.00        0.00        0.00    
 N Prod-Year grs.       .           .           .           .          .           .          .           .           .           .           .      
------------------------------------------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=2900 & isic<3100;
(257,452 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=2900 & isic<3100;
(257,452 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=2900 & isic<3100;
(257,452 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=2900 & isic<3100;
(257,452 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=2900 & isic<3100;
(257,452 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>         + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=2900 & isic<3100;
(257,452 real changes made)

.         replace id=11 if isic>=2900 & isic<3100;
(257,452 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =   Z Dln_nfirms Dln_nproducts Dltax) Dlexc
>         if isic>=3100 & isic<3400, a(fe1);
(dropped 224 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =   243442
                                                      F(  3,240094) =   763.01
                                                      Prob > F      =   0.0000
Total (centered) SS     =  1.81723e+10                Centered R2   =   0.2627
Total (uncentered) SS   =  1.81723e+10                Uncentered R2 =   0.2627
Residual SS             =  1.33981e+10                Root MSE      =    236.2

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -.7981454   .1028913    -7.76   0.000    -.9998098   -.5964811
Dln_cond_lambda |   .3563445   .0108175    32.94   0.000     .3351425    .3775465
          Dlexc |   2.376529    .127909    18.58   0.000     2.125831    2.627227
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         423.923
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              104.705
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):        2349.426
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      3345           0        3345     |
-----------------------------------------------------+

. outreg using output/temp/FigP1_C_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Elec") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

------------------------------------------------------------------------------------------------------------------------------------------------------
                       A&M         Food      Text&L&F     Wood       Paper       Petr        Chem      Rub&Plas     Miner       BasFaM       Mach    
------------------------------------------------------------------------------------------------------------------------------------------------------
 Dlprice              -6.056      -2.114      -2.991     -5.085      -1.248     -0.472      -3.876      -4.847      -4.514      -2.719      -7.343   
                    (1.961)***  (0.587)***  (0.227)***  (2.603)*   (0.593)**    (0.355)   (0.308)***  (0.965)***  (1.218)***  (0.370)***  (0.923)*** 
 Dln_cond_lambda      -0.003      0.146       0.311      -0.109      0.179       0.217      0.080       0.280       0.139       0.402       0.092    
                     (0.141)    (0.046)***  (0.020)***   (0.372)   (0.043)***  (0.088)**  (0.024)***  (0.061)***   (0.100)    (0.023)***   (0.061)   
 Dlexc                6.231       4.393       5.029      11.372      2.779                  5.836       5.924       5.714       4.086                
                    (1.697)***  (0.577)***  (0.309)***  (5.184)**  (0.556)***             (0.338)***  (0.973)***  (1.302)***  (0.407)***             
 N Obs.               8,377       13,945      99,691      4,948      34,148      3,366     116,128     102,107      25,008     141,653     250,762   
 Weak Ident Test       5.63       10.65       96.61       1.11        4.77       2.11       59.06        7.75        4.50       21.06       19.11    
 UnderIdent P-val      0.00        0.00        0.00       0.19        0.00       0.03        0.00        0.00        0.00        0.00        0.00    
 N Prod-Year grs.       .           .           .           .          .           .          .           .           .           .           .      
------------------------------------------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


                                                           --------------------------------
                                                                                  Elec    
                                                           --------------------------------
                                                            Dlprice              -0.798   
                                                                               (0.103)*** 
                                                            Dln_cond_lambda      0.356    
                                                                               (0.011)*** 
                                                            Dlexc                2.377    
                                                                               (0.128)*** 
                                                            N Obs.              243,442   
                                                            Weak Ident Test      104.70   
                                                            UnderIdent P-val      0.00    
                                                            N Prod-Year grs.       .      
                                                           --------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=3100 & isic<3400;
(249,238 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=3100 & isic<3400;
(249,238 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=3100 & isic<3400;
(249,238 real changes made)

.         replace a_se = _se[Dln_cond_lambda]  if isic>=3100 & isic<3400;
(249,238 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=3100 & isic<3400;
(249,238 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>         + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=3100 & isic<3400;
(249,238 real changes made)

.         replace id=12 if isic>=3100 & isic<3400;
(249,238 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =   Z Dln_nfirms Dln_nproducts Dltariff) Dlexc
>         if isic>=3400 & isic<3600, a(fe1);
(dropped 84 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =    73970
                                                      F(  3, 72976) =   489.01
                                                      Prob > F      =   0.0000
Total (centered) SS     =   5106094470                Centered R2   =   0.0674
Total (uncentered) SS   =   5106094470                Uncentered R2 =   0.0674
Residual SS             =   4762126011                Root MSE      =    255.5

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |  -1.769383    .360493    -4.91   0.000    -2.475948   -1.062818
Dln_cond_lambda |   .6884938   .0211542    32.55   0.000     .6470317    .7299559
          Dlexc |    3.21631    .463378     6.94   0.000     2.308091     4.12453
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          44.523
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               10.988
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):         609.053
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltariff
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |       991           0         991     |
-----------------------------------------------------+

. outreg using output/temp/FigP1_C_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "Trnsp") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

------------------------------------------------------------------------------------------------------------------------------------------------------
                       A&M         Food      Text&L&F     Wood       Paper       Petr        Chem      Rub&Plas     Miner       BasFaM       Mach    
------------------------------------------------------------------------------------------------------------------------------------------------------
 Dlprice              -6.056      -2.114      -2.991     -5.085      -1.248     -0.472      -3.876      -4.847      -4.514      -2.719      -7.343   
                    (1.961)***  (0.587)***  (0.227)***  (2.603)*   (0.593)**    (0.355)   (0.308)***  (0.965)***  (1.218)***  (0.370)***  (0.923)*** 
 Dln_cond_lambda      -0.003      0.146       0.311      -0.109      0.179       0.217      0.080       0.280       0.139       0.402       0.092    
                     (0.141)    (0.046)***  (0.020)***   (0.372)   (0.043)***  (0.088)**  (0.024)***  (0.061)***   (0.100)    (0.023)***   (0.061)   
 Dlexc                6.231       4.393       5.029      11.372      2.779                  5.836       5.924       5.714       4.086                
                    (1.697)***  (0.577)***  (0.309)***  (5.184)**  (0.556)***             (0.338)***  (0.973)***  (1.302)***  (0.407)***             
 N Obs.               8,377       13,945      99,691      4,948      34,148      3,366     116,128     102,107      25,008     141,653     250,762   
 Weak Ident Test       5.63       10.65       96.61       1.11        4.77       2.11       59.06        7.75        4.50       21.06       19.11    
 UnderIdent P-val      0.00        0.00        0.00       0.19        0.00       0.03        0.00        0.00        0.00        0.00        0.00    
 N Prod-Year grs.       .           .           .           .          .           .          .           .           .           .           .      
------------------------------------------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


                                                     --------------------------------------------
                                                                            Elec       Trnsp    
                                                     --------------------------------------------
                                                      Dlprice              -0.798      -1.769   
                                                                         (0.103)***  (0.360)*** 
                                                      Dln_cond_lambda      0.356       0.688    
                                                                         (0.011)***  (0.021)*** 
                                                      Dlexc                2.377       3.216    
                                                                         (0.128)***  (0.463)*** 
                                                      N Obs.              243,442      73,970   
                                                      Weak Ident Test      104.70      10.99    
                                                      UnderIdent P-val      0.00        0.00    
                                                      N Prod-Year grs.       .           .      
                                                     --------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=3400 & isic<3600;
(75,857 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=3400 & isic<3600;
(75,857 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda])  if isic>=3400 & isic<3600;
(75,857 real changes made)

.         replace a_se = _se[Dln_cond_lambda]  if isic>=3400 & isic<3600;
(75,857 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=3400 & isic<3600;
(75,857 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 + 
>         (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=3400 & isic<3600;
(75,857 real changes made)

.         replace id=13  if isic>=3400 & isic<3600;
(75,857 real changes made)

.         ivreghdfe Dln_x_wih  (Dlprice Dln_cond_lambda =   Z Dln_nfirms Dln_nproducts Dltax) Dlexc
>         if isic>=3600 & isic<3800, a(fe1);
(dropped 118 singleton observations)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =    64471
                                                      F(  3, 63244) =    36.76
                                                      Prob > F      =   0.0000
Total (centered) SS     =   4948125319                Centered R2   =  -5.9728
Total (uncentered) SS   =   4948125319                Uncentered R2 =  -5.9728
Residual SS             =  3.45024e+10                Root MSE      =    738.6

---------------------------------------------------------------------------------
      Dln_x_wih | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
        Dlprice |   -5.55256   .8479339    -6.55   0.000    -7.214512   -3.890608
Dln_cond_lambda |   .1160592   .0885012     1.31   0.190    -.0574032    .2895217
          Dlexc |   7.432792   1.027485     7.23   0.000      5.41892    9.446664
---------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          52.431
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               12.868
Stock-Yogo weak ID test critical values:  5% maximal IV relative bias    11.04
                                         10% maximal IV relative bias     7.56
                                         20% maximal IV relative bias     5.57
                                         30% maximal IV relative bias     4.73
                                         10% maximal IV size             16.87
                                         15% maximal IV size              9.93
                                         20% maximal IV size              7.54
                                         25% maximal IV size              6.28
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):          14.835
                                                   Chi-sq(2) P-val =    0.0006
------------------------------------------------------------------------------
Instrumented:         Dlprice Dln_cond_lambda
Included instruments: Dlexc
Excluded instruments: Z Dln_nfirms Dln_nproducts Dltax
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         fe1 |      1224           0        1224     |
-----------------------------------------------------+

. outreg using output/temp/FigP1_C_outreg.tex, varlabels tex fragment merge  
>         ctitle("" "MnfR") nocons se bdec(3) statfont(normalsize)
>         sigsymbols(*,**,***) starlevels(10 5 1) hlines(101{0}1010010001)  
>         summtitle( N Obs.\Weak Ident Test \UnderIdent P-val\ N Prod-Year grs.)
>         summstat(N\widstat \idp\ N_g ) ;

------------------------------------------------------------------------------------------------------------------------------------------------------
                       A&M         Food      Text&L&F     Wood       Paper       Petr        Chem      Rub&Plas     Miner       BasFaM       Mach    
------------------------------------------------------------------------------------------------------------------------------------------------------
 Dlprice              -6.056      -2.114      -2.991     -5.085      -1.248     -0.472      -3.876      -4.847      -4.514      -2.719      -7.343   
                    (1.961)***  (0.587)***  (0.227)***  (2.603)*   (0.593)**    (0.355)   (0.308)***  (0.965)***  (1.218)***  (0.370)***  (0.923)*** 
 Dln_cond_lambda      -0.003      0.146       0.311      -0.109      0.179       0.217      0.080       0.280       0.139       0.402       0.092    
                     (0.141)    (0.046)***  (0.020)***   (0.372)   (0.043)***  (0.088)**  (0.024)***  (0.061)***   (0.100)    (0.023)***   (0.061)   
 Dlexc                6.231       4.393       5.029      11.372      2.779                  5.836       5.924       5.714       4.086                
                    (1.697)***  (0.577)***  (0.309)***  (5.184)**  (0.556)***             (0.338)***  (0.973)***  (1.302)***  (0.407)***             
 N Obs.               8,377       13,945      99,691      4,948      34,148      3,366     116,128     102,107      25,008     141,653     250,762   
 Weak Ident Test       5.63       10.65       96.61       1.11        4.77       2.11       59.06        7.75        4.50       21.06       19.11    
 UnderIdent P-val      0.00        0.00        0.00       0.19        0.00       0.03        0.00        0.00        0.00        0.00        0.00    
 N Prod-Year grs.       .           .           .           .          .           .          .           .           .           .           .      
------------------------------------------------------------------------------------------------------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


                                               --------------------------------------------------------
                                                                      Elec       Trnsp        MnfR    
                                               --------------------------------------------------------
                                                Dlprice              -0.798      -1.769      -5.553   
                                                                   (0.103)***  (0.360)***  (0.848)*** 
                                                Dln_cond_lambda      0.356       0.688       0.116    
                                                                   (0.011)***  (0.021)***   (0.089)   
                                                Dlexc                2.377       3.216       7.433    
                                                                   (0.128)***  (0.463)***  (1.027)*** 
                                                N Obs.              243,442      73,970      64,471   
                                                Weak Ident Test      104.70      10.99       12.87    
                                                UnderIdent P-val      0.00        0.00        0.00    
                                                N Prod-Year grs.       .           .           .      
                                               --------------------------------------------------------
                                                            * p<0.1; ** p<0.05; *** p<0.01


.         replace theta = -_b[Dlprice]  if isic>=3600 & isic<3800;
(65,784 real changes made)

.         replace theta_se = _se[Dlprice]  if isic>=3600 & isic<3800;
(65,784 real changes made)

.         replace a = (1 - _b[Dln_cond_lambda]) if isic>=3600 & isic<3800;
(65,784 real changes made)

.         replace a_se = _se[Dln_cond_lambda] if isic>=3600 & isic<3800;
(65,784 real changes made)

.         replace psi = -(1 - _b[Dln_cond_lambda])/_b[Dlprice]  if isic>=3600 & isic<3800;
(65,784 real changes made)

.         replace psi_se = psi * ( (_se[Dlprice]/_b[Dlprice])^2 
>         + (_se[Dln_cond_lambda]/(1-_b[Dln_cond_lambda]))^2 )^0.5 if isic>=3600 & isic<3800;
(65,784 real changes made)

.         replace id=14 if isic>=3600 & isic<3800;
(65,784 real changes made)

.         collapse  theta psi, by(id);

. save data/internally_generated/figP1_large_firms.dta, replace;
file data/internally_generated/figP1_large_firms.dta saved

. 
end of do-file
. 
. *************** Figure 9: Top Pannel *********************
. }

. 
. 
. 
. use data/internally_generated/figP1_initial_share_iv

. merge 1:1 id using data/temp/baseline_estimates

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                                15  (_merge==3)
    -----------------------------------------

. 
. scatter theta theta_base, msymbol(O) mcolor(k) || function y=x, range(0 8) xsize(5) ysize(5) ///
> ytitle(Alternative Estimation, size(med)) xtitle(Baseline Estimation , size(med)) legend(off) ///
> lwidth(medthin) lcolor(red) lpattern(dash) title({&sigma}{subscript:k}-1, size(huge)  position(12)) saving(output/temp/figP1_A, replace)
(note:  named style k not found in class color, default attributes used)
(note:  named style k not found in class color, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(file output/temp/figP1_A.gph not found)
file output/temp/figP1_A.gph saved

. *graph export output/temp/figP1_11.png, replace
. 
. scatter psi psi_base, msymbol(O) mcolor(k) xscale(log) yscale(log) || function y=x,  range(0.1 2) xsize(5) ysize(5) xscale(log) yscale(log) ///
> ytitle(Alternative Estimation, size(med)) xtitle(Baseline Estimation , size(med)) legend(off) ///
> lwidth(medthin) lcolor(red) lpattern(dash) title({&mu}{subscript:k}, size(huge)  position(12)) saving(output/temp/figP1_B, replace)
(note:  named style k not found in class color, default attributes used)
(note:  named style k not found in class color, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(file output/temp/figP1_B.gph not found)
file output/temp/figP1_B.gph saved

. *graph export output/temp/figP1_12.png, replace
. 
. graph combine output/temp/figP1_A.gph output/temp/figP1_B.gph, r(1) c(2) title("Constructing IV using 4th Lags ", size(large) position(12)) xsize(8)
>  ysize(4)
(note:  named style k not found in class color, default attributes used)
(note:  named style k not found in class color, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style k not found in class color, default attributes used)
(note:  named style k not found in class color, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)

. graph export "output/Figure_P1_A.pdf", replace
file /Users/ahmadlp/Dropbox/LL2020/Replication_Aug_2023/Stata/output/Figure_P1_A.pdf saved as PDF format

. 
. *************** Figure 9: Middle Pannel *********************
.  use data/internally_generated/figP1_large_firms, clear

. merge 1:1 id using data/temp/baseline_estimates

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                                15  (_merge==3)
    -----------------------------------------

. 
. scatter theta theta_base, msymbol(O) mcolor(k) || function y=x, range(0 8) xsize(5) ysize(5) ///
> ytitle(Alternative Estimation, size(med)) xtitle(Baseline Estimation , size(med)) legend(off) ///
> lwidth(medthin) lcolor(red) lpattern(dash) title({&sigma}{subscript:k}-1, size(huge)  position(12)) saving(output/temp/figP1_A, replace)
(note:  named style k not found in class color, default attributes used)
(note:  named style k not found in class color, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
file output/temp/figP1_A.gph saved

. *graph export output/temp/figP1_21.png, replace
. 
. 
. scatter psi psi_base, msymbol(O) mcolor(k) xscale(log) yscale(log) || function y=x,  range(0.1 2) xsize(5) ysize(5) xscale(log) yscale(log) ///
> ytitle(Alternative Estimation, size(med)) xtitle(Baseline Estimation , size(med)) legend(off) ///
> lwidth(medthin) lcolor(red) lpattern(dash) title({&mu}{subscript:k}, size(huge)  position(12)) saving(output/temp/figP1_B, replace)
(note:  named style k not found in class color, default attributes used)
(note:  named style k not found in class color, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
file output/temp/figP1_B.gph saved

. *graph export output/temp/figP1_22.png, replace
. 
. graph combine output/temp/figP1_A.gph output/temp/figP1_B.gph, r(1) c(2) title("Controlling for Changes in Annual Exchange Rate", size(large) positi
> on(12)) xsize(8) ysize(4)
(note:  named style k not found in class color, default attributes used)
(note:  named style k not found in class color, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style k not found in class color, default attributes used)
(note:  named style k not found in class color, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)

. graph export "output/Figure_P1_B.pdf", replace
file /Users/ahmadlp/Dropbox/LL2020/Replication_Aug_2023/Stata/output/Figure_P1_B.pdf saved as PDF format

. 
. *************** Figure 9: Bottom Pannel *********************
. use data/internally_generated/figP1_exc_rate_control, clear

. merge 1:1 id using data/temp/baseline_estimates

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                                15  (_merge==3)
    -----------------------------------------

. 
. scatter theta theta_base, msymbol(O) mcolor(k) || function y=x, range(0 8) xsize(5) ysize(5) ///
> ytitle(Alternative Estimation, size(med)) xtitle(Baseline Estimation , size(med)) legend(off) ///
> lwidth(medthin) lcolor(red) lpattern(dash) title({&sigma}{subscript:k}-1, size(huge)  position(12)) saving(output/temp/figP1_A, replace)
(note:  named style k not found in class color, default attributes used)
(note:  named style k not found in class color, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
file output/temp/figP1_A.gph saved

. *graph export output/temp/figP1_31.png, replace
. 
. 
. scatter psi psi_base, msymbol(O) mcolor(k) xscale(log) yscale(log) || function y=x,  range(0.1 2) xsize(5) ysize(5) xscale(log) yscale(log) ///
> ytitle(Alternative Estimation, size(med)) xtitle(Baseline Estimation , size(med))  legend(off) ///
> lwidth(medthin) lcolor(red) lpattern(dash) title({&mu}{subscript:k}, size(huge)  position(12)) saving(output/temp/figP1_B, replace)
(note:  named style k not found in class color, default attributes used)
(note:  named style k not found in class color, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
file output/temp/figP1_B.gph saved

. *graph export output/temp/figP1_32.png, replace
. 
. graph combine output/temp/figP1_A.gph output/temp/figP1_B.gph, r(1) c(2) title("Dropping Large Mullti-Product Firms", size(large) position(12)) xsiz
> e(8) ysize(4)
(note:  named style k not found in class color, default attributes used)
(note:  named style k not found in class color, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style k not found in class color, default attributes used)
(note:  named style k not found in class color, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)

. graph export "output/Figure_P1_C.pdf", replace
file /Users/ahmadlp/Dropbox/LL2020/Replication_Aug_2023/Stata/output/Figure_P1_C.pdf saved as PDF format

. 
. 
. erase output/temp/figP1_A.gph

. erase output/temp/figP1_B.gph

. erase data/temp/baseline_estimates.dta

. *erase data/internally_generated/figP1_initial_share_iv
. *erase data/internally_generated/fig9_exc_rate_control
. *erase data/internally_generated/fig9_large_firms
. 
. graph close

. log close
      name:  <unnamed>
       log:  /Users/ahmadlp/Dropbox/LL2020/Replication_Aug_2023/Stata/logs/9-figure_P1.log
  log type:  text
 closed on:   8 Aug 2023, 18:04:00
------------------------------------------------------------------------------------------------------------------------------------------------------
